{
  "token_to_id": {
    "26,33,38,45,57,69,71,73,74,76,78,79,81": 1,
    "26,38,50,52,66,67": 2,
    "26,38,57,69,71,74,78,79": 3,
    "26,50,53,57,62": 4,
    "26,50,54,69,70": 5,
    "26,50,55,57,62,66": 6,
    "26,50,57,62,66": 7,
    "26,50,62,69,72": 8,
    "26,54,62,69,72": 9,
    "27,34,51": 10,
    "27,50": 11,
    "28,40,52,54,67,69": 12,
    "28,40,52,59,62,64,68": 13,
    "28,52,55,59,64": 14,
    "28,52,55,61,62,67": 15,
    "28,52,59,62,67": 16,
    "28,52,64,71,74": 17,
    "28,55,64,71,74": 18,
    "29": 19,
    "29,34,53,57,60,65,70,74": 20,
    "29,36,48,53,57,60,67,72,75": 21,
    "29,41": 22,
    "29,53,57,60": 23,
    "29,53,57,60,65": 24,
    "29,53,57,60,65,69": 25,
    "29,53,57,60,69": 26,
    "29,53,57,60,69,72": 27,
    "29,53,57,60,72": 28,
    "29,53,57,62,69,74": 29,
    "29,53,57,62,69,77": 30,
    "29,53,57,70,75": 31,
    "29,53,57,72,74": 32,
    "29,53,60,63,65,69": 33,
    "29,53,60,65,69": 34,
    "29,53,60,69": 35,
    "29,53,62,65,70": 36,
    "29,53,65": 37,
    "29,53,65,67,69": 38,
    "29,53,65,69": 39,
    "29,53,69": 40,
    "29,53,69,72": 41,
    "29,53,72": 42,
    "29,57,60,65": 43,
    "29,57,65": 44,
    "29,57,65,69": 45,
    "29,57,69,72": 46,
    "29,57,72": 47,
    "29,60,67,69": 48,
    "29,69": 49,
    "30,31,42,43,50,57,59,61": 50,
    "30,38,42,50,57,62,69": 51,
    "30,42,54,55,57,62,66,69,71,74,78,81": 52,
    "30,42,54,55,57,64,66,69,71,74,76,78,79": 53,
    "30,42,54,66,68,70,76,78": 54,
    "30,42,54,68,70,73,76,78": 55,
    "30,42,54,70,73": 56,
    "30,42,54,71,73,74,76,78": 57,
    "30,42,54,71,74,76": 58,
    "30,42,57,61,62": 59,
    "30,42,61,66,69,73": 60,
    "30,42,62,64,70,71,73": 61,
    "30,42,62,69,72,74,76": 62,
    "30,42,66,69": 63,
    "30,42,69,74,81": 64,
    "30,42,74,79,81": 65,
    "30,54,57,62,69": 66,
    "30,54,61,70": 67,
    "30,54,61,71": 68,
    "30,54,64,70": 69,
    "30,54,66,72,76": 70,
    "30,54,70": 71,
    "30,57,66,72,76": 72,
    "30,64,70": 73,
    "31": 74,
    "31,33,43,45,57,59,61,64": 75,
    "31,34,62,67,70": 76,
    "31,35,43,47,59,62,64": 77,
    "31,41": 78,
    "31,43": 79,
    "31,43,50,55,57,59,60,62,67": 80,
    "31,43,50,59,67": 81,
    "31,43,55,59,62,67": 82,
    "31,43,57,59": 83,
    "31,43,59,64": 84,
    "31,43,62,67,71,73,74": 85,
    "31,43,69,71,73,74,76": 86,
    "31,43,69,71,74,76,78": 87,
    "31,48,50,58,62,67": 88,
    "31,50,55,58,62,67": 89,
    "31,50,55,59,67": 90,
    "31,50,55,62,67": 91,
    "31,50,55,62,67,69,71": 92,
    "31,50,55,62,67,71": 93,
    "31,50,59,62,67": 94,
    "31,50,60,62,67": 95,
    "31,50,62,67,71": 96,
    "31,50,65,72": 97,
    "31,51,53,60,67": 98,
    "31,51,59,67": 99,
    "31,52,59,64": 100,
    "31,52,59,64,67": 101,
    "31,52,61,64,69": 102,
    "31,52,64,71": 103,
    "31,52,64,73": 104,
    "31,54,55,58,62,67": 105,
    "31,54,55,59,62,67": 106,
    "31,54,59,62,67": 107,
    "31,54,62": 108,
    "31,55,57,60": 109,
    "31,55,57,64,69,76": 110,
    "31,55,58,62": 111,
    "31,55,58,62,67": 112,
    "31,55,58,62,67,70": 113,
    "31,55,58,62,70": 114,
    "31,55,58,62,70,74": 115,
    "31,55,58,62,74": 116,
    "31,55,58,62,77": 117,
    "31,55,58,63,70": 118,
    "31,55,58,70,75": 119,
    "31,55,59,62,67": 120,
    "31,55,59,64": 121,
    "31,55,59,65,72": 122,
    "31,55,59,65,74": 123,
    "31,55,59,67": 124,
    "31,55,59,67,71": 125,
    "31,55,59,71": 126,
    "31,55,60,62,69,70": 127,
    "31,55,60,63,69,72": 128,
    "31,55,60,64": 129,
    "31,55,60,64,72": 130,
    "31,55,60,69": 131,
    "31,55,62,64,70": 132,
    "31,55,62,65,71": 133,
    "31,55,62,67,71": 134,
    "31,55,62,69,71": 135,
    "31,55,62,70": 136,
    "31,55,62,70,77": 137,
    "31,55,62,71": 138,
    "31,55,62,72": 139,
    "31,55,64": 140,
    "31,55,64,65,70": 141,
    "31,55,64,70": 142,
    "31,55,65,67,70": 143,
    "31,55,65,70": 144,
    "31,55,65,71,72": 145,
    "31,55,67": 146,
    "31,55,67,70": 147,
    "31,55,67,70,74": 148,
    "31,55,67,71": 149,
    "31,55,67,74,78": 150,
    "31,55,69,70": 151,
    "31,55,71,74": 152,
    "31,55,74": 153,
    "31,57,59,60": 154,
    "31,57,60": 155,
    "31,58,62,67": 156,
    "31,58,65,70": 157,
    "31,58,67": 158,
    "31,59,62,67": 159,
    "31,59,67": 160,
    "31,59,67,71": 161,
    "31,59,67,74,78": 162,
    "31,59,71,74": 163,
    "31,59,74": 164,
    "31,60,62,66,67,69,71": 165,
    "31,60,62,67,72": 166,
    "31,60,63": 167,
    "31,60,69": 168,
    "31,62,67,70": 169,
    "31,62,67,71": 170,
    "31,62,67,72": 171,
    "31,63": 172,
    "31,63,67": 173,
    "31,65,67,71": 174,
    "31,67": 175,
    "31,71": 176,
    "32,33,44,45,57,59,61,62": 177,
    "32,44,56,57,59,64,71,73,74": 178,
    "32,44,56,57,62,64,71,73,74,78": 179,
    "32,44,56,57,64,71,73,74": 180,
    "32,44,56,57,64,71,73,74,76": 181,
    "32,44,56,59,64,71,74,76": 182,
    "32,44,59,62": 183,
    "32,56,59,64": 184,
    "32,56,59,64,71": 185,
    "32,56,59,64,74": 186,
    "33": 187,
    "33,34,57,60,65,72,74": 188,
    "33,34,58,65,74,75": 189,
    "33,35,45,47,57,61,62": 190,
    "33,35,55,72,74": 191,
    "33,36": 192,
    "33,36,57,64,69,72": 193,
    "33,36,65,69": 194,
    "33,36,72,74,75": 195,
    "33,37,45,49,64,67,81,83": 196,
    "33,37,45,49,69,73,76,81": 197,
    "33,37,49,57,64,67": 198,
    "33,38,45,50,62,64,79,81": 199,
    "33,38,49,50,57,66,67": 200,
    "33,38,57,60,65,72,74": 201,
    "33,38,66,67,76": 202,
    "33,41": 203,
    "33,41,53,65,72": 204,
    "33,43": 205,
    "33,43,79": 206,
    "33,45": 207,
    "33,45,57,59,61,62": 208,
    "33,45,57,61": 209,
    "33,45,57,61,69,73,74,76,78,81": 210,
    "33,45,60,65": 211,
    "33,45,61,64,69,73,81": 212,
    "33,45,61,69": 213,
    "33,45,61,69,71,73,74,76": 214,
    "33,45,64,65": 215,
    "33,45,64,66,69,73": 216,
    "33,45,64,68,69,73,76,78": 217,
    "33,45,64,69,71,73,76": 218,
    "33,45,64,69,73,76": 219,
    "33,45,64,81": 220,
    "33,45,65,69": 221,
    "33,45,66,67,69,71,76": 222,
    "33,45,66,67,69,74,76": 223,
    "33,45,66,69,74": 224,
    "33,45,66,78": 225,
    "33,45,67,74,76": 226,
    "33,45,69,73,74,76,81": 227,
    "33,45,73,81": 228,
    "33,48,53,60": 229,
    "33,48,53,63": 230,
    "33,48,53,65": 231,
    "33,48,60,62,66": 232,
    "33,48,60,64": 233,
    "33,48,60,69": 234,
    "33,48,64,69": 235,
    "33,48,69": 236,
    "33,49,57,67": 237,
    "33,52,57,59": 238,
    "33,52,57,60": 239,
    "33,52,57,60,64": 240,
    "33,52,57,60,67": 241,
    "33,52,57,61,64,69": 242,
    "33,52,57,61,69": 243,
    "33,52,57,62,67": 244,
    "33,52,57,64,69,72": 245,
    "33,52,57,67": 246,
    "33,52,57,72": 247,
    "33,52,57,74": 248,
    "33,52,60,64,69": 249,
    "33,52,61,67": 250,
    "33,52,62,67": 251,
    "33,52,67": 252,
    "33,53,57,62,65": 253,
    "33,53,60,69,77": 254,
    "33,53,62,65": 255,
    "33,53,62,69": 256,
    "33,53,65,72": 257,
    "33,53,65,72,74": 258,
    "33,54,55,57,61,62,64": 259,
    "33,54,55,62,64": 260,
    "33,54,59,61,63": 261,
    "33,54,59,63": 262,
    "33,54,59,71": 263,
    "33,54,62,69,72": 264,
    "33,54,63": 265,
    "33,54,63,71": 266,
    "33,54,64,72": 267,
    "33,54,66,72": 268,
    "33,54,69,72": 269,
    "33,55,57,61,64": 270,
    "33,55,57,62,65": 271,
    "33,55,60,64": 272,
    "33,55,61,62,64": 273,
    "33,55,61,64": 274,
    "33,55,61,69": 275,
    "33,55,62,65": 276,
    "33,55,64,69,72": 277,
    "33,55,67,72": 278,
    "33,55,72": 279,
    "33,56,57,60,64,69": 280,
    "33,56,57,64,69,72": 281,
    "33,56,64,69,72": 282,
    "33,57,60,64": 283,
    "33,57,60,64,69": 284,
    "33,57,60,64,72": 285,
    "33,57,60,65": 286,
    "33,57,60,65,69": 287,
    "33,57,60,65,72": 288,
    "33,57,60,65,72,75": 289,
    "33,57,60,65,75": 290,
    "33,57,60,65,77": 291,
    "33,57,60,66": 292,
    "33,57,60,67": 293,
    "33,57,60,69": 294,
    "33,57,60,69,77": 295,
    "33,57,60,69,77,79": 296,
    "33,57,60,75": 297,
    "33,57,61,62,64": 298,
    "33,57,61,64,69": 299,
    "33,57,61,67,76": 300,
    "33,57,61,69": 301,
    "33,57,61,69,76": 302,
    "33,57,61,76,77": 303,
    "33,57,62,64": 304,
    "33,57,62,65,69": 305,
    "33,57,62,76,77": 306,
    "33,57,64": 307,
    "33,57,64,69": 308,
    "33,57,64,69,72": 309,
    "33,57,64,72": 310,
    "33,57,64,74": 311,
    "33,57,64,76": 312,
    "33,57,65,72,75,77": 313,
    "33,57,66": 314,
    "33,57,66,67,72": 315,
    "33,57,67,69,72": 316,
    "33,57,67,72": 317,
    "33,57,69": 318,
    "33,57,69,72": 319,
    "33,57,69,73": 320,
    "33,57,69,76,79": 321,
    "33,57,71,72": 322,
    "33,57,73,76": 323,
    "33,57,76": 324,
    "33,58,60,69,77": 325,
    "33,59,60,62": 326,
    "33,59,60,64": 327,
    "33,59,60,64,69": 328,
    "33,59,62": 329,
    "33,60,64,69": 330,
    "33,60,65,69": 331,
    "33,60,67,69": 332,
    "33,60,69,76,79": 333,
    "33,61,69": 334,
    "33,61,69,73": 335,
    "33,61,73,76": 336,
    "33,61,76": 337,
    "33,62,64,69": 338,
    "33,64": 339,
    "33,64,69": 340,
    "33,64,69,72": 341,
    "33,64,72": 342,
    "33,65": 343,
    "33,65,69": 344,
    "33,67,74,76": 345,
    "33,67,76": 346,
    "33,69": 347,
    "33,69,72,77": 348,
    "33,72,79": 349,
    "33,77": 350,
    "34": 351,
    "34,36": 352,
    "34,36,58,60,63,65,69,77": 353,
    "34,38": 354,
    "34,38,53,62,70": 355,
    "34,39,46,55,58,65,70,74": 356,
    "34,41": 357,
    "34,41,53,60,62,69,70": 358,
    "34,41,53,62,70": 359,
    "34,43,55,62,74": 360,
    "34,43,55,67,74": 361,
    "34,44,60,61": 362,
    "34,44,61,72": 363,
    "34,45,62,64": 364,
    "34,46,50,65,70,74": 365,
    "34,46,58,65,70,74": 366,
    "34,46,65,70,74": 367,
    "34,46,67,70": 368,
    "34,46,70,74,77,82": 369,
    "34,50,53,65,70,74": 370,
    "34,50,55,62,67": 371,
    "34,50,55,62,70": 372,
    "34,50,55,67": 373,
    "34,50,55,67,70": 374,
    "34,50,55,70": 375,
    "34,50,55,70,74": 376,
    "34,50,55,74": 377,
    "34,50,65,70,74": 378,
    "34,51": 379,
    "34,51,55,63": 380,
    "34,53,58,62,65,70": 381,
    "34,53,58,65,70,74": 382,
    "34,53,58,65,74": 383,
    "34,53,58,69,70": 384,
    "34,53,58,72,74": 385,
    "34,53,58,75,77": 386,
    "34,53,62": 387,
    "34,53,62,65,70": 388,
    "34,53,62,70": 389,
    "34,53,65,70,74": 390,
    "34,54,61,63,64": 391,
    "34,54,61,64": 392,
    "34,55,62": 393,
    "34,55,62,63,67": 394,
    "34,55,62,70": 395,
    "34,55,64": 396,
    "34,55,65": 397,
    "34,55,67,74": 398,
    "34,57,62": 399,
    "34,57,64": 400,
    "34,57,65": 401,
    "34,58,60,62,65,69,70": 402,
    "34,58,60,64,67": 403,
    "34,58,60,65,69": 404,
    "34,58,60,67": 405,
    "34,58,60,67,72": 406,
    "34,58,60,67,74": 407,
    "34,58,60,67,75": 408,
    "34,58,60,67,76": 409,
    "34,58,60,75": 410,
    "34,58,62,65": 411,
    "34,58,62,65,70": 412,
    "34,58,62,65,70,74": 413,
    "34,58,62,65,72": 414,
    "34,58,62,65,74": 415,
    "34,58,62,65,77": 416,
    "34,58,62,67": 417,
    "34,58,62,67,77": 418,
    "34,58,62,74": 419,
    "34,58,62,77": 420,
    "34,58,64,65,72,74": 421,
    "34,58,64,72": 422,
    "34,58,65": 423,
    "34,58,65,70": 424,
    "34,58,65,70,74": 425,
    "34,58,65,74": 426,
    "34,58,65,74,75": 427,
    "34,58,65,74,77": 428,
    "34,58,67,76": 429,
    "34,58,70": 430,
    "34,58,70,74": 431,
    "34,58,74": 432,
    "34,58,74,79": 433,
    "34,62": 434,
    "34,62,65": 435,
    "34,62,65,70": 436,
    "34,62,67,70": 437,
    "34,62,70": 438,
    "34,62,70,74": 439,
    "34,62,74": 440,
    "34,62,74,79": 441,
    "34,62,79": 442,
    "34,65,69": 443,
    "34,65,70,74": 444,
    "34,67,70": 445,
    "34,68,77": 446,
    "34,70,77": 447,
    "35": 448,
    "35,36,62,64,65,71": 449,
    "35,37,47,49,62,64": 450,
    "35,38,47,50,57,62,64,66": 451,
    "35,43": 452,
    "35,45": 453,
    "35,47": 454,
    "35,47,52,59,64,67,71": 455,
    "35,47,55,62,67,74": 456,
    "35,47,59": 457,
    "35,47,59,61,62,66,69,74,76,78": 458,
    "35,47,59,61,63,64": 459,
    "35,47,59,61,64,66,67,74,76": 460,
    "35,47,59,66,68,69,71,76,78": 461,
    "35,47,61,62,66,71,74": 462,
    "35,47,62,64,66,73,74": 463,
    "35,47,62,66": 464,
    "35,47,62,66,67,69,73,74": 465,
    "35,47,62,66,71": 466,
    "35,47,62,67,74": 467,
    "35,47,66,69,71,74,76,78": 468,
    "35,47,66,74,78": 469,
    "35,47,71": 470,
    "35,50,53": 471,
    "35,50,53,69": 472,
    "35,50,53,71": 473,
    "35,50,55,62": 474,
    "35,50,55,62,67,71,74": 475,
    "35,50,55,65": 476,
    "35,50,55,67": 477,
    "35,50,62,67": 478,
    "35,50,62,74": 479,
    "35,52,54,59,64": 480,
    "35,52,64,67": 481,
    "35,54,59": 482,
    "35,54,59,60": 483,
    "35,54,59,63": 484,
    "35,54,59,63,64": 485,
    "35,54,59,63,71": 486,
    "35,54,59,64": 487,
    "35,54,59,66": 488,
    "35,54,59,66,71": 489,
    "35,54,59,69": 490,
    "35,54,62": 491,
    "35,54,62,66": 492,
    "35,54,62,71": 493,
    "35,54,63,69": 494,
    "35,54,63,71": 495,
    "35,54,64,69": 496,
    "35,54,66,69": 497,
    "35,54,69": 498,
    "35,55,57,59,63,64,66": 499,
    "35,55,57,64,66": 500,
    "35,55,59,64": 501,
    "35,55,59,64,67": 502,
    "35,55,59,64,71": 503,
    "35,55,60,72": 504,
    "35,55,61,64": 505,
    "35,55,62": 506,
    "35,55,62,71": 507,
    "35,55,64,67": 508,
    "35,55,64,71": 509,
    "35,55,64,72": 510,
    "35,55,66,67,74": 511,
    "35,55,66,74": 512,
    "35,55,67,71": 513,
    "35,55,67,74": 514,
    "35,55,74": 515,
    "35,56,71,74": 516,
    "35,56,71,76": 517,
    "35,57,59,63,66": 518,
    "35,57,62,74": 519,
    "35,57,63,66": 520,
    "35,57,63,71": 521,
    "35,57,64,67": 522,
    "35,57,66,71": 523,
    "35,57,66,71,74": 524,
    "35,57,69,74": 525,
    "35,59,62": 526,
    "35,59,62,66": 527,
    "35,59,62,74": 528,
    "35,59,62,77": 529,
    "35,59,63,66": 530,
    "35,59,63,66,67": 531,
    "35,59,63,69": 532,
    "35,59,63,71": 533,
    "35,59,66,71,74": 534,
    "35,59,66,74": 535,
    "35,59,67": 536,
    "35,59,67,71": 537,
    "35,59,75": 538,
    "35,59,76": 539,
    "35,60,69": 540,
    "35,60,69,75": 541,
    "35,61,64,73": 542,
    "35,62,66,71": 543,
    "35,62,67": 544,
    "35,64,71": 545,
    "35,67,71": 546,
    "36": 547,
    "36,37,58,70": 548,
    "36,38": 549,
    "36,38,48,50,59,71": 550,
    "36,38,52,53,59,60,65,67": 551,
    "36,38,52,53,65,70,72": 552,
    "36,38,52,53,65,72": 553,
    "36,38,53,62,70": 554,
    "36,38,55,60,64,65": 555,
    "36,38,55,62,64,67": 556,
    "36,38,57,64,72": 557,
    "36,38,59,60,66,69": 558,
    "36,38,60,62,63,65,70,72": 559,
    "36,38,64,65,67,72": 560,
    "36,38,64,67,70": 561,
    "36,38,66,74,75": 562,
    "36,38,77,79": 563,
    "36,39": 564,
    "36,39,53,62,70": 565,
    "36,39,72,74": 566,
    "36,40,60,64,67,72": 567,
    "36,40,60,66,69": 568,
    "36,40,64": 569,
    "36,40,65,67,76,77,79,81,82,84,93,94": 570,
    "36,40,69,72": 571,
    "36,41": 572,
    "36,41,52,53,60,65,67": 573,
    "36,41,57,60,65": 574,
    "36,41,60,65,69,72,77": 575,
    "36,41,64,65": 576,
    "36,41,65": 577,
    "36,41,65,67": 578,
    "36,41,68,70": 579,
    "36,41,68,76": 580,
    "36,41,69,72": 581,
    "36,41,69,72,74,77,81,89": 582,
    "36,41,72,77": 583,
    "36,41,76,77": 584,
    "36,41,76,77,79,81": 585,
    "36,41,76,77,82,84": 586,
    "36,42,63,72": 587,
    "36,43": 588,
    "36,43,47,65,68,72": 589,
    "36,43,47,65,72": 590,
    "36,43,47,67,68,72": 591,
    "36,43,48,55,60,67,71,72,74,76,77,83,84": 592,
    "36,43,48,63,65,67,71,72": 593,
    "36,43,48,63,67,72": 594,
    "36,43,51,60": 595,
    "36,43,52": 596,
    "36,43,52,53": 597,
    "36,43,52,54": 598,
    "36,43,55,57,59,60,65,72,74": 599,
    "36,43,55,59,64,65,72,74": 600,
    "36,43,55,59,65,67": 601,
    "36,43,55,63,72": 602,
    "36,43,62,63,67,69,70": 603,
    "36,43,62,64,71,72": 604,
    "36,43,63,65,67,71,72,74": 605,
    "36,43,63,67,72": 606,
    "36,43,64,65,67,72,79,84": 607,
    "36,43,65,67,71": 608,
    "36,43,65,69,71,74": 609,
    "36,43,67": 610,
    "36,43,68,70,72": 611,
    "36,43,69,70": 612,
    "36,43,70,72": 613,
    "36,43,72,74": 614,
    "36,43,74,76,77": 615,
    "36,43,76,79": 616,
    "36,45": 617,
    "36,45,46,51": 618,
    "36,45,51": 619,
    "36,45,76,77,79": 620,
    "36,46,51": 621,
    "36,46,62,63,70,72": 622,
    "36,46,62,64": 623,
    "36,46,64,73": 624,
    "36,47,48,77,79,80": 625,
    "36,47,62,64": 626,
    "36,47,63,65": 627,
    "36,47,74,77": 628,
    "36,47,76,77": 629,
    "36,47,76,80": 630,
    "36,47,80": 631,
    "36,48": 632,
    "36,48,51,55,60,67,72,75": 633,
    "36,48,51,60": 634,
    "36,48,51,67,72,75": 635,
    "36,48,52,57,64,67,69": 636,
    "36,48,52,64,72": 637,
    "36,48,53,60,62,79,83": 638,
    "36,48,55,60,63,67,72": 639,
    "36,48,55,60,64": 640,
    "36,48,55,60,64,65": 641,
    "36,48,55,60,64,72": 642,
    "36,48,55,60,64,79,84": 643,
    "36,48,55,60,67,69,71,72,76,84,86": 644,
    "36,48,55,60,67,69,72,76,83,84": 645,
    "36,48,55,60,67,72,76": 646,
    "36,48,55,60,67,72,76,83,84": 647,
    "36,48,57,59,64,67,69,71": 648,
    "36,48,57,60": 649,
    "36,48,57,64,67,69": 650,
    "36,48,57,67,76": 651,
    "36,48,57,69,76": 652,
    "36,48,59,60,64,67,71,72": 653,
    "36,48,59,60,67,77": 654,
    "36,48,59,62,67,68": 655,
    "36,48,59,62,68": 656,
    "36,48,59,64,76": 657,
    "36,48,60": 658,
    "36,48,60,62,64,67,72": 659,
    "36,48,60,63,65,67,72": 660,
    "36,48,60,63,67,72": 661,
    "36,48,60,64,65,67,72,74,76,79": 662,
    "36,48,60,65,68": 663,
    "36,48,60,67,72,75": 664,
    "36,48,60,71,72": 665,
    "36,48,62,63,71,72": 666,
    "36,48,63,67,72": 667,
    "36,48,64,65": 668,
    "36,48,64,65,67": 669,
    "36,48,64,65,71,72": 670,
    "36,48,64,67": 671,
    "36,48,64,67,72": 672,
    "36,48,64,67,72,76": 673,
    "36,48,64,67,72,79,84": 674,
    "36,48,64,69,70": 675,
    "36,48,64,70": 676,
    "36,48,65,67": 677,
    "36,48,67": 678,
    "36,48,67,69": 679,
    "36,48,67,69,72": 680,
    "36,48,67,72,75": 681,
    "36,48,67,72,76,79,81,88": 682,
    "36,48,67,72,77,79,81,82,84,93,94": 683,
    "36,48,67,77": 684,
    "36,48,69,71,72": 685,
    "36,48,69,75,77": 686,
    "36,48,71,72": 687,
    "36,48,72": 688,
    "36,48,72,74": 689,
    "36,48,72,74,76,77,79": 690,
    "36,48,72,79": 691,
    "36,48,74,75": 692,
    "36,48,74,76": 693,
    "36,48,74,76,79,81": 694,
    "36,48,76": 695,
    "36,48,76,77": 696,
    "36,48,76,77,79": 697,
    "36,48,77,79": 698,
    "36,50,54,57,66,69,74": 699,
    "36,50,57,62,66": 700,
    "36,50,57,62,69": 701,
    "36,51,55,60": 702,
    "36,51,55,63,67,72": 703,
    "36,51,55,67,72,75": 704,
    "36,51,60": 705,
    "36,51,63,65,69": 706,
    "36,51,63,67,72": 707,
    "36,51,67": 708,
    "36,51,67,72,75": 709,
    "36,52,54,64,67,69": 710,
    "36,52,55": 711,
    "36,52,55,71": 712,
    "36,52,55,72": 713,
    "36,52,57,60,64": 714,
    "36,52,57,60,64,69": 715,
    "36,52,57,71": 716,
    "36,52,60,67": 717,
    "36,52,60,67,71": 718,
    "36,52,64,67": 719,
    "36,52,64,69": 720,
    "36,52,64,71": 721,
    "36,52,64,76": 722,
    "36,52,65,72": 723,
    "36,52,67,70,72": 724,
    "36,52,67,72": 725,
    "36,52,69,70,72": 726,
    "36,53,55,65": 727,
    "36,53,56,59,65,74": 728,
    "36,53,56,62,71": 729,
    "36,53,56,65,74": 730,
    "36,53,57,65": 731,
    "36,53,65": 732,
    "36,54": 733,
    "36,54,64,69": 734,
    "36,54,69": 735,
    "36,55": 736,
    "36,55,56,63,65": 737,
    "36,55,58,64": 738,
    "36,55,58,65": 739,
    "36,55,59,60,63,72": 740,
    "36,55,60,62": 741,
    "36,55,60,62,63,71,72": 742,
    "36,55,60,62,63,72": 743,
    "36,55,60,63,65,72": 744,
    "36,55,60,63,65,72,74": 745,
    "36,55,60,63,72": 746,
    "36,55,60,64": 747,
    "36,55,60,64,67,69,72": 748,
    "36,55,60,64,67,76,77": 749,
    "36,55,60,64,77,79": 750,
    "36,55,60,65,67": 751,
    "36,55,60,65,72": 752,
    "36,55,60,67": 753,
    "36,55,60,67,68": 754,
    "36,55,60,67,72,75": 755,
    "36,55,60,70,72": 756,
    "36,55,60,71": 757,
    "36,55,60,71,74,76,77": 758,
    "36,55,60,72": 759,
    "36,55,60,74,75": 760,
    "36,55,60,76": 761,
    "36,55,60,77,79": 762,
    "36,55,62,65,71,74": 763,
    "36,55,62,71": 764,
    "36,55,63": 765,
    "36,55,63,72": 766,
    "36,55,64": 767,
    "36,55,64,65,67": 768,
    "36,55,64,69,70": 769,
    "36,55,64,70": 770,
    "36,55,64,70,72": 771,
    "36,55,64,71": 772,
    "36,55,64,72": 773,
    "36,55,65": 774,
    "36,55,65,74": 775,
    "36,55,67,72,75": 776,
    "36,55,71,76": 777,
    "36,55,76": 778,
    "36,56,59,65,74": 779,
    "36,56,65,71": 780,
    "36,57,60": 781,
    "36,57,62,66": 782,
    "36,57,62,74": 783,
    "36,57,63,67,69": 784,
    "36,57,64": 785,
    "36,57,64,66": 786,
    "36,57,64,72": 787,
    "36,57,65,74": 788,
    "36,57,66,74": 789,
    "36,57,67,69,76": 790,
    "36,57,67,76": 791,
    "36,57,69,76": 792,
    "36,57,76": 793,
    "36,58": 794,
    "36,58,64": 795,
    "36,58,64,67": 796,
    "36,58,67,70": 797,
    "36,58,70,75": 798,
    "36,59": 799,
    "36,59,60": 800,
    "36,59,60,64": 801,
    "36,59,64": 802,
    "36,59,64,67": 803,
    "36,59,64,76": 804,
    "36,59,67,72,76": 805,
    "36,60": 806,
    "36,60,62,64,67": 807,
    "36,60,63,67,72": 808,
    "36,60,63,69,72": 809,
    "36,60,63,72": 810,
    "36,60,64": 811,
    "36,60,64,65": 812,
    "36,60,64,65,67": 813,
    "36,60,64,65,67,69": 814,
    "36,60,64,65,67,69,72": 815,
    "36,60,64,65,70": 816,
    "36,60,64,67": 817,
    "36,60,64,67,69": 818,
    "36,60,64,67,72": 819,
    "36,60,64,69": 820,
    "36,60,64,71,72,76": 821,
    "36,60,64,72": 822,
    "36,60,65,67": 823,
    "36,60,65,69": 824,
    "36,60,65,69,72": 825,
    "36,60,65,69,77": 826,
    "36,60,65,77": 827,
    "36,60,66,69": 828,
    "36,60,67": 829,
    "36,60,67,72": 830,
    "36,60,67,72,74": 831,
    "36,60,67,72,74,75": 832,
    "36,60,67,72,75": 833,
    "36,60,67,72,76": 834,
    "36,60,67,74": 835,
    "36,60,67,76": 836,
    "36,60,67,76,77": 837,
    "36,60,69": 838,
    "36,60,71,72": 839,
    "36,60,72,74": 840,
    "36,60,72,75": 841,
    "36,60,72,76": 842,
    "36,60,74,76": 843,
    "36,60,76": 844,
    "36,62": 845,
    "36,62,63": 846,
    "36,62,63,67,72": 847,
    "36,62,70": 848,
    "36,62,71": 849,
    "36,63": 850,
    "36,63,65": 851,
    "36,63,67": 852,
    "36,63,67,72": 853,
    "36,63,72": 854,
    "36,63,74,75": 855,
    "36,63,75": 856,
    "36,64": 857,
    "36,64,65": 858,
    "36,64,65,67": 859,
    "36,64,65,70": 860,
    "36,64,67": 861,
    "36,64,67,70": 862,
    "36,64,67,72": 863,
    "36,64,67,72,79,84": 864,
    "36,64,68": 865,
    "36,64,68,69": 866,
    "36,64,69,72": 867,
    "36,64,70": 868,
    "36,64,72": 869,
    "36,64,72,76": 870,
    "36,64,76": 871,
    "36,65": 872,
    "36,65,67": 873,
    "36,65,67,71,72,74,76": 874,
    "36,65,69": 875,
    "36,65,72": 876,
    "36,67": 877,
    "36,67,68,76,77": 878,
    "36,67,69,72,74,76,77,79,81,88,89": 879,
    "36,67,70,76": 880,
    "36,67,72": 881,
    "36,67,72,75": 882,
    "36,67,72,76": 883,
    "36,67,72,76,79": 884,
    "36,67,72,76,79,82": 885,
    "36,67,72,76,79,88": 886,
    "36,67,76": 887,
    "36,67,76,77": 888,
    "36,67,77,79,82,84,94": 889,
    "36,68": 890,
    "36,68,77": 891,
    "36,69": 892,
    "36,69,72": 893,
    "36,69,72,74,77,81,89": 894,
    "36,69,75": 895,
    "36,70": 896,
    "36,70,79": 897,
    "36,71": 898,
    "36,71,72": 899,
    "36,71,72,77": 900,
    "36,71,75": 901,
    "36,72": 902,
    "36,72,75": 903,
    "36,72,76": 904,
    "36,72,76,77": 905,
    "36,72,79": 906,
    "36,73,82": 907,
    "36,74": 908,
    "36,74,76": 909,
    "36,74,76,77,79": 910,
    "36,74,76,77,79,81": 911,
    "36,74,76,79,81": 912,
    "36,74,79": 913,
    "36,75": 914,
    "36,76": 915,
    "36,76,77": 916,
    "36,76,79,84": 917,
    "36,77": 918,
    "36,77,79": 919,
    "36,79": 920,
    "37": 921,
    "37,38,49,50": 922,
    "37,38,49,50,57,62,64": 923,
    "37,38,49,50,57,64,66,67": 924,
    "37,38,49,50,57,66,67": 925,
    "37,38,49,50,62,64,66,67": 926,
    "37,38,49,50,64,66": 927,
    "37,38,49,50,64,66,67,74": 928,
    "37,38,49,50,66,67,78,83": 929,
    "37,38,52,69,70,74,76,78,79": 930,
    "37,38,57,62,64,66": 931,
    "37,38,57,62,64,66,67": 932,
    "37,38,57,64,67": 933,
    "37,38,57,64,67,69": 934,
    "37,38,64,67,69": 935,
    "37,38,69,70,74,76,78,79": 936,
    "37,39,65,72": 937,
    "37,42,49,61,62,66,68,76,80,82": 938,
    "37,43,49,64,67,70": 939,
    "37,43,64,70": 940,
    "37,45": 941,
    "37,45,62,64,70,72": 942,
    "37,46,48,54,63": 943,
    "37,46,58,65,70": 944,
    "37,48,64,65": 945,
    "37,48,65,75": 946,
    "37,49": 947,
    "37,49,50,70,76": 948,
    "37,49,51,53,61": 949,
    "37,49,52,64,66,67,69,70,72": 950,
    "37,49,53,54,58": 951,
    "37,49,53,56,58": 952,
    "37,49,53,56,59": 953,
    "37,49,54,58,61": 954,
    "37,49,56": 955,
    "37,49,56,61,65": 956,
    "37,49,57,61,64,66,67,69,73,76": 957,
    "37,49,57,64": 958,
    "37,49,57,64,67": 959,
    "37,49,61,62,64,68,76,80": 960,
    "37,49,61,64,66,68,73,76,80": 961,
    "37,49,61,64,69,71,73": 962,
    "37,49,62,64,69,71,74,81": 963,
    "37,49,63,64,73": 964,
    "37,49,64,66,67,69": 965,
    "37,49,64,66,67,69,76": 966,
    "37,49,64,66,69": 967,
    "37,49,64,67": 968,
    "37,49,64,67,69": 969,
    "37,49,64,69": 970,
    "37,49,64,69,73,81": 971,
    "37,49,64,69,76": 972,
    "37,49,65,66,68": 973,
    "37,49,66,67": 974,
    "37,49,66,67,69": 975,
    "37,49,66,70": 976,
    "37,49,67,83": 977,
    "37,49,69,70": 978,
    "37,49,69,76": 979,
    "37,49,73,76": 980,
    "37,49,76": 981,
    "37,51,60,66": 982,
    "37,52,55,64,66,67,69,70,72": 983,
    "37,52,57,59,61,64,73,76": 984,
    "37,52,57,64": 985,
    "37,52,57,64,65,76": 986,
    "37,52,57,64,67,76": 987,
    "37,52,57,64,69,76": 988,
    "37,52,57,67": 989,
    "37,52,57,69": 990,
    "37,52,61,63": 991,
    "37,53,56,61": 992,
    "37,55": 993,
    "37,55,58,64,67,70,76,79": 994,
    "37,57": 995,
    "37,57,64": 996,
    "37,57,64,67": 997,
    "37,57,64,69": 998,
    "37,58,65,70": 999,
    "37,58,70,76,79": 1000,
    "37,59,64": 1001,
    "37,59,67,73": 1002,
    "37,60,61,66,68": 1003,
    "37,61,64,68,73": 1004,
    "37,61,64,70": 1005,
    "37,61,64,71": 1006,
    "37,61,65,68,73": 1007,
    "37,63,64": 1008,
    "37,64": 1009,
    "37,64,66,68": 1010,
    "37,64,67": 1011,
    "37,64,67,69": 1012,
    "37,64,67,70,74,76,79,91": 1013,
    "37,64,67,70,76,77,79,91": 1014,
    "37,64,67,70,76,79,82,91": 1015,
    "37,64,67,70,76,79,91": 1016,
    "37,64,76": 1017,
    "37,65": 1018,
    "37,65,68,70": 1019,
    "37,65,73": 1020,
    "37,66,67": 1021,
    "37,66,68": 1022,
    "37,67": 1023,
    "37,67,69": 1024,
    "37,68": 1025,
    "37,69": 1026,
    "37,70,79": 1027,
    "37,72,73,75,76": 1028,
    "37,73": 1029,
    "37,73,76": 1030,
    "37,76": 1031,
    "38": 1032,
    "38,39": 1033,
    "38,39,41": 1034,
    "38,39,51,53,58,65,67,70,72": 1035,
    "38,39,53,55,58,67,69": 1036,
    "38,39,53,58,60,65,70": 1037,
    "38,39,53,62,70": 1038,
    "38,39,55,63,72": 1039,
    "38,39,58,63,67,68": 1040,
    "38,39,67,69,71,72,78,79": 1041,
    "38,39,68,72,74,77,79": 1042,
    "38,39,69,70,72,74,78,79": 1043,
    "38,39,70,73,75,76,78,79": 1044,
    "38,39,71,72,80": 1045,
    "38,39,72,79": 1046,
    "38,39,77,79": 1047,
    "38,40": 1048,
    "38,40,42,72,81": 1049,
    "38,40,50,52,62,66,67,69,74,81,86": 1050,
    "38,40,50,52,64,66,78,79": 1051,
    "38,40,50,52,66,67": 1052,
    "38,40,50,52,66,67,73,74": 1053,
    "38,40,53,55,59,60,62,64": 1054,
    "38,40,53,55,60,65,70": 1055,
    "38,40,54,55": 1056,
    "38,40,55,59,60,64": 1057,
    "38,40,57": 1058,
    "38,40,57,64,65": 1059,
    "38,40,60,62,67,71": 1060,
    "38,40,61": 1061,
    "38,40,61,62,66,67": 1062,
    "38,40,62": 1063,
    "38,40,62,65,67,71": 1064,
    "38,40,62,65,70": 1065,
    "38,40,62,65,72": 1066,
    "38,40,62,67": 1067,
    "38,40,64,65,76,77,79,81,84,91,93": 1068,
    "38,40,64,66,67,69,71,72": 1069,
    "38,40,64,68,71": 1070,
    "38,40,65,67,69,74": 1071,
    "38,40,65,72": 1072,
    "38,40,65,72,74": 1073,
    "38,40,65,72,77,81,84,93": 1074,
    "38,40,66,67,72": 1075,
    "38,40,66,69": 1076,
    "38,40,66,74": 1077,
    "38,40,67": 1078,
    "38,40,67,69,74": 1079,
    "38,40,67,71,72,76,79,81": 1080,
    "38,40,67,71,72,79,81": 1081,
    "38,40,72,81": 1082,
    "38,40,74,78,81": 1083,
    "38,40,76,77": 1084,
    "38,40,78,81": 1085,
    "38,40,79": 1086,
    "38,40,81": 1087,
    "38,41": 1088,
    "38,41,59,61,67,69": 1089,
    "38,41,65,69": 1090,
    "38,41,65,69,74": 1091,
    "38,41,65,74": 1092,
    "38,42": 1093,
    "38,42,50,54,57,62,66,69,74": 1094,
    "38,42,50,54,62,66,69,74": 1095,
    "38,42,50,54,62,69,76,78": 1096,
    "38,42,50,66,69,72,74": 1097,
    "38,42,54,62": 1098,
    "38,42,62,63": 1099,
    "38,42,62,66": 1100,
    "38,42,62,66,69,72,74,78": 1101,
    "38,42,62,66,69,74": 1102,
    "38,42,62,67,69": 1103,
    "38,42,62,67,71": 1104,
    "38,42,66,69": 1105,
    "38,42,66,74": 1106,
    "38,42,67,69": 1107,
    "38,42,69,72": 1108,
    "38,42,69,79,81": 1109,
    "38,42,74": 1110,
    "38,42,74,81": 1111,
    "38,42,78,81": 1112,
    "38,42,79,81": 1113,
    "38,42,81": 1114,
    "38,42,81,84": 1115,
    "38,43": 1116,
    "38,43,46,62,67,70": 1117,
    "38,43,48,50,53,55,63,65,70": 1118,
    "38,43,49,50,57,64,67,69,70": 1119,
    "38,43,50,52,62,66,67,69,70": 1120,
    "38,43,50,60,64,66,67,69": 1121,
    "38,43,50,62,66,71": 1122,
    "38,43,55,57,69,71,77,79,81": 1123,
    "38,43,57,58,66,67": 1124,
    "38,43,57,59,66,67,71,72": 1125,
    "38,43,57,59,67": 1126,
    "38,43,58,60": 1127,
    "38,43,59,60": 1128,
    "38,43,59,66,67": 1129,
    "38,43,59,67,69,71,74,81,84": 1130,
    "38,43,60,62,66,67,69": 1131,
    "38,43,60,66,67": 1132,
    "38,43,62,67,69,70": 1133,
    "38,43,62,67,71,79": 1134,
    "38,43,62,71,72": 1135,
    "38,43,63,65": 1136,
    "38,43,65,67,81,82,86": 1137,
    "38,43,66,67": 1138,
    "38,43,66,67,69,70": 1139,
    "38,43,66,67,69,71": 1140,
    "38,43,66,71,74": 1141,
    "38,43,67": 1142,
    "38,43,67,70": 1143,
    "38,43,69,70": 1144,
    "38,43,69,71,74": 1145,
    "38,43,70": 1146,
    "38,43,70,72": 1147,
    "38,43,71,72,79": 1148,
    "38,43,71,72,81": 1149,
    "38,43,71,81": 1150,
    "38,43,74": 1151,
    "38,43,79": 1152,
    "38,43,81": 1153,
    "38,43,83,84": 1154,
    "38,45": 1155,
    "38,45,49,50,69,76,78,79": 1156,
    "38,45,50,52,67,73": 1157,
    "38,45,50,54,60": 1158,
    "38,45,50,57,61,66,74,76": 1159,
    "38,45,50,57,64,66,73,74": 1160,
    "38,45,50,76,78": 1161,
    "38,45,52": 1162,
    "38,45,52,54": 1163,
    "38,45,54": 1164,
    "38,45,54,55": 1165,
    "38,45,54,59,60": 1166,
    "38,45,54,60": 1167,
    "38,45,57,67,69,76,77": 1168,
    "38,45,60,62,69": 1169,
    "38,45,61,62": 1170,
    "38,45,62": 1171,
    "38,45,62,64,67,73,74": 1172,
    "38,45,62,64,71,73": 1173,
    "38,45,62,66,69,74": 1174,
    "38,45,62,74": 1175,
    "38,45,64,65": 1176,
    "38,45,64,65,73,74": 1177,
    "38,45,64,66,73,74": 1178,
    "38,45,66,67": 1179,
    "38,45,66,67,73,74": 1180,
    "38,45,66,69": 1181,
    "38,45,66,69,73,74": 1182,
    "38,45,66,72,74": 1183,
    "38,45,66,74": 1184,
    "38,45,66,76": 1185,
    "38,45,73,74": 1186,
    "38,45,73,74,76": 1187,
    "38,45,73,76": 1188,
    "38,45,77,79": 1189,
    "38,45,78,81": 1190,
    "38,46,50,62,63,67,69,70,72": 1191,
    "38,46,50,62,67,70": 1192,
    "38,46,55,62": 1193,
    "38,46,64": 1194,
    "38,46,66,67,69,70": 1195,
    "38,46,68": 1196,
    "38,46,70,74": 1197,
    "38,47": 1198,
    "38,47,62,64": 1199,
    "38,48": 1200,
    "38,48,50,57,66,69": 1201,
    "38,48,54": 1202,
    "38,48,64,69": 1203,
    "38,48,65,67": 1204,
    "38,49": 1205,
    "38,49,50,52,55,57,58,61,62,64": 1206,
    "38,49,50,57,59,61": 1207,
    "38,49,50,62,64,66,69,81": 1208,
    "38,49,52": 1209,
    "38,49,52,55": 1210,
    "38,49,52,55,58": 1211,
    "38,49,52,55,58,61": 1212,
    "38,49,52,55,58,61,64": 1213,
    "38,49,52,55,58,61,64,67,70": 1214,
    "38,49,52,58,61,64": 1215,
    "38,49,52,64,67,70": 1216,
    "38,49,64,67": 1217,
    "38,49,66,67": 1218,
    "38,49,67,69": 1219,
    "38,49,67,70": 1220,
    "38,49,67,76": 1221,
    "38,49,69,76,79": 1222,
    "38,49,76,79": 1223,
    "38,50": 1224,
    "38,50,51,53,58,67,68,70": 1225,
    "38,50,52,53,57,62": 1226,
    "38,50,52,54": 1227,
    "38,50,52,54,55,57,62": 1228,
    "38,50,52,55,57,62": 1229,
    "38,50,52,57,62": 1230,
    "38,50,52,62,66,67,69,74,81,86": 1231,
    "38,50,53,57,62": 1232,
    "38,50,53,57,62,65": 1233,
    "38,50,53,65,68,70": 1234,
    "38,50,54,55,57,62": 1235,
    "38,50,54,57,62": 1236,
    "38,50,54,57,62,66,69,74": 1237,
    "38,50,54,66,67": 1238,
    "38,50,54,69,72,74": 1239,
    "38,50,54,72": 1240,
    "38,50,54,72,74": 1241,
    "38,50,55,57,62": 1242,
    "38,50,55,62,63,67,69,70,72": 1243,
    "38,50,55,69,70": 1244,
    "38,50,57,60,62,64,66,67": 1245,
    "38,50,57,60,62,66,69,71": 1246,
    "38,50,57,60,66,69": 1247,
    "38,50,57,62,64,66": 1248,
    "38,50,57,62,64,66,69": 1249,
    "38,50,57,62,64,69": 1250,
    "38,50,57,62,65": 1251,
    "38,50,57,62,66": 1252,
    "38,50,57,62,66,69": 1253,
    "38,50,57,62,66,69,74": 1254,
    "38,50,57,62,69,73,74,76,78,79": 1255,
    "38,50,57,62,69,74,76,78,79,81": 1256,
    "38,50,57,62,74,78,81": 1257,
    "38,50,57,62,77": 1258,
    "38,50,57,64,65,73,74": 1259,
    "38,50,57,64,66": 1260,
    "38,50,57,64,69": 1261,
    "38,50,57,66": 1262,
    "38,50,57,66,69": 1263,
    "38,50,57,66,74": 1264,
    "38,50,57,67,69": 1265,
    "38,50,57,69": 1266,
    "38,50,57,74,78,79": 1267,
    "38,50,57,76,78": 1268,
    "38,50,58,60,64,66,67,69": 1269,
    "38,50,58,60,67,69": 1270,
    "38,50,58,60,77": 1271,
    "38,50,58,64,66,69": 1272,
    "38,50,58,66,67,69": 1273,
    "38,50,58,67,70": 1274,
    "38,50,59,60,62,66,67,69": 1275,
    "38,50,59,60,62,67,69,74,78": 1276,
    "38,50,59,60,67,69": 1277,
    "38,50,59,62,66,71": 1278,
    "38,50,59,62,66,71,72": 1279,
    "38,50,59,71": 1280,
    "38,50,60": 1281,
    "38,50,60,62,64,66,67,69": 1282,
    "38,50,60,62,66,67,69,70": 1283,
    "38,50,60,63,66,67,69": 1284,
    "38,50,61,62,64,65": 1285,
    "38,50,61,62,64,66,69,74,76,78,81": 1286,
    "38,50,61,62,64,66,69,74,76,81": 1287,
    "38,50,61,64": 1288,
    "38,50,62": 1289,
    "38,50,62,63,66,67,69": 1290,
    "38,50,62,64": 1291,
    "38,50,62,64,65": 1292,
    "38,50,62,64,66": 1293,
    "38,50,62,64,66,67": 1294,
    "38,50,62,65": 1295,
    "38,50,62,65,69": 1296,
    "38,50,62,66": 1297,
    "38,50,62,66,67": 1298,
    "38,50,62,66,67,69,74": 1299,
    "38,50,62,66,67,69,74,76,79,81": 1300,
    "38,50,62,66,69": 1301,
    "38,50,62,66,69,72,74,78,79": 1302,
    "38,50,62,66,69,74": 1303,
    "38,50,62,66,69,74,76,79,81": 1304,
    "38,50,62,66,69,78,81,86": 1305,
    "38,50,62,66,71,74": 1306,
    "38,50,62,66,74": 1307,
    "38,50,62,67,69,74,76,78,79": 1308,
    "38,50,62,69,72,74,78": 1309,
    "38,50,62,69,74,76,78": 1310,
    "38,50,62,69,74,76,78,84": 1311,
    "38,50,62,69,74,78": 1312,
    "38,50,62,69,74,78,84": 1313,
    "38,50,62,69,78,81,86": 1314,
    "38,50,62,72,74,76": 1315,
    "38,50,62,72,74,77": 1316,
    "38,50,62,74": 1317,
    "38,50,62,74,78,81": 1318,
    "38,50,62,78,79": 1319,
    "38,50,64,65,79,81,86": 1320,
    "38,50,64,66": 1321,
    "38,50,64,66,69": 1322,
    "38,50,64,66,73,74": 1323,
    "38,50,64,67,73": 1324,
    "38,50,65": 1325,
    "38,50,65,67,69,74": 1326,
    "38,50,65,68": 1327,
    "38,50,65,69,74": 1328,
    "38,50,65,73,74": 1329,
    "38,50,65,74": 1330,
    "38,50,66,67": 1331,
    "38,50,66,67,69": 1332,
    "38,50,66,67,71,72": 1333,
    "38,50,66,67,73,74,76": 1334,
    "38,50,66,69": 1335,
    "38,50,66,69,74": 1336,
    "38,50,66,69,74,78,81": 1337,
    "38,50,66,69,74,81": 1338,
    "38,50,66,71,72": 1339,
    "38,50,66,71,74,78": 1340,
    "38,50,66,72": 1341,
    "38,50,66,74": 1342,
    "38,50,66,78": 1343,
    "38,50,67,69,74,76,78": 1344,
    "38,50,67,71": 1345,
    "38,50,67,73,74,76": 1346,
    "38,50,69": 1347,
    "38,50,69,72": 1348,
    "38,50,69,72,74,76,78": 1349,
    "38,50,69,74,76,78": 1350,
    "38,50,69,74,78": 1351,
    "38,50,69,74,78,81": 1352,
    "38,50,69,77,79": 1353,
    "38,50,69,78": 1354,
    "38,50,69,78,81": 1355,
    "38,50,70,72": 1356,
    "38,50,71": 1357,
    "38,50,71,72": 1358,
    "38,50,71,72,78,79": 1359,
    "38,50,71,77,79": 1360,
    "38,50,72,74": 1361,
    "38,50,72,74,78": 1362,
    "38,50,73,74,76,81": 1363,
    "38,50,74,76,77,79": 1364,
    "38,50,74,77": 1365,
    "38,50,74,78,83,84": 1366,
    "38,50,74,81,83": 1367,
    "38,50,76,78": 1368,
    "38,50,78": 1369,
    "38,50,78,79": 1370,
    "38,50,79": 1371,
    "38,50,79,81": 1372,
    "38,50,81": 1373,
    "38,51,53,58,65,67,70": 1374,
    "38,52,54,61,62": 1375,
    "38,52,54,62,66,69": 1376,
    "38,52,55,62": 1377,
    "38,52,55,62,64,67,69,70,72": 1378,
    "38,52,57,62": 1379,
    "38,52,59,68": 1380,
    "38,52,60,65": 1381,
    "38,52,61,66": 1382,
    "38,52,65,69,74": 1383,
    "38,53,57,65,69,74": 1384,
    "38,53,58,65,70": 1385,
    "38,53,58,65,74": 1386,
    "38,53,58,69,70": 1387,
    "38,53,58,70,74": 1388,
    "38,53,59,64": 1389,
    "38,53,59,64,65": 1390,
    "38,53,59,65": 1391,
    "38,53,62": 1392,
    "38,53,65,67,70": 1393,
    "38,53,65,69": 1394,
    "38,53,65,69,74": 1395,
    "38,53,65,70": 1396,
    "38,53,65,72": 1397,
    "38,54,55,57,58,62": 1398,
    "38,54,55,62,66,69": 1399,
    "38,54,55,66,69,71": 1400,
    "38,54,57,61": 1401,
    "38,54,57,62": 1402,
    "38,54,57,66": 1403,
    "38,54,57,67": 1404,
    "38,54,57,69": 1405,
    "38,54,57,71": 1406,
    "38,54,57,72": 1407,
    "38,54,60,69": 1408,
    "38,54,62": 1409,
    "38,54,62,67": 1410,
    "38,54,62,69": 1411,
    "38,54,62,74": 1412,
    "38,54,66,69": 1413,
    "38,54,69,71,78,81": 1414,
    "38,54,69,72": 1415,
    "38,54,69,74": 1416,
    "38,54,70,74": 1417,
    "38,54,72,74": 1418,
    "38,55": 1419,
    "38,55,57,62": 1420,
    "38,55,57,62,66,69": 1421,
    "38,55,57,64,66,71,72": 1422,
    "38,55,57,67": 1423,
    "38,55,58,62": 1424,
    "38,55,58,62,63,67,69,70,72": 1425,
    "38,55,58,62,64,67,69,70,72": 1426,
    "38,55,58,62,67": 1427,
    "38,55,58,62,67,70,74,79": 1428,
    "38,55,58,62,70": 1429,
    "38,55,58,67": 1430,
    "38,55,59,62": 1431,
    "38,55,59,66": 1432,
    "38,55,59,67": 1433,
    "38,55,59,74": 1434,
    "38,55,60,62,64": 1435,
    "38,55,60,69": 1436,
    "38,55,62": 1437,
    "38,55,62,67,69": 1438,
    "38,55,62,69": 1439,
    "38,55,62,71": 1440,
    "38,55,64,73": 1441,
    "38,55,65,71": 1442,
    "38,55,66,71": 1443,
    "38,55,67,72": 1444,
    "38,55,67,74": 1445,
    "38,55,69": 1446,
    "38,55,69,74": 1447,
    "38,55,71": 1448,
    "38,57": 1449,
    "38,57,58,65": 1450,
    "38,57,58,66,67": 1451,
    "38,57,59": 1452,
    "38,57,59,62,66": 1453,
    "38,57,59,66": 1454,
    "38,57,59,66,67": 1455,
    "38,57,59,69,76,77,81,83": 1456,
    "38,57,60": 1457,
    "38,57,60,62,65": 1458,
    "38,57,60,62,66": 1459,
    "38,57,60,62,66,67": 1460,
    "38,57,60,62,66,67,69,70": 1461,
    "38,57,60,62,66,69,78": 1462,
    "38,57,60,62,67": 1463,
    "38,57,60,62,69": 1464,
    "38,57,60,65": 1465,
    "38,57,60,66": 1466,
    "38,57,60,66,67": 1467,
    "38,57,60,66,72": 1468,
    "38,57,61,62": 1469,
    "38,57,62": 1470,
    "38,57,62,64": 1471,
    "38,57,62,64,65": 1472,
    "38,57,62,65": 1473,
    "38,57,62,65,69": 1474,
    "38,57,62,65,74": 1475,
    "38,57,62,66": 1476,
    "38,57,62,66,67": 1477,
    "38,57,62,67": 1478,
    "38,57,62,67,69": 1479,
    "38,57,62,69": 1480,
    "38,57,62,69,72,77,84": 1481,
    "38,57,62,69,74,76,77,83,84": 1482,
    "38,57,62,69,74,78,86": 1483,
    "38,57,62,72": 1484,
    "38,57,64,67,73,76": 1485,
    "38,57,64,72": 1486,
    "38,57,64,73": 1487,
    "38,57,65": 1488,
    "38,57,65,69": 1489,
    "38,57,65,69,74": 1490,
    "38,57,65,71": 1491,
    "38,57,65,74": 1492,
    "38,57,66": 1493,
    "38,57,66,67": 1494,
    "38,57,66,67,73,74": 1495,
    "38,57,66,69": 1496,
    "38,57,66,69,70": 1497,
    "38,57,66,70,72": 1498,
    "38,57,66,72": 1499,
    "38,57,66,72,74": 1500,
    "38,57,66,74": 1501,
    "38,57,67": 1502,
    "38,57,67,69": 1503,
    "38,57,67,72": 1504,
    "38,57,67,73": 1505,
    "38,57,67,74": 1506,
    "38,57,67,74,76": 1507,
    "38,57,67,76": 1508,
    "38,57,69": 1509,
    "38,57,69,70": 1510,
    "38,57,69,72": 1511,
    "38,57,69,73": 1512,
    "38,57,72": 1513,
    "38,57,74,76,77,79": 1514,
    "38,58": 1515,
    "38,58,60,65,69,70": 1516,
    "38,58,61,64,67,70,73,76,79": 1517,
    "38,58,62": 1518,
    "38,58,62,67": 1519,
    "38,58,62,74": 1520,
    "38,58,63,67": 1521,
    "38,58,65": 1522,
    "38,58,65,68": 1523,
    "38,58,65,69,72": 1524,
    "38,58,65,70,72": 1525,
    "38,58,65,72": 1526,
    "38,58,66,73": 1527,
    "38,58,66,74": 1528,
    "38,58,67,73": 1529,
    "38,58,67,76": 1530,
    "38,58,70,72": 1531,
    "38,58,70,74,79": 1532,
    "38,59": 1533,
    "38,59,60,64,65,69": 1534,
    "38,59,62": 1535,
    "38,59,62,66,67,69,71,72,74": 1536,
    "38,59,62,67": 1537,
    "38,59,62,67,71,74": 1538,
    "38,59,64": 1539,
    "38,59,64,66,67,69": 1540,
    "38,59,64,67": 1541,
    "38,59,65,68": 1542,
    "38,59,65,74": 1543,
    "38,59,66": 1544,
    "38,59,66,67": 1545,
    "38,59,66,69": 1546,
    "38,59,66,69,71": 1547,
    "38,59,66,71": 1548,
    "38,59,66,74": 1549,
    "38,59,67": 1550,
    "38,59,67,74": 1551,
    "38,59,67,76": 1552,
    "38,59,69,74": 1553,
    "38,60": 1554,
    "38,60,62": 1555,
    "38,60,62,64,65,69,70": 1556,
    "38,60,62,65,69": 1557,
    "38,60,62,66": 1558,
    "38,60,62,66,69": 1559,
    "38,60,62,66,74": 1560,
    "38,60,62,69": 1561,
    "38,60,62,77": 1562,
    "38,60,63": 1563,
    "38,60,63,66,69,72,78": 1564,
    "38,60,63,72": 1565,
    "38,60,65,69": 1566,
    "38,60,66": 1567,
    "38,60,66,67": 1568,
    "38,60,66,67,69": 1569,
    "38,60,66,69": 1570,
    "38,60,66,69,70": 1571,
    "38,60,66,75": 1572,
    "38,60,67,69": 1573,
    "38,60,67,72": 1574,
    "38,60,68": 1575,
    "38,60,69": 1576,
    "38,60,69,74,78": 1577,
    "38,60,77": 1578,
    "38,61": 1579,
    "38,61,62": 1580,
    "38,61,62,66,69,74,78": 1581,
    "38,61,62,66,74": 1582,
    "38,61,62,69,71": 1583,
    "38,61,62,74": 1584,
    "38,61,64": 1585,
    "38,61,66,74": 1586,
    "38,61,67": 1587,
    "38,61,67,70": 1588,
    "38,61,69,74,76": 1589,
    "38,61,69,76": 1590,
    "38,61,73,76,79": 1591,
    "38,61,76": 1592,
    "38,62": 1593,
    "38,62,63": 1594,
    "38,62,63,65": 1595,
    "38,62,64": 1596,
    "38,62,64,65": 1597,
    "38,62,64,65,71": 1598,
    "38,62,64,66,67,69,73,74": 1599,
    "38,62,64,66,69": 1600,
    "38,62,64,66,73,74,81": 1601,
    "38,62,64,66,73,76,78": 1602,
    "38,62,64,66,74": 1603,
    "38,62,64,69": 1604,
    "38,62,64,69,74,77,81": 1605,
    "38,62,64,69,78": 1606,
    "38,62,65": 1607,
    "38,62,65,67": 1608,
    "38,62,65,68,71": 1609,
    "38,62,65,69": 1610,
    "38,62,65,69,72": 1611,
    "38,62,65,69,72,77,81,93": 1612,
    "38,62,65,69,72,77,81,95": 1613,
    "38,62,65,69,74,77": 1614,
    "38,62,65,69,74,77,81": 1615,
    "38,62,65,69,81,84,86": 1616,
    "38,62,65,70": 1617,
    "38,62,65,70,72": 1618,
    "38,62,65,70,74": 1619,
    "38,62,65,70,77": 1620,
    "38,62,65,71": 1621,
    "38,62,65,72": 1622,
    "38,62,65,74,76,82,92": 1623,
    "38,62,65,74,76,82,94": 1624,
    "38,62,65,74,77": 1625,
    "38,62,65,77": 1626,
    "38,62,66": 1627,
    "38,62,66,67": 1628,
    "38,62,66,67,69": 1629,
    "38,62,66,67,69,71,72": 1630,
    "38,62,66,67,69,71,72,74": 1631,
    "38,62,66,67,69,71,72,74,78,79,81": 1632,
    "38,62,66,67,69,71,74": 1633,
    "38,62,66,67,69,71,74,78,79,83": 1634,
    "38,62,66,67,74": 1635,
    "38,62,66,69": 1636,
    "38,62,66,69,71,74,78,81,84": 1637,
    "38,62,66,69,72": 1638,
    "38,62,66,69,72,74": 1639,
    "38,62,66,69,72,74,76": 1640,
    "38,62,66,69,72,74,78,81": 1641,
    "38,62,66,69,72,74,79": 1642,
    "38,62,66,69,74": 1643,
    "38,62,66,69,74,78,81": 1644,
    "38,62,66,69,74,78,81,84": 1645,
    "38,62,66,69,74,81": 1646,
    "38,62,66,69,74,81,84": 1647,
    "38,62,66,69,76,78": 1648,
    "38,62,66,72": 1649,
    "38,62,66,72,74": 1650,
    "38,62,66,72,74,76": 1651,
    "38,62,66,74": 1652,
    "38,62,66,74,78": 1653,
    "38,62,66,74,78,81": 1654,
    "38,62,67,69": 1655,
    "38,62,67,69,71,72,74,78": 1656,
    "38,62,67,69,72,74,79": 1657,
    "38,62,67,69,72,79": 1658,
    "38,62,67,69,74": 1659,
    "38,62,67,69,74,78": 1660,
    "38,62,67,71": 1661,
    "38,62,67,71,74": 1662,
    "38,62,67,71,74,79,83": 1663,
    "38,62,67,71,79": 1664,
    "38,62,67,72": 1665,
    "38,62,69": 1666,
    "38,62,69,71,72,74,76": 1667,
    "38,62,69,71,72,74,78": 1668,
    "38,62,69,71,73,76,78": 1669,
    "38,62,69,71,76,78": 1670,
    "38,62,69,72": 1671,
    "38,62,69,72,74,78": 1672,
    "38,62,69,74": 1673,
    "38,62,69,74,78": 1674,
    "38,62,69,76,77": 1675,
    "38,62,69,77": 1676,
    "38,62,69,77,81,86": 1677,
    "38,62,69,78": 1678,
    "38,62,70": 1679,
    "38,62,71": 1680,
    "38,62,71,77,79": 1681,
    "38,62,72": 1682,
    "38,62,74": 1683,
    "38,62,74,77": 1684,
    "38,62,74,78,81": 1685,
    "38,62,76": 1686,
    "38,62,77": 1687,
    "38,62,78": 1688,
    "38,62,78,79": 1689,
    "38,62,79": 1690,
    "38,62,81,84,86": 1691,
    "38,63,65": 1692,
    "38,63,66": 1693,
    "38,63,68": 1694,
    "38,63,69,72,78": 1695,
    "38,63,72": 1696,
    "38,64": 1697,
    "38,64,65": 1698,
    "38,64,65,69": 1699,
    "38,64,65,69,72,74": 1700,
    "38,64,65,79,81": 1701,
    "38,64,66": 1702,
    "38,64,66,67": 1703,
    "38,64,66,67,69": 1704,
    "38,64,66,67,69,71,73,74,76": 1705,
    "38,64,66,69,74,78,81": 1706,
    "38,64,66,72": 1707,
    "38,64,66,74": 1708,
    "38,64,67,70": 1709,
    "38,64,67,74": 1710,
    "38,64,69,73": 1711,
    "38,64,69,77,79": 1712,
    "38,64,69,79": 1713,
    "38,65": 1714,
    "38,65,67": 1715,
    "38,65,67,74,76": 1716,
    "38,65,68": 1717,
    "38,65,69": 1718,
    "38,65,69,71": 1719,
    "38,65,69,72": 1720,
    "38,65,69,74": 1721,
    "38,65,69,74,77,86": 1722,
    "38,65,69,79,81": 1723,
    "38,65,69,81": 1724,
    "38,65,70,80,82": 1725,
    "38,65,71": 1726,
    "38,65,71,72": 1727,
    "38,65,72": 1728,
    "38,65,72,74": 1729,
    "38,65,73": 1730,
    "38,65,74": 1731,
    "38,65,74,77": 1732,
    "38,65,75": 1733,
    "38,65,77": 1734,
    "38,65,77,81,84,93": 1735,
    "38,66": 1736,
    "38,66,67": 1737,
    "38,66,67,69": 1738,
    "38,66,67,69,71": 1739,
    "38,66,67,69,74": 1740,
    "38,66,67,74": 1741,
    "38,66,69": 1742,
    "38,66,69,71": 1743,
    "38,66,69,72": 1744,
    "38,66,69,72,74": 1745,
    "38,66,69,74": 1746,
    "38,66,71": 1747,
    "38,66,71,74": 1748,
    "38,66,72,74": 1749,
    "38,66,74": 1750,
    "38,66,76": 1751,
    "38,66,78,81": 1752,
    "38,67": 1753,
    "38,67,69": 1754,
    "38,67,69,71": 1755,
    "38,67,69,71,72": 1756,
    "38,67,69,76,77": 1757,
    "38,67,70": 1758,
    "38,67,71": 1759,
    "38,67,71,72": 1760,
    "38,67,71,74": 1761,
    "38,67,73": 1762,
    "38,67,74": 1763,
    "38,67,74,76": 1764,
    "38,67,75": 1765,
    "38,67,76": 1766,
    "38,67,76,78": 1767,
    "38,68": 1768,
    "38,68,71": 1769,
    "38,68,74,77": 1770,
    "38,68,77": 1771,
    "38,69": 1772,
    "38,69,70": 1773,
    "38,69,70,77,79": 1774,
    "38,69,71": 1775,
    "38,69,71,72,74": 1776,
    "38,69,72": 1777,
    "38,69,72,74,77,81": 1778,
    "38,69,72,74,77,81,84": 1779,
    "38,69,72,78": 1780,
    "38,69,73": 1781,
    "38,69,74": 1782,
    "38,69,74,77": 1783,
    "38,69,74,78,81": 1784,
    "38,69,76": 1785,
    "38,69,77": 1786,
    "38,69,78": 1787,
    "38,69,78,81": 1788,
    "38,69,79": 1789,
    "38,70": 1790,
    "38,70,72": 1791,
    "38,70,72,74": 1792,
    "38,70,74": 1793,
    "38,70,77": 1794,
    "38,70,78,86": 1795,
    "38,70,79": 1796,
    "38,71": 1797,
    "38,71,72": 1798,
    "38,71,79,80": 1799,
    "38,72": 1800,
    "38,72,74": 1801,
    "38,72,74,76": 1802,
    "38,72,77": 1803,
    "38,72,78": 1804,
    "38,72,78,79": 1805,
    "38,72,79,81": 1806,
    "38,72,81": 1807,
    "38,73": 1808,
    "38,73,74,78,81": 1809,
    "38,73,74,79": 1810,
    "38,73,74,81": 1811,
    "38,73,76": 1812,
    "38,74": 1813,
    "38,74,76": 1814,
    "38,74,76,77,79": 1815,
    "38,74,77": 1816,
    "38,74,77,79": 1817,
    "38,74,77,81": 1818,
    "38,74,78": 1819,
    "38,74,81": 1820,
    "38,74,81,83": 1821,
    "38,74,82": 1822,
    "38,74,84": 1823,
    "38,75": 1824,
    "38,76": 1825,
    "38,76,77": 1826,
    "38,76,78": 1827,
    "38,76,79": 1828,
    "38,77": 1829,
    "38,78": 1830,
    "38,78,79": 1831,
    "38,78,83": 1832,
    "38,79": 1833,
    "38,79,81": 1834,
    "38,81": 1835,
    "38,81,83": 1836,
    "39": 1837,
    "39,40": 1838,
    "39,40,59,66,69": 1839,
    "39,40,66,68": 1840,
    "39,41": 1841,
    "39,41,43,79": 1842,
    "39,41,46,53,55,57,67,72": 1843,
    "39,41,55,56,60": 1844,
    "39,41,55,60,62,67,72": 1845,
    "39,41,55,67,69,72": 1846,
    "39,41,56,62,72": 1847,
    "39,41,57,65,72": 1848,
    "39,41,60,62": 1849,
    "39,41,60,62,65,67,69,70": 1850,
    "39,41,61,67": 1851,
    "39,41,62,67": 1852,
    "39,41,63,67,72": 1853,
    "39,41,67,69": 1854,
    "39,41,68,74,77": 1855,
    "39,41,69,70,72": 1856,
    "39,41,74,75": 1857,
    "39,41,79,80": 1858,
    "39,42,59,66,69": 1859,
    "39,42,66,70": 1860,
    "39,43": 1861,
    "39,43,58,63,67": 1862,
    "39,43,60": 1863,
    "39,43,60,62,67,70": 1864,
    "39,43,63,67": 1865,
    "39,43,67": 1866,
    "39,43,67,70,74,75": 1867,
    "39,43,69,72": 1868,
    "39,43,69,75": 1869,
    "39,43,70,72": 1870,
    "39,44": 1871,
    "39,44,75,77": 1872,
    "39,45": 1873,
    "39,46": 1874,
    "39,46,48": 1875,
    "39,46,48,55,57,67,72": 1876,
    "39,46,48,63,66,68": 1877,
    "39,46,51": 1878,
    "39,46,51,55,58,63": 1879,
    "39,46,53,56": 1880,
    "39,46,55,63": 1881,
    "39,46,56": 1882,
