{
  "token_to_id": {
    "29,41": 1,
    "30,42,54": 2,
    "30,42,62,69,72": 3,
    "31,43,55": 4,
    "31,43,59,65": 5,
    "31,43,62,67,70": 6,
    "32,44,56": 7,
    "32,44,60,67": 8,
    "33,45,57": 9,
    "33,45,60,63,65": 10,
    "33,45,60,63,66": 11,
    "33,45,61,64,69": 12,
    "33,61,64,69": 13,
    "34": 14,
    "34,46,53,58,62,65": 15,
    "34,46,56,65": 16,
    "34,46,58": 17,
    "34,46,60,63,66": 18,
    "34,46,62,67": 19,
    "34,46,62,68": 20,
    "34,46,74,80": 21,
    "34,74,77,82": 22,
    "35,47,59": 23,
    "35,47,59,63,66": 24,
    "35,47,59,64,67": 25,
    "35,47,59,66,69": 26,
    "35,47,62,65,67": 27,
    "35,47,66,69": 28,
    "36,40,43,48,60,64,67,72": 29,
    "36,40,76": 30,
    "36,43,48,63,67": 31,
    "36,48": 32,
    "36,48,55,60,64": 33,
    "36,48,60": 34,
    "36,48,60,63,67": 35,
    "36,48,60,65,68": 36,
    "36,48,60,76": 37,
    "36,48,63,67": 38,
    "36,48,64,70": 39,
    "36,48,64,72": 40,
    "36,48,72": 41,
    "36,48,72,82": 42,
    "36,55,71,74,76": 43,
    "36,64,67,72": 44,
    "36,67,76": 45,
    "37,38,49,50,61,62": 46,
    "37,49,61": 47,
    "37,49,65,72": 48,
    "37,49,69,76,79": 49,
    "38": 50,
    "38,42,45,57,68,80": 51,
    "38,42,57,68,80": 52,
    "38,45,50,66,69,74": 53,
    "38,50,53,62": 54,
    "38,50,57": 55,
    "38,50,57,62,66": 56,
    "38,50,57,64,67": 57,
    "38,50,57,66,69": 58,
    "38,50,57,71,74,77,80": 59,
    "38,50,58,65,68": 60,
    "38,50,60,65": 61,
    "38,50,62": 62,
    "38,50,62,66": 63,
    "38,50,64,67": 64,
    "38,50,66,69": 65,
    "38,50,69,74,77": 66,
    "38,50,71,74,77,80": 67,
    "38,50,71,80": 68,
    "38,50,77": 69,
    "38,50,82,86": 70,
    "38,57,62,66": 71,
    "38,62": 72,
    "38,66,69,74": 73,
    "38,66,74": 74,
    "39,51": 75,
    "39,51,55": 76,
    "39,51,55,63": 77,
    "39,51,58,67": 78,
    "39,51,62,65,68": 79,
    "39,51,62,67": 80,
    "39,51,63,67": 81,
    "39,51,63,67,70": 82,
    "39,51,67,68,70,72": 83,
    "39,51,67,70": 84,
    "39,51,67,70,72": 85,
    "39,51,67,73": 86,
    "39,51,70,79": 87,
    "39,68,72,78": 88,
    "40,43,76": 89,
    "40,44,47,51,71,83": 90,
    "40,45,52,57,64,69": 91,
    "40,47,52,59,64,71,76,83": 92,
    "40,48,72,77,79": 93,
    "40,49,52,61,64,73": 94,
    "40,52": 95,
    "40,52,62,64,68,69,71,73": 96,
    "40,52,64": 97,
    "40,52,64,68,71": 98,
    "40,52,64,68,71,80,83": 99,
    "40,52,64,68,71,81,85": 100,
    "40,52,64,68,71,83": 101,
    "40,52,64,69,73,81,85": 102,
    "40,52,64,76": 103,
    "40,52,67,69,73": 104,
    "40,52,67,70,73": 105,
    "40,52,72": 106,
    "40,52,73,79,82": 107,
    "40,52,73,82": 108,
    "40,52,76,79": 109,
    "40,52,82": 110,
    "40,52,82,86": 111,
    "40,52,85": 112,
    "40,64,68,71": 113,
    "41": 114,
    "41,45,48,53": 115,
    "41,45,48,53,83,84": 116,
    "41,45,48,53,83,84,89": 117,
    "41,45,48,53,84": 118,
    "41,45,48,53,84,89": 119,
    "41,45,50,57": 120,
    "41,45,50,64": 121,
    "41,45,62,63": 122,
    "41,45,64,65,67,69": 123,
    "41,45,72": 124,
    "41,45,77": 125,
    "41,45,84": 126,
    "41,48,57,58,64,65": 127,
    "41,50,65,69,70": 128,
    "41,53": 129,
    "41,53,56": 130,
    "41,53,56,65": 131,
    "41,53,57,58,65,67": 132,
    "41,53,57,65": 133,
    "41,53,58,60,67,69": 134,
    "41,53,58,67": 135,
    "41,53,60,65,69,72": 136,
    "41,53,63,68": 137,
    "41,53,65": 138,
    "41,53,68,72": 139,
    "41,53,69,72": 140,
    "41,53,69,74": 141,
    "41,53,69,74,77,81": 142,
    "41,53,71,74,80": 143,
    "41,53,72,75,77,81": 144,
    "41,53,73,83": 145,
    "41,53,74,77,82,86": 146,
    "41,53,77": 147,
    "41,53,77,79": 148,
    "41,53,86": 149,
    "41,57,65": 150,
    "41,57,67": 151,
    "41,60,68": 152,
    "41,62,68,71": 153,
    "41,62,68,72": 154,
    "41,64,67": 155,
    "41,65": 156,
    "41,65,69": 157,
    "41,69,72": 158,
    "41,69,72,77": 159,
    "41,72,73": 160,
    "41,77": 161,
    "41,80": 162,
    "42": 163,
    "42,43,54,55,66,67,78,79": 164,
    "42,45,66,69": 165,
    "42,54": 166,
    "42,54,66,78": 167,
    "42,54,69,72,74": 168,
    "42,54,69,73,81": 169,
    "42,54,72,76": 170,
    "42,54,72,81": 171,
    "42,54,85": 172,
    "42,62,69,72": 173,
    "42,63,71,72": 174,
    "42,63,72": 175,
    "42,63,72,74": 176,
    "43": 177,
    "43,44,63,70,72": 178,
    "43,45,55,57,67,69,79,81": 179,
    "43,45,55,64,67": 180,
    "43,47": 181,
    "43,47,50,55,79,83,86": 182,
    "43,47,50,55,83,86": 183,
    "43,47,50,55,86,89": 184,
    "43,47,53,55,57": 185,
    "43,47,59,74": 186,
    "43,47,71,74": 187,
    "43,47,74": 188,
    "43,47,79": 189,
    "43,48,55,60,64": 190,
    "43,48,63,68,70": 191,
    "43,48,64,65,67": 192,
    "43,48,76": 193,
    "43,48,76,77": 194,
    "43,50,53,59,62": 195,
    "43,50,53,69": 196,
    "43,50,65,67": 197,
    "43,52,71,72,74": 198,
    "43,55": 199,
    "43,55,59,60,62,64": 200,
    "43,55,59,62": 201,
    "43,55,60,64": 202,
    "43,55,62,65,67,71": 203,
    "43,55,64": 204,
    "43,55,65,70": 205,
    "43,55,67": 206,
    "43,55,67,70": 207,
    "43,55,67,70,75": 208,
    "43,55,67,79": 209,
    "43,55,69,76": 210,
    "43,55,70,74,75": 211,
    "43,55,70,75": 212,
    "43,55,71,74": 213,
    "43,55,71,79": 214,
    "43,55,72,75": 215,
    "43,55,74": 216,
    "43,55,74,79,83": 217,
    "43,55,74,83": 218,
    "43,55,76": 219,
    "43,55,76,83,86": 220,
    "43,55,79": 221,
    "43,55,81": 222,
    "43,55,82,86": 223,
    "43,57,71,74,77": 224,
    "43,59,62": 225,
    "43,59,62,64": 226,
    "43,59,62,65": 227,
    "43,59,67": 228,
    "43,59,67,69": 229,
    "43,59,69": 230,
    "43,59,74": 231,
    "43,60,64": 232,
    "43,60,71,72,74,76": 233,
    "43,62": 234,
    "43,62,67,70": 235,
    "43,63,70": 236,
    "43,63,71": 237,
    "43,63,72": 238,
    "43,65,67": 239,
    "43,67": 240,
    "43,71,74": 241,
    "43,71,74,76": 242,
    "43,74": 243,
    "43,79": 244,
    "44": 245,
    "44,45,64,71,73": 246,
    "44,46,63,67,72": 247,
    "44,53,60,65": 248,
    "44,56,67,72": 249,
    "44,56,76": 250,
    "44,56,76,86": 251,
    "44,63,72": 252,
    "45": 253,
    "45,46,55,63": 254,
    "45,46,57,58": 255,
    "45,46,62,63,65,66": 256,
    "45,46,65,74": 257,
    "45,47,57,59,69,71,81,83": 258,
    "45,48": 259,
    "45,48,57,66": 260,
    "45,48,64,67": 261,
    "45,48,65": 262,
    "45,48,72": 263,
    "45,48,77": 264,
    "45,48,84": 265,
    "45,49,52,57,69,73,76,79": 266,
    "45,49,52,57,69,73,76,81": 267,
    "45,49,52,57,71,83": 268,
    "45,49,52,57,73,76,81": 269,
    "45,49,52,57,73,76,81,85": 270,
    "45,49,52,57,73,83": 271,
    "45,49,52,71,83": 272,
    "45,49,57,61,69,71": 273,
    "45,49,71,83": 274,
    "45,49,76": 275,
    "45,50,54,55,61,62": 276,
    "45,50,65": 277,
    "45,50,66,78": 278,
    "45,50,69,74": 279,
    "45,50,76,79": 280,
    "45,50,78,81,86": 281,
    "45,50,81": 282,
    "45,52,55,61,64": 283,
    "45,52,57,73,76": 284,
    "45,53,65": 285,
    "45,53,77": 286,
    "45,53,81,82,84": 287,
    "45,55,61": 288,
    "45,55,61,64": 289,
    "45,55,64": 290,
    "45,57": 291,
    "45,57,61,64": 292,
    "45,57,61,64,69": 293,
    "45,57,61,64,69,73": 294,
    "45,57,61,64,69,73,81": 295,
    "45,57,61,64,69,81": 296,
    "45,57,61,69": 297,
    "45,57,64": 298,
    "45,57,64,69": 299,
    "45,57,64,69,73": 300,
    "45,57,64,69,73,81,85": 301,
    "45,57,65,69": 302,
    "45,57,66": 303,
    "45,57,67,73": 304,
    "45,57,68,69": 305,
    "45,57,69": 306,
    "45,57,69,71": 307,
    "45,57,69,73": 308,
    "45,57,69,77": 309,
    "45,57,69,81": 310,
    "45,57,72": 311,
    "45,57,72,74,78": 312,
    "45,57,72,75,77": 313,
    "45,57,73": 314,
    "45,57,73,76,81": 315,
    "45,57,77,84,87": 316,
    "45,57,81": 317,
    "45,57,81,84": 318,
    "45,57,85": 319,
    "45,60,63,66": 320,
    "45,60,64": 321,
    "45,60,65": 322,
    "45,61": 323,
    "45,61,64": 324,
    "45,61,64,69": 325,
    "45,61,69": 326,
    "45,62": 327,
    "45,63,66": 328,
    "45,63,72": 329,
    "45,64": 330,
    "45,64,65": 331,
    "45,64,67": 332,
    "45,64,68,71": 333,
    "45,64,69": 334,
    "45,64,69,73": 335,
    "45,64,73": 336,
    "45,65": 337,
    "45,65,70,72": 338,
    "45,65,72": 339,
    "45,65,72,74": 340,
    "45,69": 341,
    "45,69,81": 342,
    "45,72,74": 343,
    "45,72,76": 344,
    "45,76,77": 345,
    "46": 346,
    "46,48,55,63": 347,
    "46,50,53,58,62,65,70": 348,
    "46,50,55,78,79": 349,
    "46,50,58": 350,
    "46,50,58,70": 351,
    "46,50,65,67": 352,
    "46,50,65,70,74": 353,
    "46,50,68": 354,
    "46,50,70": 355,
    "46,51,55,58,63,65": 356,
    "46,51,62,63,65,67": 357,
    "46,52,64": 358,
    "46,53,56,62": 359,
    "46,53,62,68": 360,
    "46,53,68,75": 361,
    "46,55,56,63,65": 362,
    "46,55,58,67": 363,
    "46,55,63": 364,
    "46,55,70": 365,
    "46,55,75": 366,
    "46,56,62,63,65": 367,
    "46,56,62,65,67": 368,
    "46,57,58,72,76": 369,
    "46,58": 370,
    "46,58,60": 371,
    "46,58,60,63,65,69": 372,
    "46,58,61": 373,
    "46,58,62": 374,
    "46,58,63,65,67": 375,
    "46,58,64,67,73": 376,
    "46,58,65": 377,
    "46,58,65,72,74": 378,
    "46,58,65,74": 379,
    "46,58,67,72,75": 380,
    "46,58,67,72,77": 381,
    "46,58,68,73": 382,
    "46,58,70": 383,
    "46,58,70,74": 384,
    "46,58,72": 385,
    "46,58,74,79": 386,
    "46,58,76,85": 387,
    "46,58,77,82,86": 388,
    "46,58,79,81": 389,
    "46,58,82,86": 390,
    "46,58,85": 391,
    "46,62": 392,
    "46,62,63": 393,
    "46,62,63,65": 394,
    "46,62,63,65,68": 395,
    "46,62,65": 396,
    "46,62,65,67": 397,
    "46,62,67": 398,
    "46,62,67,68": 399,
    "46,62,70": 400,
    "46,63,67": 401,
    "46,63,67,68": 402,
    "46,63,72": 403,
    "46,64": 404,
    "46,65": 405,
    "46,65,70,74,77": 406,
    "46,65,74": 407,
    "46,67": 408,
    "46,67,70": 409,
    "46,67,75": 410,
    "46,68,70": 411,
    "46,70": 412,
    "46,74": 413,
    "46,74,77": 414,
    "46,74,80": 415,
    "46,74,82": 416,
    "46,75,79": 417,
    "46,76": 418,
    "46,76,77": 419,
    "46,77": 420,
    "46,77,79": 421,
    "46,79,82": 422,
    "46,81,82": 423,
    "47": 424,
    "47,48,68,77": 425,
    "47,49,71,73": 426,
    "47,50": 427,
    "47,50,67": 428,
    "47,50,68,77": 429,
    "47,50,71,74": 430,
    "47,50,79": 431,
    "47,52,68,80": 432,
    "47,53,68": 433,
    "47,54,59,62": 434,
    "47,54,75,76": 435,
    "47,55,59,67": 436,
    "47,55,83": 437,
    "47,59": 438,
    "47,59,62,66,71": 439,
    "47,59,62,66,74": 440,
    "47,59,62,68,74": 441,
    "47,59,71,83": 442,
    "47,59,77,80": 443,
    "47,59,77,80,86,89": 444,
    "47,59,79": 445,
    "47,65,67": 446,
    "47,67": 447,
    "47,73,75": 448,
    "47,76,79": 449,
    "47,77": 450,
    "47,79": 451,
    "47,85,86": 452,
    "48": 453,
    "48,49,79,80": 454,
    "48,50": 455,
    "48,50,52,67,69": 456,
    "48,50,56,65": 457,
    "48,50,65,67": 458,
    "48,50,72,76": 459,
    "48,50,76": 460,
    "48,51": 461,
    "48,51,54,69": 462,
    "48,51,56,57,65,66": 463,
    "48,51,63,67,68": 464,
    "48,51,69": 465,
    "48,51,72": 466,
    "48,51,74,75": 467,
    "48,52": 468,
    "48,52,53,57,58,64,65": 469,
    "48,52,53,57,58,65,72": 470,
    "48,52,55,60,67,72,76,79": 471,
    "48,52,55,60,72,76,79,84": 472,
    "48,52,57,69": 473,
    "48,52,57,69,71": 474,
    "48,52,58,60,62": 475,
    "48,52,58,72": 476,
    "48,52,60": 477,
    "48,52,60,64": 478,
    "48,52,60,67": 479,
    "48,52,64,67,72": 480,
    "48,52,65,67": 481,
    "48,52,67": 482,
    "48,52,67,69": 483,
    "48,52,67,72,76": 484,
    "48,52,67,79": 485,
    "48,52,69": 486,
    "48,52,69,70": 487,
    "48,52,69,71": 488,
    "48,52,70,72": 489,
    "48,52,72": 490,
    "48,52,72,77,79": 491,
    "48,52,74,77": 492,
    "48,52,75,76": 493,
    "48,52,76,77": 494,
    "48,52,78,79": 495,
    "48,52,79": 496,
    "48,52,79,81": 497,
    "48,52,81": 498,
    "48,52,84": 499,
    "48,53": 500,
    "48,53,57,58,64,65,67": 501,
    "48,53,69": 502,
    "48,53,69,72": 503,
    "48,53,72": 504,
    "48,53,72,77": 505,
    "48,53,77": 506,
    "48,53,79": 507,
    "48,53,83,84": 508,
    "48,54": 509,
    "48,54,56": 510,
    "48,54,56,68": 511,
    "48,54,68": 512,
    "48,54,69": 513,
    "48,55": 514,
    "48,55,58": 515,
    "48,55,58,60,64": 516,
    "48,55,58,64": 517,
    "48,55,58,76": 518,
    "48,55,59,72,74": 519,
    "48,55,60,70": 520,
    "48,55,60,72": 521,
    "48,55,63,67": 522,
    "48,55,64": 523,
    "48,55,67,72,76": 524,
    "48,55,71,72,74,76": 525,
    "48,55,71,74": 526,
    "48,55,72": 527,
    "48,55,74,77": 528,
    "48,55,75,76": 529,
    "48,55,75,79": 530,
    "48,55,76": 531,
    "48,55,76,78": 532,
    "48,55,76,79": 533,
    "48,55,77": 534,
    "48,55,77,79": 535,
    "48,55,84,86": 536,
    "48,56": 537,
    "48,56,65,68,77": 538,
    "48,56,68": 539,
    "48,57,60,65": 540,
    "48,57,65": 541,
    "48,57,69,72": 542,
    "48,57,72": 543,
    "48,57,72,77": 544,
    "48,57,75,76": 545,
    "48,57,77": 546,
    "48,57,77,81": 547,
    "48,57,81,84": 548,
    "48,57,84": 549,
    "48,58": 550,
    "48,58,60,64,65,67": 551,
    "48,58,60,64,67": 552,
    "48,58,60,65": 553,
    "48,58,60,70": 554,
    "48,58,64": 555,
    "48,58,64,65,67": 556,
    "48,58,64,67": 557,
    "48,58,64,67,69": 558,
    "48,58,67": 559,
    "48,58,67,69": 560,
    "48,58,79,81": 561,
    "48,58,85": 562,
    "48,60": 563,
    "48,60,64": 564,
    "48,60,64,65,67,71,72,74": 565,
    "48,60,64,67": 566,
    "48,60,64,67,72": 567,
    "48,60,64,72": 568,
    "48,60,65": 569,
    "48,60,65,67,71,74": 570,
    "48,60,65,68": 571,
    "48,60,65,69": 572,
    "48,60,65,71,74": 573,
    "48,60,67,70,76": 574,
    "48,60,67,72,76": 575,
    "48,60,67,76": 576,
    "48,60,70,76,79": 577,
    "48,60,72,74,76,77": 578,
    "48,60,74,81": 579,
    "48,60,75": 580,
    "48,60,75,79": 581,
    "48,60,76,77,79": 582,
    "48,60,76,79,84": 583,
    "48,60,79": 584,
    "48,60,79,81": 585,
    "48,60,84": 586,
    "48,62,64,67": 587,
    "48,62,67": 588,
    "48,63": 589,
    "48,63,65": 590,
    "48,63,67": 591,
    "48,63,68": 592,
    "48,64": 593,
    "48,64,65": 594,
    "48,64,65,67": 595,
    "48,64,65,67,69": 596,
    "48,64,67": 597,
    "48,64,67,69": 598,
    "48,64,67,70": 599,
    "48,64,67,72": 600,
    "48,64,70": 601,
    "48,64,72": 602,
    "48,64,74": 603,
    "48,65": 604,
    "48,65,69": 605,
    "48,67,76": 606,
    "48,68,72": 607,
    "48,69,72": 608,
    "48,70,72": 609,
    "48,71,74": 610,
    "48,72": 611,
    "48,72,74": 612,
    "48,72,75": 613,
    "48,72,76": 614,
    "48,72,76,77": 615,
    "48,75": 616,
    "48,75,77": 617,
    "48,75,79": 618,
    "48,76": 619,
    "48,76,77": 620,
    "48,76,77,79": 621,
    "48,76,79": 622,
    "48,76,84": 623,
    "48,77": 624,
    "48,81": 625,
    "48,84": 626,
    "48,85": 627,
    "49": 628,
    "49,51,68,69": 629,
    "49,52,57,73,85": 630,
    "49,52,68,73,76": 631,
    "49,53,56,61": 632,
    "49,53,56,61,63": 633,
    "49,53,61": 634,
    "49,53,61,63": 635,
    "49,53,70": 636,
    "49,53,72": 637,
    "49,55,76": 638,
    "49,56,60,61": 639,
    "49,56,61": 640,
    "49,57,61,69": 641,
    "49,58,67": 642,
    "49,58,77": 643,
    "49,58,78,79": 644,
    "49,58,79": 645,
    "49,61": 646,
    "49,61,64,69,76": 647,
    "49,61,71,74": 648,
    "49,61,73": 649,
    "49,61,73,74": 650,
    "49,64": 651,
    "49,67,70": 652,
    "49,69,71": 653,
    "49,69,76,79": 654,
    "49,70": 655,
    "49,73,77": 656,
    "49,77": 657,
    "49,77,78": 658,
    "49,79": 659,
    "49,79,81": 660,
    "50": 661,
    "50,51": 662,
    "50,51,53,58,63,72": 663,
    "50,51,53,58,68": 664,
    "50,51,55,56,71,72": 665,
    "50,51,55,58,63": 666,
    "50,51,55,58,70": 667,
    "50,51,56,58,63,72": 668,
    "50,51,56,58,70,71": 669,
    "50,51,56,65": 670,
    "50,51,67,68": 671,
    "50,51,67,79": 672,
    "50,52": 673,
    "50,52,59,62,71,74": 674,
    "50,52,64,66,69,71,73,74": 675,
    "50,52,72,76": 676,
    "50,53": 677,
    "50,53,56,59,71,74,77,80": 678,
    "50,53,56,59,80": 679,
    "50,53,56,71": 680,
    "50,53,56,71,72": 681,
    "50,53,57,74": 682,
    "50,53,57,77,81": 683,
    "50,53,58": 684,
    "50,53,58,70": 685,
    "50,53,58,70,72": 686,
    "50,53,58,77": 687,
    "50,53,58,79,81": 688,
    "50,53,58,81,82": 689,
    "50,53,59,79": 690,
    "50,53,62,65": 691,
    "50,53,62,71": 692,
    "50,53,65,70": 693,
    "50,53,68": 694,
    "50,53,69": 695,
    "50,53,69,70": 696,
    "50,53,70": 697,
    "50,53,70,72,81,82": 698,
    "50,53,70,82": 699,
    "50,53,71": 700,
    "50,53,72": 701,
    "50,53,74": 702,
    "50,53,74,77": 703,
    "50,53,76,77": 704,
    "50,53,77": 705,
    "50,53,77,81": 706,
    "50,53,79": 707,
    "50,54,57": 708,
    "50,54,57,60,62,66,69": 709,
    "50,54,57,74": 710,
    "50,54,57,74,78": 711,
    "50,54,57,74,78,81": 712,
    "50,54,57,78,81": 713,
    "50,54,59,78,81": 714,
    "50,54,59,81": 715,
    "50,54,60,69": 716,
    "50,54,60,69,71": 717,
    "50,54,62": 718,
    "50,54,62,66": 719,
    "50,54,62,74,86": 720,
    "50,54,69": 721,
    "50,54,74": 722,
    "50,54,76,78,79": 723,
    "50,55": 724,
    "50,55,57,59,60,66,67": 725,
    "50,55,58": 726,
    "50,55,58,74": 727,
    "50,55,59,67": 728,
    "50,55,59,74": 729,
    "50,55,59,74,76": 730,
    "50,55,60,69": 731,
    "50,55,62,67": 732,
    "50,55,67,71": 733,
    "50,55,71": 734,
    "50,55,71,74": 735,
    "50,55,72,74": 736,
    "50,55,73": 737,
    "50,55,77": 738,
    "50,55,78,79": 739,
    "50,55,78,83": 740,
    "50,55,79": 741,
    "50,55,88": 742,
    "50,56": 743,
    "50,56,58": 744,
    "50,56,58,70": 745,
    "50,56,58,70,72": 746,
    "50,56,62,68,71,77": 747,
    "50,56,70": 748,
    "50,56,71": 749,
    "50,56,72": 750,
    "50,57": 751,
    "50,57,60,62,66": 752,
    "50,57,60,64,66,67": 753,
    "50,57,60,66": 754,
    "50,57,60,66,67": 755,
    "50,57,60,66,69": 756,
    "50,57,60,69,72": 757,
    "50,57,64,66,71,73,74": 758,
    "50,57,66,67": 759,
    "50,57,67,69": 760,
    "50,57,72": 761,
    "50,57,74": 762,
    "50,57,74,78": 763,
    "50,57,79": 764,
    "50,58": 765,
    "50,58,60": 766,
    "50,58,67": 767,
    "50,58,70": 768,
    "50,58,72,74": 769,
    "50,58,74,75": 770,
    "50,58,75,77": 771,
    "50,58,76,77": 772,
    "50,58,77": 773,
    "50,58,77,79": 774,
    "50,58,77,82": 775,
    "50,58,81": 776,
    "50,58,81,82": 777,
    "50,58,82": 778,
    "50,59": 779,
    "50,59,64,65": 780,
    "50,59,66": 781,
    "50,59,66,67,71": 782,
    "50,59,66,74": 783,
    "50,59,67": 784,
    "50,59,71": 785,
    "50,59,74": 786,
    "50,59,74,76": 787,
    "50,59,77": 788,
    "50,59,77,78,80": 789,
    "50,59,78,80": 790,
    "50,59,86,88": 791,
    "50,60,66,67": 792,
    "50,60,66,69,71": 793,
    "50,60,69": 794,
    "50,60,69,71": 795,
    "50,62": 796,
    "50,62,66": 797,
    "50,62,66,69": 798,
    "50,62,67,71": 799,
    "50,62,68": 800,
    "50,62,69": 801,
    "50,62,69,74,78": 802,
    "50,62,71": 803,
    "50,62,72": 804,
    "50,62,73,74": 805,
    "50,62,74": 806,
    "50,62,74,82": 807,
    "50,62,77": 808,
    "50,62,78": 809,
    "50,62,78,81": 810,
    "50,62,82,84": 811,
    "50,62,84,86": 812,
    "50,62,85,86": 813,
    "50,64,65": 814,
    "50,64,73": 815,
    "50,65": 816,
    "50,65,67": 817,
    "50,65,69": 818,
    "50,65,70": 819,
    "50,66": 820,
    "50,66,69": 821,
    "50,66,69,74": 822,
    "50,66,71,74": 823,
    "50,66,78": 824,
    "50,67": 825,
    "50,67,69": 826,
    "50,68": 827,
    "50,68,80": 828,
    "50,69": 829,
    "50,69,70": 830,
    "50,69,74,77": 831,
    "50,70": 832,
    "50,70,72": 833,
    "50,71": 834,
    "50,71,83": 835,
    "50,72,74": 836,
    "50,74": 837,
    "50,74,77": 838,
    "50,74,78": 839,
    "50,77": 840,
    "50,77,79": 841,
    "50,78": 842,
    "50,78,81,86": 843,
    "50,79": 844,
    "50,80": 845,
    "50,81": 846,
    "50,81,82": 847,
    "51": 848,
    "51,52,68,69": 849,
    "51,52,80,81": 850,
    "51,52,83": 851,
    "51,53": 852,
    "51,53,58,60,74": 853,
    "51,53,60": 854,
    "51,53,60,69": 855,
    "51,53,68,74": 856,
    "51,53,68,75": 857,
    "51,53,69,72": 858,
    "51,53,71,74": 859,
    "51,53,72": 860,
    "51,53,72,81": 861,
    "51,53,74,82": 862,
    "51,53,77,79": 863,
    "51,53,79,80": 864,
    "51,53,84": 865,
    "51,54,57,60": 866,
    "51,54,57,60,69,72,75,78": 867,
    "51,54,57,60,78": 868,
    "51,54,68,72": 869,
    "51,54,68,72,78": 870,
    "51,55": 871,
    "51,55,58": 872,
    "51,55,58,62,63": 873,
    "51,55,58,63": 874,
    "51,55,58,63,65": 875,
    "51,55,58,70": 876,
    "51,55,58,70,72": 877,
    "51,55,58,70,75": 878,
    "51,55,58,71,72": 879,
    "51,55,58,72,73": 880,
    "51,55,58,73,74": 881,
    "51,55,58,74,75": 882,
    "51,55,58,79": 883,
    "51,55,60,70,72": 884,
    "51,55,60,72,74": 885,
    "51,55,60,72,79": 886,
    "51,55,60,74,75": 887,
    "51,55,60,75,79": 888,
    "51,55,61,73,85": 889,
    "51,55,63": 890,
    "51,55,63,65": 891,
    "51,55,67,68,70,75": 892,
    "51,55,67,70": 893,
    "51,55,70": 894,
    "51,55,70,72,79,81": 895,
    "51,55,72": 896,
    "51,55,74": 897,
    "51,55,74,75,77": 898,
    "51,55,75": 899,
    "51,55,75,77": 900,
    "51,55,79": 901,
    "51,56": 902,
    "51,56,62,65": 903,
    "51,56,68,75": 904,
    "51,58": 905,
    "51,58,62,63": 906,
    "51,58,63": 907,
    "51,58,67,68": 908,
    "51,58,68": 909,
    "51,58,71": 910,
    "51,58,72": 911,
    "51,58,72,74": 912,
    "51,58,73": 913,
    "51,58,75": 914,
    "51,58,75,79": 915,
    "51,58,77,86": 916,
    "51,58,78": 917,
    "51,58,79": 918,
    "51,58,79,81": 919,
    "51,58,79,82": 920,
    "51,59,79,80": 921,
    "51,60": 922,
    "51,60,61,68": 923,
    "51,60,62": 924,
    "51,60,67,75": 925,
    "51,60,68": 926,
    "51,60,70": 927,
    "51,60,72": 928,
    "51,60,72,74": 929,
    "51,60,74": 930,
    "51,60,74,75": 931,
    "51,60,75": 932,
    "51,60,75,77": 933,
    "51,60,77": 934,
    "51,60,79": 935,
    "51,60,81,84": 936,
    "51,61,67,68,72": 937,
    "51,61,67,70,72": 938,
    "51,61,68": 939,
    "51,63": 940,
    "51,63,65,67,68": 941,
    "51,63,67": 942,
    "51,63,67,68,72": 943,
    "51,63,67,73,79": 944,
    "51,63,70": 945,
    "51,63,70,79": 946,
    "51,63,72": 947,
    "51,63,72,74": 948,
    "51,63,77,79": 949,
    "51,63,78": 950,
    "51,63,84,86": 951,
    "51,63,84,87": 952,
    "51,65,68": 953,
    "51,66": 954,
    "51,66,67": 955,
    "51,67": 956,
    "51,67,70": 957,
    "51,67,79": 958,
    "51,68,69": 959,
    "51,68,77": 960,
    "51,69": 961,
    "51,69,72": 962,
    "51,69,81": 963,
    "51,71,72": 964,
    "51,71,83": 965,
    "51,72": 966,
    "51,72,74": 967,
    "51,72,75": 968,
    "51,75": 969,
    "51,75,77": 970,
    "51,75,77,84,86": 971,
    "51,75,84": 972,
    "51,77": 973,
    "51,77,86": 974,
    "51,78": 975,
    "51,79": 976,
    "51,79,81": 977,
    "51,81,82": 978,
    "51,81,83": 979,
    "51,82": 980,
    "51,84": 981,
    "51,86,87": 982,
    "52": 983,
    "52,53": 984,
    "52,53,55,60": 985,
    "52,53,57,69": 986,
    "52,53,62,71": 987,
    "52,53,67,72": 988,
    "52,53,72,76": 989,
    "52,53,72,79": 990,
    "52,53,72,81": 991,
    "52,53,73,82": 992,
    "52,53,79,81": 993,
    "52,54": 994,
    "52,54,55,57,69,72,74": 995,
    "52,54,64,66": 996,
    "52,54,75,87": 997,
    "52,54,78": 998,
    "52,54,83": 999,
    "52,55": 1000,
    "52,55,58": 1001,
    "52,55,58,61,82": 1002,
    "52,55,58,72": 1003,
    "52,55,58,84": 1004,
    "52,55,59,66,67,69": 1005,
    "52,55,59,67,71": 1006,
    "52,55,60": 1007,
    "52,55,60,70": 1008,
    "52,55,60,71,72": 1009,
    "52,55,60,72": 1010,
    "52,55,60,72,74": 1011,
    "52,55,60,76,79": 1012,
    "52,55,60,83,84": 1013,
    "52,55,62,64,67,71,72": 1014,
    "52,55,62,64,67,72": 1015,
    "52,55,64,67": 1016,
    "52,55,67": 1017,
    "52,55,70": 1018,
    "52,55,71,72": 1019,
    "52,55,71,72,74": 1020,
    "52,55,71,83": 1021,
    "52,55,72": 1022,
    "52,55,72,73": 1023,
    "52,55,72,74": 1024,
    "52,55,72,74,76,77": 1025,
    "52,55,73,82": 1026,
    "52,55,73,85": 1027,
    "52,55,76": 1028,
    "52,55,76,77": 1029,
    "52,55,79": 1030,
    "52,55,84": 1031,
    "52,55,84,86,88": 1032,
    "52,55,88": 1033,
    "52,56,57,71,73,74": 1034,
    "52,56,59,64,76": 1035,
    "52,56,59,71,74": 1036,
    "52,56,69,71,72": 1037,
    "52,56,71": 1038,
    "52,56,71,72": 1039,
    "52,56,71,73": 1040,
    "52,56,76": 1041,
    "52,57,59,61,62,69": 1042,
    "52,57,59,62,64,68,71": 1043,
    "52,57,59,62,68": 1044,
    "52,57,61,62,68,69": 1045,
    "52,57,61,62,68,69,71": 1046,
    "52,57,61,64,69,73": 1047,
    "52,57,61,69": 1048,
    "52,57,61,69,78": 1049,
    "52,57,61,73": 1050,
    "52,57,61,76,78": 1051,
    "52,57,64,68,71,73": 1052,
    "52,57,69,71,73": 1053,
    "52,57,69,72": 1054,
    "52,57,69,76": 1055,
    "52,57,72": 1056,
    "52,57,72,76": 1057,
    "52,57,73": 1058,
    "52,57,73,74": 1059,
    "52,57,73,85": 1060,
    "52,57,76": 1061,
    "52,58": 1062,
    "52,58,61": 1063,
    "52,58,61,67": 1064,
    "52,58,64,70": 1065,
    "52,58,67,69": 1066,
    "52,58,73": 1067,
    "52,58,79": 1068,
    "52,58,79,81": 1069,
    "52,59,61,68,69": 1070,
    "52,59,62,68": 1071,
    "52,59,62,68,71": 1072,
    "52,59,62,69": 1073,
    "52,59,64,67": 1074,
    "52,59,68": 1075,
    "52,59,68,69": 1076,
    "52,59,71,81": 1077,
    "52,59,79": 1078,
    "52,60": 1079,
    "52,60,67": 1080,
    "52,60,67,69": 1081,
    "52,60,67,69,71": 1082,
    "52,60,70": 1083,
    "52,60,71": 1084,
    "52,60,72": 1085,
    "52,60,72,82": 1086,
    "52,60,79": 1087,
    "52,60,79,81": 1088,
    "52,60,79,83,84": 1089,
    "52,60,79,84": 1090,
    "52,60,82": 1091,
    "52,60,84": 1092,
    "52,61": 1093,
    "52,61,69": 1094,
    "52,61,69,71": 1095,
    "52,61,76,81": 1096,
    "52,62,68": 1097,
    "52,62,68,69": 1098,
    "52,62,68,71": 1099,
    "52,62,71": 1100,
    "52,62,71,73": 1101,
    "52,62,71,79": 1102,
    "52,62,78,81": 1103,
    "52,64": 1104,
    "52,64,67,72": 1105,
    "52,64,68,69,71,73": 1106,
    "52,64,68,71": 1107,
    "52,64,68,76,80": 1108,
    "52,64,69,71": 1109,
    "52,64,69,71,72": 1110,
    "52,64,69,72": 1111,
    "52,64,69,73": 1112,
    "52,64,71": 1113,
    "52,64,71,72": 1114,
    "52,64,71,72,83,84": 1115,
    "52,64,72,74": 1116,
    "52,64,72,74,84,86": 1117,
    "52,64,73,74": 1118,
    "52,64,74,76": 1119,
    "52,64,76": 1120,
    "52,64,80": 1121,
    "52,64,83": 1122,
    "52,64,88": 1123,
    "52,66,69": 1124,
    "52,67": 1125,
    "52,67,69": 1126,
    "52,67,70": 1127,
    "52,67,70,72": 1128,
    "52,67,70,73": 1129,
    "52,67,72": 1130,
    "52,67,72,73": 1131,
    "52,68,69": 1132,
    "52,68,71": 1133,
    "52,68,71,72": 1134,
    "52,68,71,76": 1135,
    "52,68,80": 1136,
    "52,69": 1137,
    "52,69,71": 1138,
    "52,69,73": 1139,
    "52,70": 1140,
    "52,70,72": 1141,
    "52,70,73": 1142,
    "52,71": 1143,
    "52,71,72": 1144,
    "52,72": 1145,
    "52,72,74": 1146,
    "52,72,76": 1147,
    "52,72,82": 1148,
    "52,73": 1149,
    "52,74": 1150,
    "52,74,76": 1151,
    "52,75,76": 1152,
    "52,76": 1153,
    "52,76,79": 1154,
    "52,76,80,83": 1155,
    "52,76,80,83,85": 1156,
    "52,78,80": 1157,
    "52,79": 1158,
    "52,79,81": 1159,
    "52,79,81,83": 1160,
    "52,81": 1161,
    "52,81,83": 1162,
    "52,82": 1163,
    "52,83": 1164,
    "52,84": 1165,
    "53": 1166,
    "53,54,73,81": 1167,
    "53,55": 1168,
    "53,55,57,60,62,64,72,74": 1169,
    "53,55,57,60,62,64,74,79": 1170,
    "53,55,57,60,72": 1171,
    "53,55,57,65,71,72": 1172,
    "53,55,57,77": 1173,
    "53,55,58": 1174,
    "53,55,58,60": 1175,
    "53,55,58,64,67,70": 1176,
    "53,55,58,77": 1177,
    "53,55,61,70": 1178,
    "53,55,62,71": 1179,
    "53,55,63,65,67,68": 1180,
    "53,55,64,65": 1181,
    "53,55,64,70,72": 1182,
    "53,55,69,70,77,79": 1183,
    "53,55,69,72": 1184,
    "53,55,70,79": 1185,
    "53,55,71,74": 1186,
    "53,55,72,79": 1187,
    "53,55,76,77": 1188,
    "53,55,77,79": 1189,
    "53,55,77,79,81": 1190,
    "53,55,83,84": 1191,
    "53,56": 1192,
    "53,56,57,84": 1193,
    "53,56,59": 1194,
    "53,56,59,77": 1195,
    "53,56,60,65": 1196,
    "53,56,61,62,70,71": 1197,
    "53,56,61,72,73": 1198,
    "53,56,61,73": 1199,
    "53,56,65": 1200,
    "53,56,65,68": 1201,
    "53,56,68": 1202,
    "53,56,68,72": 1203,
    "53,56,68,72,77": 1204,
    "53,56,68,74": 1205,
    "53,56,68,74,75": 1206,
    "53,56,68,74,82": 1207,
    "53,56,71": 1208,
    "53,56,72": 1209,
    "53,56,72,73": 1210,
    "53,56,74": 1211,
    "53,56,74,75": 1212,
    "53,56,75": 1213,
    "53,56,75,77": 1214,
    "53,56,77": 1215,
    "53,56,79,80": 1216,
    "53,56,80,82": 1217,
    "53,56,84": 1218,
    "53,57": 1219,
    "53,57,58,72,74": 1220,
    "53,57,60": 1221,
    "53,57,60,63,72,74": 1222,
    "53,57,60,65": 1223,
    "53,57,60,65,67": 1224,
    "53,57,60,65,69": 1225,
    "53,57,60,69": 1226,
    "53,57,60,71": 1227,
    "53,57,60,72": 1228,
    "53,57,60,72,75": 1229,
    "53,57,60,72,77": 1230,
    "53,57,60,77": 1231,
    "53,57,60,80,81": 1232,
    "53,57,61,77": 1233,
    "53,57,62": 1234,
    "53,57,62,64": 1235,
    "53,57,62,65": 1236,
    "53,57,62,69": 1237,
    "53,57,62,74,76,77": 1238,
    "53,57,62,74,77,81": 1239,
    "53,57,62,76": 1240,
    "53,57,62,77,79,81": 1241,
    "53,57,62,77,81": 1242,
    "53,57,63,64": 1243,
    "53,57,63,65": 1244,
    "53,57,63,65,67": 1245,
    "53,57,63,74": 1246,
    "53,57,63,77": 1247,
    "53,57,63,77,79": 1248,
    "53,57,64,65": 1249,
    "53,57,65": 1250,
    "53,57,65,67": 1251,
    "53,57,65,69": 1252,
    "53,57,67,69": 1253,
    "53,57,68,69,80,81": 1254,
    "53,57,69": 1255,
    "53,57,69,71": 1256,
    "53,57,69,72": 1257,
    "53,57,69,74": 1258,
    "53,57,69,77": 1259,
    "53,57,70,72": 1260,
    "53,57,71,73": 1261,
    "53,57,72": 1262,
    "53,57,72,74": 1263,
    "53,57,72,77": 1264,
    "53,57,72,84": 1265,
    "53,57,73,74": 1266,
    "53,57,73,76": 1267,
    "53,57,74": 1268,
    "53,57,74,75": 1269,
    "53,57,74,76": 1270,
    "53,57,74,77": 1271,
    "53,57,75": 1272,
    "53,57,76,77": 1273,
    "53,57,77": 1274,
    "53,57,77,79": 1275,
    "53,57,77,81": 1276,
    "53,57,79": 1277,
    "53,57,79,81": 1278,
    "53,57,81": 1279,
    "53,57,84": 1280,
    "53,57,86": 1281,
    "53,57,89": 1282,
    "53,58": 1283,
    "53,58,60,62,63,69,70": 1284,
    "53,58,60,69,70": 1285,
    "53,58,62,63,69,70": 1286,
    "53,58,62,74": 1287,
    "53,58,62,77": 1288,
    "53,58,63,69,72": 1289,
    "53,58,63,72": 1290,
    "53,58,64,65,67": 1291,
    "53,58,65,70": 1292,
    "53,58,67": 1293,
    "53,58,70": 1294,
    "53,58,70,74": 1295,
    "53,58,70,82": 1296,
    "53,58,70,82,84,86": 1297,
    "53,58,72": 1298,
    "53,58,74": 1299,
    "53,58,74,75": 1300,
    "53,58,74,77": 1301,
    "53,58,77,79": 1302,
    "53,58,81": 1303,
    "53,58,81,82": 1304,
    "53,58,82": 1305,
    "53,59": 1306,
    "53,59,60,62,63,77": 1307,
    "53,59,62": 1308,
    "53,59,62,77": 1309,
    "53,59,74": 1310,
    "53,59,79": 1311,
    "53,59,80": 1312,
    "53,60": 1313,
    "53,60,62": 1314,
    "53,60,62,69,70": 1315,
    "53,60,63,64": 1316,
    "53,60,63,64,65": 1317,
    "53,60,63,65": 1318,
    "53,60,63,65,67": 1319,
    "53,60,63,67": 1320,
    "53,60,63,67,69": 1321,
    "53,60,63,69": 1322,
    "53,60,63,69,70": 1323,
    "53,60,63,69,75": 1324,
    "53,60,63,70": 1325,
    "53,60,63,70,72": 1326,
    "53,60,63,72": 1327,
    "53,60,63,72,74": 1328,
    "53,60,63,74": 1329,
    "53,60,63,74,75": 1330,
    "53,60,63,74,77": 1331,
    "53,60,63,75": 1332,
    "53,60,63,75,77": 1333,
    "53,60,63,77": 1334,
    "53,60,63,81": 1335,
    "53,60,63,81,82,84": 1336,
    "53,60,63,84": 1337,
    "53,60,63,84,87": 1338,
    "53,60,63,87": 1339,
    "53,60,64,65,69,72": 1340,
    "53,60,65": 1341,
    "53,60,65,69": 1342,
    "53,60,68": 1343,
    "53,60,68,69,80,81": 1344,
    "53,60,68,80": 1345,
    "53,60,69": 1346,
    "53,60,69,70": 1347,
    "53,60,69,72": 1348,
    "53,60,69,79": 1349,
    "53,60,70": 1350,
    "53,60,70,72": 1351,
    "53,60,72": 1352,
    "53,60,72,77": 1353,
    "53,60,75": 1354,
    "53,60,76,77": 1355,
    "53,60,77": 1356,
    "53,60,77,79": 1357,
    "53,60,80": 1358,
    "53,60,80,81": 1359,
    "53,60,81": 1360,
    "53,60,81,83": 1361,
    "53,60,81,83,84": 1362,
    "53,60,82,84": 1363,
    "53,61,70": 1364,
    "53,61,70,73,82": 1365,
    "53,61,77": 1366,
    "53,62": 1367,
    "53,62,63,70,72": 1368,
    "53,62,63,82,84": 1369,
    "53,62,65": 1370,
    "53,62,65,70": 1371,
    "53,62,67,71": 1372,
    "53,62,68": 1373,
    "53,62,70": 1374,
    "53,62,70,72": 1375,
    "53,62,70,74": 1376,
    "53,62,72": 1377,
    "53,62,72,74": 1378,
    "53,62,74": 1379,
    "53,62,74,77": 1380,
    "53,62,75,77": 1381,
    "53,62,77": 1382,
    "53,62,77,79": 1383,
    "53,62,77,81": 1384,
    "53,62,77,82": 1385,
    "53,62,79": 1386,
    "53,62,80": 1387,
    "53,62,81": 1388,
    "53,62,82": 1389,
    "53,62,82,84": 1390,
    "53,62,82,86": 1391,
    "53,62,84,86": 1392,
    "53,62,89": 1393,
    "53,63,69": 1394,
    "53,63,69,70,72": 1395,
    "53,63,69,72": 1396,
    "53,63,70,72": 1397,
    "53,63,72": 1398,
    "53,63,72,74": 1399,
    "53,63,74,75": 1400,
    "53,63,75,77": 1401,
    "53,63,81,82": 1402,
    "53,63,84,86": 1403,
    "53,63,87": 1404,
    "53,64,67": 1405,
    "53,64,68,72": 1406,
    "53,64,72": 1407,
    "53,65": 1408,
    "53,65,67": 1409,
    "53,65,68": 1410,
    "53,65,69": 1411,
    "53,65,69,70": 1412,
    "53,65,69,72": 1413,
    "53,65,69,72,77": 1414,
    "53,65,69,77": 1415,
    "53,65,70": 1416,
    "53,65,72,81,84": 1417,
    "53,65,77": 1418,
    "53,67": 1419,
    "53,68": 1420,
    "53,68,72": 1421,
    "53,68,80": 1422,
    "53,69": 1423,
    "53,69,70": 1424,
    "53,69,71": 1425,
    "53,69,72": 1426,
    "53,69,72,74": 1427,
    "53,69,72,75": 1428,
    "53,69,74": 1429,
    "53,69,77": 1430,
    "53,70": 1431,
    "53,70,72": 1432,
    "53,70,74": 1433,
    "53,71": 1434,
    "53,71,72": 1435,
    "53,71,74": 1436,
    "53,72": 1437,
    "53,72,73": 1438,
    "53,72,74": 1439,
    "53,72,75": 1440,
    "53,72,77": 1441,
    "53,72,81": 1442,
    "53,73,74": 1443,
    "53,74": 1444,
    "53,74,76": 1445,
    "53,74,77": 1446,
    "53,74,82": 1447,
    "53,75": 1448,
    "53,75,77": 1449,
    "53,77": 1450,
    "53,77,79": 1451,
    "53,77,81": 1452,
    "53,79": 1453,
    "53,80": 1454,
    "53,80,82": 1455,
    "53,81": 1456,
    "53,81,83": 1457,
    "53,82": 1458,
    "53,82,84": 1459,
    "53,83,84": 1460,
    "53,84": 1461,
    "53,84,86": 1462,
    "54": 1463,
    "54,55": 1464,
    "54,55,59,60,62,63": 1465,
    "54,55,62,63,72": 1466,
    "54,55,62,69,71": 1467,
    "54,55,62,69,71,72": 1468,
    "54,55,62,72,74": 1469,
    "54,55,72,75": 1470,
    "54,55,74,86": 1471,
    "54,56,64,69,71": 1472,
    "54,56,68,72": 1473,
    "54,56,68,72,78": 1474,
    "54,56,74,77": 1475,
    "54,56,83": 1476,
    "54,57": 1477,
    "54,57,60,74": 1478,
    "54,57,60,86": 1479,
    "54,57,62": 1480,
    "54,57,62,69": 1481,
    "54,57,62,86": 1482,
    "54,57,69": 1483,
    "54,57,69,74": 1484,
    "54,57,72,74": 1485,
    "54,57,73,74": 1486,
    "54,57,74": 1487,
    "54,57,74,76": 1488,
    "54,57,74,86": 1489,
    "54,57,75": 1490,
    "54,57,78": 1491,
    "54,57,81": 1492,
    "54,58,76": 1493,
    "54,59,60,62,63": 1494,
    "54,59,64,69,74": 1495,
    "54,59,71,78": 1496,
    "54,59,85,86": 1497,
    "54,60": 1498,
    "54,60,63": 1499,
    "54,60,63,69": 1500,
    "54,60,63,80,81": 1501,
    "54,60,63,81": 1502,
    "54,60,69,81": 1503,
    "54,60,74": 1504,
    "54,61,69": 1505,
    "54,61,70": 1506,
    "54,61,76": 1507,
    "54,62": 1508,
    "54,62,69": 1509,
    "54,62,69,72": 1510,
    "54,62,69,74": 1511,
    "54,62,72": 1512,
    "54,62,74": 1513,
    "54,62,74,76": 1514,
    "54,62,81": 1515,
    "54,62,81,83": 1516,
    "54,63": 1517,
    "54,63,64,69": 1518,
    "54,63,72": 1519,
    "54,63,75": 1520,
    "54,63,75,77": 1521,
    "54,63,83,84": 1522,
    "54,64,69": 1523,
    "54,64,69,74": 1524,
    "54,64,71": 1525,
    "54,68,69": 1526,
    "54,69": 1527,
    "54,69,72": 1528,
    "54,69,74": 1529,
    "54,72,74": 1530,
    "54,72,74,75,77": 1531,
    "54,73,74": 1532,
    "54,73,78": 1533,
    "54,74": 1534,
    "54,74,76": 1535,
    "54,74,76,78": 1536,
    "54,75": 1537,
    "54,75,87": 1538,
    "54,76,78": 1539,
    "54,77,78": 1540,
    "54,78": 1541,
    "54,81": 1542,
    "54,81,83": 1543,
    "54,83": 1544,
    "55": 1545,
    "55,56": 1546,
    "55,56,61,70": 1547,
    "55,56,62,71": 1548,
    "55,56,63,65,72": 1549,
    "55,56,63,72": 1550,
    "55,56,65,75,82,83,84": 1551,
    "55,56,71,72,77": 1552,
    "55,56,74,75": 1553,
    "55,57": 1554,
    "55,57,58": 1555,
    "55,57,58,60,64,65": 1556,
    "55,57,62,71,72": 1557,
    "55,57,64,65,77": 1558,
    "55,57,69,77": 1559,
    "55,57,70,72": 1560,
    "55,57,71,72": 1561,
    "55,57,71,74,77": 1562,
    "55,57,72,79": 1563,
    "55,57,73,74": 1564,
    "55,57,76,77": 1565,
    "55,57,77": 1566,
    "55,57,83": 1567,
    "55,58": 1568,
    "55,58,59,61,62": 1569,
    "55,58,60": 1570,
    "55,58,60,64": 1571,
    "55,58,61,63,77": 1572,
    "55,58,62,67,70": 1573,
    "55,58,63": 1574,
    "55,58,63,70": 1575,
    "55,58,64": 1576,
    "55,58,67": 1577,
    "55,58,67,70": 1578,
    "55,58,69,70": 1579,
    "55,58,70": 1580,
    "55,58,70,72": 1581,
    "55,58,70,72,76": 1582,
    "55,58,70,74,75,77": 1583,
    "55,58,70,75,77": 1584,
    "55,58,72": 1585,
    "55,58,73": 1586,
    "55,58,74": 1587,
    "55,58,74,75": 1588,
    "55,58,75": 1589,
    "55,58,76": 1590,
    "55,58,76,79": 1591,
    "55,58,77,79": 1592,
    "55,58,82": 1593,
    "55,58,85": 1594,
    "55,58,86": 1595,
    "55,59": 1596,
    "55,59,60,66,67,69": 1597,
    "55,59,60,67,72,74": 1598,
    "55,59,60,74,76": 1599,
    "55,59,62": 1600,
    "55,59,62,63,67": 1601,
    "55,59,62,64,79": 1602,
    "55,59,62,65,67,71,74": 1603,
    "55,59,62,65,74": 1604,
    "55,59,62,65,74,77": 1605,
    "55,59,62,67": 1606,
    "55,59,62,71": 1607,
    "55,59,62,71,74": 1608,
    "55,59,62,77,79": 1609,
    "55,59,62,79": 1610,
    "55,59,64,76": 1611,
    "55,59,65": 1612,
    "55,59,65,67,69": 1613,
    "55,59,65,74": 1614,
    "55,59,65,79,81": 1615,
    "55,59,66,67": 1616,
    "55,59,67": 1617,
    "55,59,67,69": 1618,
    "55,59,67,71": 1619,
    "55,59,67,79": 1620,
    "55,59,71": 1621,
    "55,59,71,74": 1622,
    "55,59,72,74": 1623,
    "55,59,73,74": 1624,
    "55,59,74": 1625,
    "55,59,74,76": 1626,
    "55,59,74,77": 1627,
    "55,59,74,86": 1628,
    "55,59,75,76": 1629,
    "55,59,76": 1630,
    "55,59,76,78": 1631,
    "55,59,76,79": 1632,
    "55,59,77": 1633,
    "55,59,77,79": 1634,
    "55,59,79": 1635,
    "55,59,84,86": 1636,
    "55,59,86": 1637,
    "55,60": 1638,
    "55,60,62,64,65,71,72": 1639,
    "55,60,62,64,65,71,72,74": 1640,
    "55,60,62,64,65,72,77": 1641,
    "55,60,62,64,71,72": 1642,
    "55,60,62,66,69": 1643,
    "55,60,62,76,77": 1644,
    "55,60,63": 1645,
    "55,60,64,65,67,72": 1646,
    "55,60,64,65,71,72,74": 1647,
    "55,60,64,65,72,74": 1648,
    "55,60,64,72": 1649,
    "55,60,64,72,76,79": 1650,
    "55,60,64,76,79": 1651,
    "55,60,64,77,79": 1652,
    "55,60,64,79": 1653,
    "55,60,64,79,81": 1654,
    "55,60,66,69": 1655,
    "55,60,67": 1656,
    "55,60,67,69": 1657,
    "55,60,67,72": 1658,
    "55,60,69": 1659,
    "55,60,69,70": 1660,
    "55,60,70": 1661,
    "55,60,70,72": 1662,
    "55,60,71,72,83,84": 1663,
    "55,60,71,74": 1664,
    "55,60,72": 1665,
    "55,60,72,75": 1666,
    "55,60,72,76": 1667,
    "55,60,72,76,77": 1668,
    "55,60,72,79": 1669,
    "55,60,74,77": 1670,
    "55,60,75,76": 1671,
    "55,60,75,79": 1672,
    "55,60,76": 1673,
    "55,60,76,77": 1674,
    "55,60,76,77,79": 1675,
    "55,60,77,79": 1676,
    "55,60,79": 1677,
    "55,60,79,81": 1678,
    "55,60,79,82": 1679,
    "55,60,82": 1680,
    "55,60,84": 1681,
    "55,60,86": 1682,
    "55,61,62,76,77,79": 1683,
    "55,61,62,77,79": 1684,
    "55,61,67,73,76,82": 1685,
    "55,61,73,74": 1686,
    "55,61,76,78": 1687,
    "55,61,82": 1688,
    "55,62": 1689,
    "55,62,63,65,67": 1690,
    "55,62,64,65,76": 1691,
    "55,62,64,71,72": 1692,
    "55,62,64,77,79": 1693,
    "55,62,65": 1694,
    "55,62,65,69,71,72": 1695,
    "55,62,65,71": 1696,
    "55,62,65,71,72": 1697,
    "55,62,65,71,74": 1698,
    "55,62,65,71,74,77": 1699,
    "55,62,65,71,79": 1700,
    "55,62,65,72": 1701,
    "55,62,65,72,74": 1702,
    "55,62,65,74,76": 1703,
    "55,62,65,74,77": 1704,
    "55,62,65,79": 1705,
    "55,62,65,81": 1706,
    "55,62,66,67": 1707,
    "55,62,66,67,69": 1708,
    "55,62,67": 1709,
    "55,62,67,69": 1710,
    "55,62,67,71": 1711,
    "55,62,67,74": 1712,
    "55,62,69,71": 1713,
    "55,62,69,71,72": 1714,
    "55,62,70": 1715,
    "55,62,71": 1716,
    "55,62,71,72": 1717,
    "55,62,71,72,74": 1718,
    "55,62,71,74": 1719,
    "55,62,71,77": 1720,
    "55,62,72": 1721,
    "55,62,72,74": 1722,
    "55,62,73,74": 1723,
    "55,62,74": 1724,
    "55,62,74,76": 1725,
    "55,62,76,78": 1726,
    "55,62,77": 1727,
    "55,62,77,79": 1728,
    "55,62,79": 1729,
    "55,62,81": 1730,
    "55,62,84": 1731,
    "55,63": 1732,
    "55,63,67": 1733,
    "55,63,70": 1734,
    "55,63,70,72": 1735,
    "55,63,71": 1736,
    "55,63,72": 1737,
    "55,63,73": 1738,
    "55,63,73,75": 1739,
    "55,63,75": 1740,
    "55,63,75,77": 1741,
    "55,63,79": 1742,
    "55,64": 1743,
    "55,64,67": 1744,
    "55,64,67,72": 1745,
    "55,64,67,76": 1746,
    "55,64,72": 1747,
    "55,64,72,74": 1748,
    "55,64,74,76": 1749,
    "55,64,76": 1750,
    "55,64,76,77": 1751,
    "55,64,76,78": 1752,
    "55,64,77": 1753,
    "55,64,78,79": 1754,
    "55,64,78,79,81": 1755,
    "55,64,79": 1756,
    "55,64,79,81": 1757,
    "55,64,83,84": 1758,
    "55,64,84,86": 1759,
    "55,65": 1760,
    "55,65,67": 1761,
    "55,65,70": 1762,
    "55,65,70,72": 1763,
    "55,65,71": 1764,
    "55,65,71,74": 1765,
    "55,65,72": 1766,
    "55,65,74": 1767,
    "55,65,74,75": 1768,
    "55,65,74,76": 1769,
    "55,65,80": 1770,
    "55,65,83": 1771,
    "55,65,84": 1772,
    "55,65,86": 1773,
    "55,65,87": 1774,
    "55,65,89": 1775,
    "55,67": 1776,
    "55,67,69": 1777,
    "55,67,70": 1778,
    "55,67,71": 1779,
    "55,67,71,72": 1780,
    "55,67,71,72,74": 1781,
    "55,67,71,72,74,76": 1782,
    "55,67,71,74": 1783,
    "55,67,72": 1784,
    "55,67,72,74,76": 1785,
    "55,67,72,76": 1786,
    "55,67,73": 1787,
    "55,67,74": 1788,
    "55,67,74,75": 1789,
    "55,67,75": 1790,
    "55,67,77": 1791,
    "55,67,79": 1792,
    "55,67,83": 1793,
    "55,69,71": 1794,
    "55,69,71,72": 1795,
    "55,69,71,72,74": 1796,
    "55,70": 1797,
    "55,70,72": 1798,
    "55,70,74": 1799,
    "55,70,74,79": 1800,
    "55,70,75": 1801,
    "55,71": 1802,
    "55,71,72": 1803,
    "55,71,72,74,75": 1804,
    "55,71,74": 1805,
    "55,71,74,76": 1806,
    "55,71,74,79": 1807,
    "55,72": 1808,
    "55,72,75": 1809,
    "55,72,76": 1810,
    "55,74,76": 1811,
    "55,74,86": 1812,
    "55,75": 1813,
    "55,75,82": 1814,
    "55,76": 1815,
    "55,76,77": 1816,
    "55,76,79": 1817,
    "55,77": 1818,
    "55,77,79": 1819,
    "55,79": 1820,
    "55,79,80": 1821,
    "55,79,81": 1822,
    "55,79,82": 1823,
    "55,81,82": 1824,
    "55,82": 1825,
    "55,84": 1826,
    "55,86": 1827,
    "56": 1828,
    "56,57": 1829,
    "56,57,60,62,64,65": 1830,
    "56,57,61,62,64,65": 1831,
    "56,57,61,69": 1832,
    "56,57,62,63": 1833,
    "56,57,64,71,73": 1834,
    "56,57,73,74": 1835,
    "56,58": 1836,
    "56,58,65,67,75,77": 1837,
    "56,58,72,73,77": 1838,
    "56,59,62,65": 1839,
    "56,59,64,71,74": 1840,
    "56,59,64,80,81,83": 1841,
    "56,59,74,76": 1842,
    "56,59,80,81": 1843,
    "56,59,80,83": 1844,
    "56,59,81,83": 1845,
    "56,59,83": 1846,
    "56,60": 1847,
    "56,60,63": 1848,
    "56,60,63,79,80": 1849,
    "56,60,63,80": 1850,
    "56,60,65": 1851,
    "56,60,67": 1852,
    "56,60,67,68": 1853,
    "56,60,68": 1854,
    "56,60,68,72": 1855,
    "56,60,68,72,77": 1856,
    "56,60,70,71": 1857,
    "56,60,72": 1858,
    "56,60,72,74": 1859,
    "56,60,74": 1860,
    "56,60,75": 1861,
    "56,60,75,79": 1862,
    "56,60,77": 1863,
    "56,60,79,80": 1864,
    "56,60,80": 1865,
    "56,60,83": 1866,
    "56,60,83,84": 1867,
    "56,60,84": 1868,
    "56,61,64,71,76": 1869,
    "56,61,70": 1870,
    "56,61,84,85": 1871,
    "56,61,85,86": 1872,
    "56,62": 1873,
    "56,62,65": 1874,
    "56,62,71,72": 1875,
    "56,62,74,76": 1876,
    "56,62,76": 1877,
    "56,62,83": 1878,
    "56,63,64,71": 1879,
    "56,63,65": 1880,
    "56,63,68": 1881,
    "56,63,71,72": 1882,
    "56,63,72": 1883,
    "56,63,72,74": 1884,
    "56,63,74,75": 1885,
    "56,63,75": 1886,
    "56,63,75,77": 1887,
    "56,63,79": 1888,
    "56,64,70,71": 1889,
    "56,64,71": 1890,
    "56,64,71,73": 1891,
    "56,64,71,73,74": 1892,
    "56,64,71,76": 1893,
    "56,64,73": 1894,
    "56,64,74,76": 1895,
    "56,64,76": 1896,
    "56,65,68": 1897,
    "56,65,71": 1898,
    "56,65,72": 1899,
    "56,65,74": 1900,
    "56,65,77,80,84": 1901,
    "56,65,82": 1902,
    "56,67,75": 1903,
    "56,68,72": 1904,
    "56,70,72": 1905,
    "56,71": 1906,
    "56,72": 1907,
    "56,72,75": 1908,
    "56,74": 1909,
    "56,74,75,77,79": 1910,
    "56,74,76": 1911,
    "56,75": 1912,
    "56,76": 1913,
    "56,76,78": 1914,
    "56,77": 1915,
    "56,77,78": 1916,
    "56,79": 1917,
    "56,83": 1918,
    "56,84": 1919,
    "57": 1920,
    "57,58": 1921,
    "57,58,60,64,65,67,76,77": 1922,
    "57,58,60,65": 1923,
    "57,58,65,66,75": 1924,
    "57,58,65,67,77": 1925,
    "57,58,65,73,75": 1926,
    "57,58,67,76": 1927,
    "57,58,69,75,77": 1928,
    "57,58,70": 1929,
    "57,58,74,86": 1930,
    "57,58,76,77": 1931,
    "57,58,77,86": 1932,
    "57,58,77,87": 1933,
    "57,59": 1934,
    "57,59,60,75,76": 1935,
    "57,59,61,62,64,76,78": 1936,
    "57,59,62,68": 1937,
    "57,59,62,72,74": 1938,
    "57,59,62,77": 1939,
    "57,59,64,73,74": 1940,
    "57,59,68,69,74,78": 1941,
    "57,59,71": 1942,
    "57,59,76": 1943,
    "57,59,83": 1944,
    "57,60": 1945,
    "57,60,62": 1946,
    "57,60,62,66": 1947,
    "57,60,62,74": 1948,
    "57,60,62,78": 1949,
    "57,60,63": 1950,
    "57,60,63,66": 1951,
    "57,60,63,67": 1952,
    "57,60,63,78": 1953,
    "57,60,64": 1954,
    "57,60,65": 1955,
    "57,60,65,67,76,77,79": 1956,
    "57,60,65,67,77,79": 1957,
    "57,60,65,69": 1958,
    "57,60,65,75": 1959,
    "57,60,65,75,77": 1960,
    "57,60,65,77": 1961,
    "57,60,65,77,79": 1962,
    "57,60,65,79": 1963,
    "57,60,66,67,69": 1964,
    "57,60,68,69": 1965,
    "57,60,69": 1966,
    "57,60,69,72": 1967,
    "57,60,69,81": 1968,
    "57,60,71": 1969,
    "57,60,71,72": 1970,
    "57,60,72": 1971,
    "57,60,72,74": 1972,
    "57,60,72,75": 1973,
    "57,60,72,76": 1974,
    "57,60,72,77": 1975,
    "57,60,74": 1976,
    "57,60,75": 1977,
    "57,60,75,77": 1978,
    "57,60,76": 1979,
    "57,60,76,77": 1980,
    "57,60,77": 1981,
    "57,60,77,79": 1982,
    "57,60,78": 1983,
    "57,60,78,79": 1984,
    "57,60,79,81": 1985,
    "57,60,81": 1986,
    "57,60,81,83,84": 1987,
    "57,60,82,84": 1988,
    "57,60,83,84": 1989,
    "57,60,84": 1990,
    "57,60,84,86": 1991,
    "57,60,86": 1992,
    "57,61": 1993,
    "57,61,62,64,68,69,71": 1994,
    "57,61,62,64,68,69,72,73": 1995,
    "57,61,62,79": 1996,
    "57,61,64": 1997,
    "57,61,64,68,69": 1998,
    "57,61,64,69": 1999,
    "57,61,64,69,73": 2000,
    "57,61,64,69,73,76": 2001,
    "57,61,64,73": 2002,
    "57,61,64,73,76": 2003,
    "57,61,64,76": 2004,
    "57,61,64,76,78": 2005,
    "57,61,64,80,81": 2006,
    "57,61,64,81": 2007,
    "57,61,64,85": 2008,
    "57,61,68,69": 2009,
    "57,61,69": 2010,
    "57,61,69,73": 2011,
    "57,61,69,78": 2012,
    "57,61,69,80,81": 2013,
    "57,61,69,81": 2014,
    "57,61,73": 2015,
    "57,61,73,76": 2016,
    "57,61,75,76": 2017,
    "57,61,76": 2018,
    "57,61,76,78": 2019,
    "57,61,77,78": 2020,
    "57,61,78,80": 2021,
    "57,61,78,81": 2022,
    "57,61,79": 2023,
    "57,61,79,81": 2024,
    "57,61,80,81": 2025,
    "57,61,81": 2026,
    "57,61,81,83": 2027,
    "57,61,88": 2028,
    "57,62": 2029,
    "57,62,64,66,67,73,74": 2030,
    "57,62,64,66,67,74,83": 2031,
    "57,62,64,68,71": 2032,
    "57,62,64,68,71,72": 2033,
    "57,62,65,74": 2034,
    "57,62,65,74,77": 2035,
    "57,62,65,76,77": 2036,
    "57,62,65,77": 2037,
    "57,62,65,77,81": 2038,
    "57,62,66": 2039,
    "57,62,66,69": 2040,
    "57,62,66,80,81,83": 2041,
    "57,62,66,81": 2042,
    "57,62,66,81,83": 2043,
    "57,62,68,71": 2044,
    "57,62,69": 2045,
    "57,62,69,70": 2046,
    "57,62,69,72": 2047,
    "57,62,69,74": 2048,
    "57,62,70,71": 2049,
    "57,62,71": 2050,
    "57,62,72": 2051,
    "57,62,72,74": 2052,
    "57,62,74": 2053,
    "57,62,74,77": 2054,
    "57,62,76,77": 2055,
    "57,62,77": 2056,
    "57,62,77,79": 2057,
    "57,62,77,81": 2058,
    "57,62,78": 2059,
    "57,62,78,79": 2060,
    "57,62,79,81": 2061,
    "57,62,81": 2062,
    "57,62,81,82": 2063,
    "57,63,64,73": 2064,
    "57,63,65": 2065,
    "57,63,65,74,75": 2066,
    "57,63,70,72": 2067,
    "57,63,72,74": 2068,
    "57,63,78": 2069,
    "57,63,81": 2070,
    "57,63,81,84": 2071,
    "57,63,83": 2072,
    "57,63,84": 2073,
    "57,64,65,80,81": 2074,
    "57,64,67,73,74": 2075,
    "57,64,67,73,76": 2076,
    "57,64,67,74": 2077,
    "57,64,67,79": 2078,
    "57,64,69,71": 2079,
    "57,64,69,72": 2080,
    "57,64,71": 2081,
    "57,64,71,72": 2082,
    "57,64,71,72,83,84": 2083,
    "57,64,71,73": 2084,
    "57,64,72": 2085,
    "57,64,72,73": 2086,
    "57,64,72,74": 2087,
    "57,64,72,74,84,86": 2088,
    "57,64,72,76": 2089,
    "57,64,73": 2090,
    "57,64,73,74": 2091,
    "57,64,73,74,76": 2092,
    "57,64,73,81": 2093,
    "57,64,74,76": 2094,
