{
  "token_to_id": {
    "29,41": 1,
    "29,41,77": 2,
    "30,42": 3,
    "31,43": 4,
    "31,43,67": 5,
    "31,43,74": 6,
    "31,67": 7,
    "32,44,56": 8,
    "32,44,60,63,68": 9,
    "33,45,61,62": 10,
    "33,45,72,84": 11,
    "33,56": 12,
    "33,61": 13,
    "34,46": 14,
    "34,46,58,62": 15,
    "34,46,74": 16,
    "34,46,74,77": 17,
    "34,89": 18,
    "36": 19,
    "36,40,43,48,52,55,60": 20,
    "36,48": 21,
    "36,48,64,67,72": 22,
    "36,48,65,69": 23,
    "36,48,67,70": 24,
    "36,48,67,72,76": 25,
    "36,48,72": 26,
    "36,48,76": 27,
    "36,48,76,88": 28,
    "36,48,77,79": 29,
    "36,64,67,72": 30,
    "36,72": 31,
    "38": 32,
    "38,42,45,50,86": 33,
    "38,50": 34,
    "38,50,54,62": 35,
    "38,50,58,62,67,79": 36,
    "38,50,62": 37,
    "38,50,62,66": 38,
    "38,50,65": 39,
    "38,50,66": 40,
    "38,50,66,69": 41,
    "38,50,66,74": 42,
    "38,50,69": 43,
    "38,50,74": 44,
    "38,62": 45,
    "38,62,64": 46,
    "38,66": 47,
    "38,70,71": 48,
    "38,74": 49,
    "38,74,78": 50,
    "39": 51,
    "39,43": 52,
    "39,51": 53,
    "39,51,61": 54,
    "39,68": 55,
    "39,75": 56,
    "39,75,77": 57,
    "39,80": 58,
    "40": 59,
    "40,41,52,53,69,79": 60,
    "40,52": 61,
    "40,52,64": 62,
    "40,52,67": 63,
    "40,52,67,79": 64,
    "40,52,68,71": 65,
    "40,52,69,72": 66,
    "40,52,71,74": 67,
    "40,52,79": 68,
    "40,52,82": 69,
    "41": 70,
    "41,43,53,55,70,72": 71,
    "41,43,53,55,72,74": 72,
    "41,45,48,53,57,60,65": 73,
    "41,45,53,57,77": 74,
    "41,53,62": 75,
    "41,53,65,69,72,77": 76,
    "41,53,69": 77,
    "41,53,69,72": 78,
    "41,53,69,79": 79,
    "41,53,74": 80,
    "41,53,74,77": 81,
    "41,53,76": 82,
    "41,53,76,77": 83,
    "41,53,77": 84,
    "41,53,77,79": 85,
    "41,53,79": 86,
    "41,65": 87,
    "41,65,69": 88,
    "41,69": 89,
    "41,77": 90,
    "41,84": 91,
    "42,45,54,57": 92,
    "42,54,72,74": 93,
    "42,54,74": 94,
    "42,66": 95,
    "43": 96,
    "43,45,55,57,72,74": 97,
    "43,47,50,55,59,62,67": 98,
    "43,47,50,62": 99,
    "43,47,55,62,65": 100,
    "43,48,52,60": 101,
    "43,48,71,72": 102,
    "43,48,72": 103,
    "43,50,59": 104,
    "43,50,79": 105,
    "43,55": 106,
    "43,55,64,67": 107,
    "43,55,67": 108,
    "43,55,67,71,74,76": 109,
    "43,55,70": 110,
    "43,55,70,74": 111,
    "43,55,70,79": 112,
    "43,55,71": 113,
    "43,55,71,72": 114,
    "43,55,71,74": 115,
    "43,55,71,74,79": 116,
    "43,55,72": 117,
    "43,55,72,75": 118,
    "43,55,74": 119,
    "43,55,74,82": 120,
    "43,62,71": 121,
    "43,63,64": 122,
    "43,67": 123,
    "43,69,70": 124,
    "43,70": 125,
    "43,71": 126,
    "43,71,72": 127,
    "43,71,74": 128,
    "43,72": 129,
    "43,72,75": 130,
    "43,79": 131,
    "44": 132,
    "44,46,75,77,79,80": 133,
    "44,46,77,79,80,82": 134,
    "44,48": 135,
    "44,51,68": 136,
    "44,56": 137,
    "44,56,60,68": 138,
    "44,56,65": 139,
    "44,56,68": 140,
    "44,56,72,73": 141,
    "44,60": 142,
    "44,65": 143,
    "44,68": 144,
    "44,72": 145,
    "44,73": 146,
    "44,75": 147,
    "44,77,79,80,82": 148,
    "44,79,80,82,84": 149,
    "44,79,82": 150,
    "45": 151,
    "45,46,57,58,74,84": 152,
    "45,46,57,58,77": 153,
    "45,48,54,57,62,66,69,72": 154,
    "45,48,57,60,77,82": 155,
    "45,49,52,55,64": 156,
    "45,49,52,57,65": 157,
    "45,49,52,57,76": 158,
    "45,49,52,57,85": 159,
    "45,49,52,58,61,64,67": 160,
    "45,50,74,76": 161,
    "45,52,55": 162,
    "45,52,61": 163,
    "45,53,57,65,72,74": 164,
    "45,54,62": 165,
    "45,57": 166,
    "45,57,59,61": 167,
    "45,57,61,69": 168,
    "45,57,65": 169,
    "45,57,65,72": 170,
    "45,57,67": 171,
    "45,57,71,72": 172,
    "45,57,72": 173,
    "45,57,72,74": 174,
    "45,57,72,76": 175,
    "45,57,72,84": 176,
    "45,57,73,81": 177,
    "45,57,74": 178,
    "45,57,74,76": 179,
    "45,57,76": 180,
    "45,57,76,77": 181,
    "45,57,77": 182,
    "45,57,84": 183,
    "45,59": 184,
    "45,61,64": 185,
    "45,62": 186,
    "45,73,76": 187,
    "45,74": 188,
    "45,74,76": 189,
    "45,76,77": 190,
    "46": 191,
    "46,48,77,80": 192,
    "46,50,53,56": 193,
    "46,50,56,77": 194,
    "46,53,62": 195,
    "46,53,74": 196,
    "46,55,63": 197,
    "46,58,67,69": 198,
    "46,58,70,72": 199,
    "46,58,70,74": 200,
    "46,58,72,74": 201,
    "46,58,73": 202,
    "46,58,74": 203,
    "46,58,74,76": 204,
    "46,58,74,84": 205,
    "46,58,76,77": 206,
    "46,58,79,81": 207,
    "46,58,79,82": 208,
    "46,58,81": 209,
    "46,58,81,82": 210,
    "46,58,82": 211,
    "46,58,82,84": 212,
    "46,58,84": 213,
    "46,58,86": 214,
    "46,62": 215,
    "46,63": 216,
    "46,63,74,75,77": 217,
    "46,74,75,77,79": 218,
    "46,74,77": 219,
    "46,75,79": 220,
    "47": 221,
    "47,48,67,71": 222,
    "47,50,55": 223,
    "47,50,86": 224,
    "47,55,69,71": 225,
    "47,55,86": 226,
    "47,57": 227,
    "47,57,59,72,74": 228,
    "47,59": 229,
    "47,59,74": 230,
    "47,59,74,76": 231,
    "47,59,76,78": 232,
    "47,59,78,79": 233,
    "47,60": 234,
    "47,67": 235,
    "47,67,69": 236,
    "47,69": 237,
    "47,86": 238,
    "48": 239,
    "48,49,60,61": 240,
    "48,50,51,53,67": 241,
    "48,50,59,60,67,69": 242,
    "48,50,67,69": 243,
    "48,50,74,75,77,79": 244,
    "48,50,77,80": 245,
    "48,51": 246,
    "48,51,56": 247,
    "48,51,75,79": 248,
    "48,52,55,60,64,67,72": 249,
    "48,52,55,60,67": 250,
    "48,52,55,60,79": 251,
    "48,52,55,70": 252,
    "48,52,55,74,76": 253,
    "48,52,60": 254,
    "48,52,67": 255,
    "48,53,59": 256,
    "48,53,60,65,76,77": 257,
    "48,53,69": 258,
    "48,53,77": 259,
    "48,53,77,79": 260,
    "48,55,64,65": 261,
    "48,55,76,77": 262,
    "48,56,60,68": 263,
    "48,56,75": 264,
    "48,57,58,65": 265,
    "48,57,65": 266,
    "48,57,77": 267,
    "48,58,64,67": 268,
    "48,58,65,69": 269,
    "48,59": 270,
    "48,60": 271,
    "48,60,64,67,72": 272,
    "48,60,69": 273,
    "48,60,69,71": 274,
    "48,60,71,72": 275,
    "48,60,72": 276,
    "48,60,72,74": 277,
    "48,60,74,76": 278,
    "48,60,76": 279,
    "48,60,76,77": 280,
    "48,60,76,79": 281,
    "48,60,76,84": 282,
    "48,60,77,79": 283,
    "48,60,79,81": 284,
    "48,60,79,82": 285,
    "48,60,82": 286,
    "48,63": 287,
    "48,63,75,79": 288,
    "48,64": 289,
    "48,64,67,72": 290,
    "48,67": 291,
    "48,69": 292,
    "48,69,71": 293,
    "48,69,76": 294,
    "48,71": 295,
    "48,72": 296,
    "48,74,76": 297,
    "48,76": 298,
    "48,77": 299,
    "48,79": 300,
    "48,79,81": 301,
    "48,80": 302,
    "49,50,67": 303,
    "49,51,61,63": 304,
    "49,52,55": 305,
    "49,57,69": 306,
    "49,61,70,73": 307,
    "49,61,73": 308,
    "49,61,73,77": 309,
    "49,64,67": 310,
    "49,65": 311,
    "49,67": 312,
    "49,68": 313,
    "49,70": 314,
    "49,70,72": 315,
    "49,79": 316,
    "50": 317,
    "50,51": 318,
    "50,51,53,55,67": 319,
    "50,51,74,77": 320,
    "50,51,75,77,79,80": 321,
    "50,52,53,55,61,62,81,89": 322,
    "50,52,54,55,74": 323,
    "50,52,55": 324,
    "50,53": 325,
    "50,53,55,62,84,86": 326,
    "50,53,58": 327,
    "50,53,58,62": 328,
    "50,53,62,65": 329,
    "50,53,62,85,86": 330,
    "50,53,62,86,89": 331,
    "50,53,62,89": 332,
    "50,53,67": 333,
    "50,53,69": 334,
    "50,53,69,77": 335,
    "50,54": 336,
    "50,54,62": 337,
    "50,54,62,66": 338,
    "50,54,69": 339,
    "50,54,74": 340,
    "50,54,74,86": 341,
    "50,54,81": 342,
    "50,55": 343,
    "50,55,57,71,72": 344,
    "50,55,62,67,71": 345,
    "50,55,67": 346,
    "50,55,67,69": 347,
    "50,55,71,72": 348,
    "50,55,72": 349,
    "50,55,79": 350,
    "50,55,86": 351,
    "50,57,59,66,67": 352,
    "50,57,59,72,74": 353,
    "50,57,66": 354,
    "50,57,66,67": 355,
    "50,57,71,72": 356,
    "50,57,72,74": 357,
    "50,59,67": 358,
    "50,60": 359,
    "50,60,62": 360,
    "50,60,62,66": 361,
    "50,60,66": 362,
    "50,62": 363,
    "50,62,64": 364,
    "50,62,66": 365,
    "50,62,66,67,69,71": 366,
    "50,62,66,74": 367,
    "50,62,69,71": 368,
    "50,62,74": 369,
    "50,62,76": 370,
    "50,62,76,77": 371,
    "50,62,77,81": 372,
    "50,62,78": 373,
    "50,62,78,79": 374,
    "50,62,79,81": 375,
    "50,64": 376,
    "50,65": 377,
    "50,65,77": 378,
    "50,66": 379,
    "50,66,67": 380,
    "50,67": 381,
    "50,67,69": 382,
    "50,67,71": 383,
    "50,69": 384,
    "50,69,71": 385,
    "50,69,78": 386,
    "50,70,71": 387,
    "50,71": 388,
    "50,71,72,74": 389,
    "50,71,73": 390,
    "50,71,74": 391,
    "50,71,74,79": 392,
    "50,72": 393,
    "50,73,76": 394,
    "50,74": 395,
    "50,77": 396,
    "50,78": 397,
    "50,78,79": 398,
    "50,78,81": 399,
    "50,79": 400,
    "50,84": 401,
    "51": 402,
    "51,52": 403,
    "51,53": 404,
    "51,53,63,65": 405,
    "51,53,74,77": 406,
    "51,53,75,79": 407,
    "51,54,57": 408,
    "51,55": 409,
    "51,55,58": 410,
    "51,55,61": 411,
    "51,55,67": 412,
    "51,55,70": 413,
    "51,55,70,75": 414,
    "51,55,73": 415,
    "51,55,75": 416,
    "51,55,80,82": 417,
    "51,56,58,67,68": 418,
    "51,56,68": 419,
    "51,56,68,70": 420,
    "51,56,72": 421,
    "51,56,72,73": 422,
    "51,56,72,75": 423,
    "51,56,72,87": 424,
    "51,56,75": 425,
    "51,57,60": 426,
    "51,57,62": 427,
    "51,58,61,67": 428,
    "51,58,67": 429,
    "51,58,67,68": 430,
    "51,58,73": 431,
    "51,58,73,75": 432,
    "51,58,75": 433,
    "51,60,68": 434,
    "51,60,75": 435,
    "51,60,75,79": 436,
    "51,61,67": 437,
    "51,62,68,72": 438,
    "51,63": 439,
    "51,63,67": 440,
    "51,63,67,70": 441,
    "51,63,70": 442,
    "51,67": 443,
    "51,67,70": 444,
    "51,67,75": 445,
    "51,68": 446,
    "51,70": 447,
    "51,72": 448,
    "51,72,75": 449,
    "51,73,75": 450,
    "51,75": 451,
    "51,77,79": 452,
    "51,79": 453,
    "51,80": 454,
    "51,87": 455,
    "52": 456,
    "52,53,55,57,61,62,81,88": 457,
    "52,53,64,65,79,81": 458,
    "52,53,76,81": 459,
    "52,54": 460,
    "52,54,55,57,74": 461,
    "52,54,57": 462,
    "52,55": 463,
    "52,55,58,60,64,67,70": 464,
    "52,55,58,61": 465,
    "52,55,58,61,70": 466,
    "52,55,61": 467,
    "52,55,61,81,88": 468,
    "52,55,61,88": 469,
    "52,55,61,88,89": 470,
    "52,55,70": 471,
    "52,55,72": 472,
    "52,55,74": 473,
    "52,55,76": 474,
    "52,55,79": 475,
    "52,55,79,81": 476,
    "52,55,79,84": 477,
    "52,57,72": 478,
    "52,58,60": 479,
    "52,58,62": 480,
    "52,59": 481,
    "52,59,62": 482,
    "52,59,67,72": 483,
    "52,60": 484,
    "52,60,70,79": 485,
    "52,60,70,82": 486,
    "52,60,72,79": 487,
    "52,60,79": 488,
    "52,60,82": 489,
    "52,60,84": 490,
    "52,61,69,73,76,79": 491,
    "52,62": 492,
    "52,62,64": 493,
    "52,63,64": 494,
    "52,64": 495,
    "52,64,72,79": 496,
    "52,64,76": 497,
    "52,64,76,86": 498,
    "52,64,79": 499,
    "52,64,79,81": 500,
    "52,64,81,83": 501,
    "52,64,83,84": 502,
    "52,64,84": 503,
    "52,65": 504,
    "52,67": 505,
    "52,67,69": 506,
    "52,67,76": 507,
    "52,69": 508,
    "52,72": 509,
    "52,76,79": 510,
    "52,79": 511,
    "52,81": 512,
    "52,84": 513,
    "53": 514,
    "53,55": 515,
    "53,55,57,58,62,82,86": 516,
    "53,55,62,69,70,77": 517,
    "53,55,64,65,73,74,82": 518,
    "53,55,65,67": 519,
    "53,55,72,74": 520,
    "53,55,74,75,77": 521,
    "53,55,75,79": 522,
    "53,56,58,74": 523,
    "53,57": 524,
    "53,57,60,72": 525,
    "53,57,60,76,77": 526,
    "53,57,60,77": 527,
    "53,57,62": 528,
    "53,57,62,81,86": 529,
    "53,57,62,86": 530,
    "53,57,62,86,88": 531,
    "53,57,65,69": 532,
    "53,57,69": 533,
    "53,57,72": 534,
    "53,57,74": 535,
    "53,57,81": 536,
    "53,57,84": 537,
    "53,58,64": 538,
    "53,60,69": 539,
    "53,60,69,70": 540,
    "53,60,70,72": 541,
    "53,60,72,74": 542,
    "53,60,80": 543,
    "53,60,80,81": 544,
    "53,60,81": 545,
    "53,60,81,82": 546,
    "53,60,84": 547,
    "53,62,67,68": 548,
    "53,62,68": 549,
    "53,62,70": 550,
    "53,64": 551,
    "53,65": 552,
    "53,65,69": 553,
    "53,65,69,72,77": 554,
    "53,65,72": 555,
    "53,65,72,81": 556,
    "53,65,74": 557,
    "53,65,74,81,82": 558,
    "53,65,74,82": 559,
    "53,65,77": 560,
    "53,65,77,81": 561,
    "53,65,81": 562,
    "53,69": 563,
    "53,69,70": 564,
    "53,69,74": 565,
    "53,70": 566,
    "53,70,72": 567,
    "53,72": 568,
    "53,72,77,81": 569,
    "53,74": 570,
    "53,74,76": 571,
    "53,76,77": 572,
    "53,77": 573,
    "53,77,79,81,82": 574,
    "53,77,81": 575,
    "53,80": 576,
    "54,55,57,59,74": 577,
    "54,55,57,62,69,71,72": 578,
    "54,55,59,62,67,69": 579,
    "54,55,60,69": 580,
    "54,55,61": 581,
    "54,55,62,69,71": 582,
    "54,55,62,70,71": 583,
    "54,55,62,71": 584,
    "54,55,72": 585,
    "54,55,72,76": 586,
    "54,55,74": 587,
    "54,55,81,83": 588,
    "54,57": 589,
    "54,57,60,63,72,75,78,81": 590,
    "54,57,66,69": 591,
    "54,57,72": 592,
    "54,57,72,76": 593,
    "54,57,74": 594,
    "54,57,79,81": 595,
    "54,57,84": 596,
    "54,60": 597,
    "54,60,63": 598,
    "54,60,63,69": 599,
    "54,62": 600,
    "54,62,64": 601,
    "54,62,69": 602,
    "54,62,69,71": 603,
    "54,62,69,74": 604,
    "54,62,72": 605,
    "54,62,74": 606,
    "54,62,81": 607,
    "54,62,81,83": 608,
    "54,69": 609,
    "54,72": 610,
    "54,74": 611,
    "54,74,76": 612,
    "54,74,81": 613,
    "54,79,82": 614,
    "54,81": 615,
    "54,81,83": 616,
    "54,81,84": 617,
    "54,84": 618,
    "55": 619,
    "55,56,67,68": 620,
    "55,56,70,72": 621,
    "55,56,75": 622,
    "55,56,75,79": 623,
    "55,57": 624,
    "55,57,58,60,79,89": 625,
    "55,57,59,60,67": 626,
    "55,57,59,60,74": 627,
    "55,57,62,66,67,71,72": 628,
    "55,57,62,66,71,74": 629,
    "55,57,64,67,74,76": 630,
    "55,57,70,72": 631,
    "55,57,71,72,74,76": 632,
    "55,57,77,79": 633,
    "55,57,78,79": 634,
    "55,58": 635,
    "55,58,59,67": 636,
    "55,58,61": 637,
    "55,58,61,76,85": 638,
    "55,58,63,70": 639,
    "55,58,63,82": 640,
    "55,58,70": 641,
    "55,58,73": 642,
    "55,58,73,75": 643,
    "55,58,75": 644,
    "55,58,76": 645,
    "55,58,82": 646,
    "55,58,82,85": 647,
    "55,58,85": 648,
    "55,58,85,86": 649,
    "55,58,88": 650,
    "55,59": 651,
    "55,59,60,64,66,67": 652,
    "55,59,60,66,67": 653,
    "55,59,60,67,69": 654,
    "55,59,60,67,69,71": 655,
    "55,59,60,67,71": 656,
    "55,59,60,69,71": 657,
    "55,59,60,71": 658,
    "55,59,60,74,76": 659,
    "55,59,62": 660,
    "55,59,62,67": 661,
    "55,59,62,67,71": 662,
    "55,59,62,71": 663,
    "55,59,62,74": 664,
    "55,59,67": 665,
    "55,59,67,69": 666,
    "55,59,67,69,71": 667,
    "55,59,67,71": 668,
    "55,59,67,74": 669,
    "55,59,67,76": 670,
    "55,59,69,71": 671,
    "55,59,71": 672,
    "55,59,71,72": 673,
    "55,59,71,74": 674,
    "55,59,72,74": 675,
    "55,59,74": 676,
    "55,59,74,76": 677,
    "55,59,74,77": 678,
    "55,59,74,79": 679,
    "55,59,77": 680,
    "55,59,78,79": 681,
    "55,59,79": 682,
    "55,59,81,83": 683,
    "55,59,83": 684,
    "55,59,84,86": 685,
    "55,59,86": 686,
    "55,60": 687,
    "55,60,62,63": 688,
    "55,60,62,64": 689,
    "55,60,62,69": 690,
    "55,60,64": 691,
    "55,60,64,65": 692,
    "55,60,64,66": 693,
    "55,60,64,66,67": 694,
    "55,60,64,72": 695,
    "55,60,65": 696,
    "55,60,66,67": 697,
    "55,60,67,69": 698,
    "55,60,67,74": 699,
    "55,60,69": 700,
    "55,60,69,71": 701,
    "55,60,69,72": 702,
    "55,60,70": 703,
    "55,60,70,82": 704,
    "55,60,71,72": 705,
    "55,60,72": 706,
    "55,60,74,76": 707,
    "55,60,76": 708,
    "55,60,76,77": 709,
    "55,60,76,77,79": 710,
    "55,60,76,78": 711,
    "55,60,77": 712,
    "55,60,78": 713,
    "55,60,79": 714,
    "55,60,79,81": 715,
    "55,60,81,82": 716,
    "55,60,82": 717,
    "55,60,83,84,86": 718,
    "55,60,84": 719,
    "55,60,84,88": 720,
    "55,61": 721,
    "55,61,70": 722,
    "55,61,78,79": 723,
    "55,62": 724,
    "55,62,65,71": 725,
    "55,62,67": 726,
    "55,62,67,69": 727,
    "55,62,67,71": 728,
    "55,62,69,71": 729,
    "55,62,71": 730,
    "55,62,71,72": 731,
    "55,62,71,73": 732,
    "55,62,71,74": 733,
    "55,62,74": 734,
    "55,62,76,79": 735,
    "55,62,77": 736,
    "55,62,77,79": 737,
    "55,62,77,86": 738,
    "55,62,78,79": 739,
    "55,62,79": 740,
    "55,62,79,81": 741,
    "55,62,79,83": 742,
    "55,62,79,86": 743,
    "55,62,81,83": 744,
    "55,62,83": 745,
    "55,62,83,84": 746,
    "55,62,83,86": 747,
    "55,62,86": 748,
    "55,63,64": 749,
    "55,63,72": 750,
    "55,63,82": 751,
    "55,64": 752,
    "55,64,66": 753,
    "55,64,71,72": 754,
    "55,64,72": 755,
    "55,64,74,77": 756,
    "55,64,76": 757,
    "55,64,79": 758,
    "55,64,79,84": 759,
    "55,65": 760,
    "55,65,71": 761,
    "55,65,71,74": 762,
    "55,65,74": 763,
    "55,66,67": 764,
    "55,67": 765,
    "55,67,69": 766,
    "55,67,69,71,72": 767,
    "55,67,70,79": 768,
    "55,67,71": 769,
    "55,67,71,74": 770,
    "55,67,71,74,76": 771,
    "55,67,74": 772,
    "55,67,76": 773,
    "55,67,76,79": 774,
    "55,67,79": 775,
    "55,67,79,82": 776,
    "55,69,71": 777,
    "55,69,72,78": 778,
    "55,70": 779,
    "55,70,73": 780,
    "55,70,75": 781,
    "55,71": 782,
    "55,71,72": 783,
    "55,71,73": 784,
    "55,71,74": 785,
    "55,71,74,79": 786,
    "55,71,79": 787,
    "55,72": 788,
    "55,72,75": 789,
    "55,72,76": 790,
    "55,73": 791,
    "55,74": 792,
    "55,74,76": 793,
    "55,74,82": 794,
    "55,75": 795,
    "55,75,77": 796,
    "55,75,79": 797,
    "55,76": 798,
    "55,76,78": 799,
    "55,77": 800,
    "55,77,79": 801,
    "55,79": 802,
    "55,79,81": 803,
    "55,79,82": 804,
    "55,79,83": 805,
    "55,79,86": 806,
    "55,81,82": 807,
    "55,81,83": 808,
    "55,82": 809,
    "55,82,84": 810,
    "55,83": 811,
    "55,83,84": 812,
    "55,83,86": 813,
    "55,86": 814,
    "56": 815,
    "56,57": 816,
    "56,58,65,74": 817,
    "56,58,65,74,75": 818,
    "56,58,72,73,75": 819,
    "56,58,73,75": 820,
    "56,58,75": 821,
    "56,58,75,79": 822,
    "56,59,62,64": 823,
    "56,59,63,64": 824,
    "56,59,64": 825,
    "56,59,64,66": 826,
    "56,59,64,71": 827,
    "56,60": 828,
    "56,60,63,64": 829,
    "56,60,68": 830,
    "56,60,68,70": 831,
    "56,60,72": 832,
    "56,60,75": 833,
    "56,60,75,80": 834,
    "56,60,80": 835,
    "56,60,84": 836,
    "56,61,70": 837,
    "56,61,70,72": 838,
    "56,61,77,80": 839,
    "56,62": 840,
    "56,62,65,83": 841,
    "56,62,66": 842,
    "56,62,71": 843,
    "56,63": 844,
    "56,63,67,68": 845,
    "56,63,68": 846,
    "56,63,71,72": 847,
    "56,63,72": 848,
    "56,63,72,79": 849,
    "56,63,75": 850,
    "56,63,75,77": 851,
    "56,63,79,80": 852,
    "56,63,80,84": 853,
    "56,63,84": 854,
    "56,64,71": 855,
    "56,64,71,76": 856,
    "56,65,73,80": 857,
    "56,67,68,70": 858,
    "56,68": 859,
    "56,68,77": 860,
    "56,70,72": 861,
    "56,71": 862,
    "56,72": 863,
    "56,72,73": 864,
    "56,72,75": 865,
    "56,73": 866,
    "56,73,77": 867,
    "56,75": 868,
    "56,77": 869,
    "56,77,79": 870,
    "56,79": 871,
    "56,79,80": 872,
    "56,80": 873,
    "56,80,82": 874,
    "56,84": 875,
    "57": 876,
    "57,58,60,62": 877,
    "57,58,60,62,65,67": 878,
    "57,58,60,62,77,79": 879,
    "57,59": 880,
    "57,59,60,62,67": 881,
    "57,59,62,66,74": 882,
    "57,59,68,69,71,72": 883,
    "57,59,71,72,74,76": 884,
    "57,59,81,84": 885,
    "57,60": 886,
    "57,60,65": 887,
    "57,60,65,67": 888,
    "57,60,65,72": 889,
    "57,60,66": 890,
    "57,60,67": 891,
    "57,60,67,69": 892,
    "57,60,69": 893,
    "57,60,72": 894,
    "57,60,74": 895,
    "57,60,74,76": 896,
    "57,60,75": 897,
    "57,60,76": 898,
    "57,60,77": 899,
    "57,60,77,79": 900,
    "57,60,77,81": 901,
    "57,60,78": 902,
    "57,60,78,81": 903,
    "57,60,79": 904,
    "57,60,79,81": 905,
    "57,60,80,81": 906,
    "57,60,81": 907,
    "57,60,81,82": 908,
    "57,60,81,84": 909,
    "57,60,84": 910,
    "57,60,84,86": 911,
    "57,60,89": 912,
    "57,61": 913,
    "57,61,64": 914,
    "57,61,69": 915,
    "57,61,76,78": 916,
    "57,62": 917,
    "57,62,64,66,73,74": 918,
    "57,62,65,69": 919,
    "57,62,66": 920,
    "57,62,66,71": 921,
    "57,62,66,72,74": 922,
    "57,62,66,81": 923,
    "57,62,74,76": 924,
    "57,62,79,81": 925,
    "57,62,84,86": 926,
    "57,63,64,66,67": 927,
    "57,63,66": 928,
    "57,63,66,69": 929,
    "57,63,72": 930,
    "57,63,84": 931,
    "57,64": 932,
    "57,64,66,73,74": 933,
    "57,64,67": 934,
    "57,64,67,69": 935,
    "57,64,67,73": 936,
    "57,64,67,73,74": 937,
    "57,64,71,73,74": 938,
    "57,64,73": 939,
    "57,64,73,74": 940,
    "57,64,74": 941,
    "57,65,69": 942,
    "57,65,72": 943,
    "57,65,75,84": 944,
    "57,65,75,87": 945,
    "57,65,77": 946,
    "57,65,84": 947,
    "57,65,86": 948,
    "57,66": 949,
    "57,66,74": 950,
    "57,67,72": 951,
    "57,69,71,72,74": 952,
    "57,69,73,74,76,78": 953,
    "57,69,76,78": 954,
    "57,69,85": 955,
    "57,71,72": 956,
    "57,71,73": 957,
    "57,72": 958,
    "57,72,74": 959,
    "57,72,76": 960,
    "57,73,76": 961,
    "57,74,76": 962,
    "57,74,78": 963,
    "57,76": 964,
    "57,76,78": 965,
    "57,76,79,81": 966,
    "57,77": 967,
    "57,78,79": 968,
    "57,79": 969,
    "57,79,81": 970,
    "57,81": 971,
    "57,81,83,85": 972,
    "57,81,84": 973,
    "57,84": 974,
    "58": 975,
    "58,59": 976,
    "58,60": 977,
    "58,60,62,63,67,69,78,79": 978,
    "58,60,62,63,67,69,79": 979,
    "58,60,62,63,69,79": 980,
    "58,60,62,64": 981,
    "58,60,64": 982,
    "58,60,65": 983,
    "58,60,67,74,76,82": 984,
    "58,60,67,77,79": 985,
    "58,60,74,76": 986,
    "58,60,75": 987,
    "58,60,75,79": 988,
    "58,60,77": 989,
    "58,60,81,82": 990,
    "58,61": 991,
    "58,61,67": 992,
    "58,61,68": 993,
    "58,61,70": 994,
    "58,61,70,73": 995,
    "58,61,72,73": 996,
    "58,61,73": 997,
    "58,61,76,79": 998,
    "58,61,79": 999,
    "58,61,79,81": 1000,
    "58,62": 1001,
    "58,62,63,67,68,75,82": 1002,
    "58,62,67": 1003,
    "58,62,67,69": 1004,
    "58,62,67,70": 1005,
    "58,62,68,77": 1006,
    "58,62,68,82": 1007,
    "58,62,70": 1008,
    "58,62,74": 1009,
    "58,62,74,77": 1010,
    "58,62,77": 1011,
    "58,62,77,79": 1012,
    "58,62,79,81": 1013,
    "58,62,80": 1014,
    "58,63": 1015,
    "58,63,67,73": 1016,
    "58,63,75": 1017,
    "58,63,77,79": 1018,
    "58,63,82": 1019,
    "58,64,79": 1020,
    "58,65,70": 1021,
    "58,65,74": 1022,
    "58,65,74,75": 1023,
    "58,65,74,76": 1024,
    "58,65,74,80": 1025,
    "58,65,75": 1026,
    "58,65,77": 1027,
    "58,65,77,86": 1028,
    "58,65,79,80": 1029,
    "58,65,79,81": 1030,
    "58,65,80": 1031,
    "58,65,86": 1032,
    "58,67": 1033,
    "58,67,68": 1034,
    "58,67,73": 1035,
    "58,67,75": 1036,
    "58,67,75,77": 1037,
    "58,67,77,79": 1038,
    "58,67,79": 1039,
    "58,67,79,81": 1040,
    "58,67,79,82": 1041,
    "58,67,81,82": 1042,
    "58,67,82": 1043,
    "58,67,86": 1044,
    "58,68": 1045,
    "58,68,74": 1046,
    "58,68,74,75": 1047,
    "58,68,74,77": 1048,
    "58,68,75": 1049,
    "58,68,77": 1050,
    "58,68,77,80": 1051,
    "58,68,80,84": 1052,
    "58,68,82,84": 1053,
    "58,70": 1054,
    "58,70,73": 1055,
    "58,73": 1056,
    "58,73,75": 1057,
    "58,73,77": 1058,
    "58,74": 1059,
    "58,74,75": 1060,
    "58,75": 1061,
    "58,75,77": 1062,
    "58,77": 1063,
    "58,77,79": 1064,
    "58,79": 1065,
    "58,79,80": 1066,
    "58,79,82": 1067,
    "58,80": 1068,
    "59": 1069,
    "59,60,66,68,69,71": 1070,
    "59,60,67,74": 1071,
    "59,60,67,76": 1072,
    "59,60,74,76": 1073,
    "59,60,76": 1074,
    "59,60,79,83": 1075,
    "59,61": 1076,
    "59,62": 1077,
    "59,62,66,67": 1078,
    "59,62,67": 1079,
    "59,62,67,71": 1080,
    "59,62,67,77": 1081,
    "59,62,68": 1082,
    "59,62,68,76": 1083,
    "59,62,71,74": 1084,
    "59,62,74": 1085,
    "59,62,74,76": 1086,
    "59,62,77": 1087,
    "59,62,77,79": 1088,
    "59,62,79": 1089,
    "59,62,79,83": 1090,
    "59,62,81,83": 1091,
    "59,62,83": 1092,
    "59,62,83,84": 1093,
    "59,62,86": 1094,
    "59,65": 1095,
    "59,65,67": 1096,
    "59,65,68": 1097,
    "59,66,74,79": 1098,
    "59,66,79,83": 1099,
    "59,67": 1100,
    "59,67,69": 1101,
    "59,67,72,79": 1102,
    "59,67,74": 1103,
    "59,67,74,76": 1104,
    "59,67,76": 1105,
    "59,67,76,77": 1106,
    "59,67,77": 1107,
    "59,67,77,79": 1108,
    "59,67,79": 1109,
    "59,68,69,76,80,83,86": 1110,
    "59,68,76,80,83,86": 1111,
    "59,71": 1112,
    "59,71,74": 1113,
    "59,74": 1114,
    "59,74,76": 1115,
    "59,74,77": 1116,
    "59,74,79": 1117,
    "59,77": 1118,
    "59,77,80": 1119,
    "59,79": 1120,
    "59,79,81": 1121,
    "59,79,83": 1122,
    "59,83": 1123,
    "59,83,86": 1124,
    "59,86": 1125,
    "60": 1126,
    "60,61": 1127,
    "60,61,67,68,77": 1128,
    "60,61,67,76": 1129,
    "60,62": 1130,
    "60,62,64,65": 1131,
    "60,62,66": 1132,
    "60,62,66,69": 1133,
    "60,62,67,75": 1134,
    "60,62,67,76": 1135,
    "60,62,67,77": 1136,
    "60,62,71,72": 1137,
    "60,62,71,72,74": 1138,
    "60,62,74,76": 1139,
    "60,62,75": 1140,
    "60,62,75,79": 1141,
    "60,62,76,77": 1142,
    "60,62,76,83": 1143,
    "60,62,77,79": 1144,
    "60,62,79": 1145,
    "60,62,79,81": 1146,
    "60,62,81": 1147,
    "60,62,81,84": 1148,
    "60,63": 1149,
    "60,63,68": 1150,
    "60,63,68,72": 1151,
    "60,63,69": 1152,
    "60,63,69,78": 1153,
    "60,63,69,78,79": 1154,
    "60,63,72": 1155,
    "60,63,72,73": 1156,
    "60,63,72,74": 1157,
    "60,63,73,75": 1158,
    "60,63,75": 1159,
    "60,63,78": 1160,
    "60,63,79": 1161,
    "60,63,80": 1162,
    "60,63,80,82": 1163,
    "60,63,84": 1164,
    "60,64": 1165,
    "60,64,65,72,74": 1166,
    "60,64,67": 1167,
    "60,64,67,68": 1168,
    "60,64,69": 1169,
    "60,64,69,79,84": 1170,
    "60,64,72": 1171,
    "60,64,72,76": 1172,
    "60,64,76": 1173,
    "60,64,76,77": 1174,
    "60,64,76,79": 1175,
    "60,64,79": 1176,
    "60,64,79,81": 1177,
    "60,64,81": 1178,
    "60,64,81,83": 1179,
    "60,64,84": 1180,
    "60,65": 1181,
    "60,65,67,74,77": 1182,
    "60,65,68,70": 1183,
    "60,65,69": 1184,
    "60,65,69,70": 1185,
    "60,65,71": 1186,
    "60,65,72": 1187,
    "60,65,75": 1188,
    "60,65,75,87": 1189,
    "60,65,77": 1190,
    "60,65,79,82": 1191,
    "60,65,84": 1192,
    "60,65,89": 1193,
    "60,66,75": 1194,
    "60,66,83,84": 1195,
    "60,67": 1196,
    "60,67,69": 1197,
    "60,67,69,83,84": 1198,
    "60,67,70,72": 1199,
    "60,67,70,77": 1200,
    "60,67,72": 1201,
    "60,67,72,74": 1202,
    "60,67,72,76": 1203,
    "60,67,74": 1204,
    "60,67,74,76": 1205,
    "60,67,75": 1206,
    "60,67,76": 1207,
    "60,67,76,77": 1208,
    "60,67,76,78": 1209,
    "60,67,76,79": 1210,
    "60,67,77": 1211,
    "60,67,77,79": 1212,
    "60,67,79": 1213,
    "60,67,79,81": 1214,
    "60,67,79,82": 1215,
    "60,67,81,83": 1216,
    "60,67,83,84": 1217,
    "60,67,84": 1218,
    "60,68": 1219,
    "60,68,72": 1220,
    "60,68,72,75": 1221,
    "60,68,74": 1222,
    "60,68,75": 1223,
    "60,68,78": 1224,
    "60,68,80": 1225,
    "60,69": 1226,
    "60,69,70": 1227,
    "60,69,72": 1228,
    "60,69,77": 1229,
    "60,69,77,79": 1230,
    "60,69,77,81": 1231,
    "60,69,81": 1232,
    "60,69,84": 1233,
    "60,70": 1234,
    "60,70,72": 1235,
    "60,70,72,76": 1236,
    "60,70,76": 1237,
    "60,70,76,79": 1238,
    "60,70,79": 1239,
    "60,70,84": 1240,
    "60,71,72": 1241,
    "60,72": 1242,
    "60,72,74": 1243,
    "60,72,75": 1244,
    "60,72,75,81": 1245,
    "60,72,76": 1246,
    "60,72,79": 1247,
    "60,72,80,81": 1248,
    "60,74": 1249,
    "60,74,75": 1250,
    "60,74,76": 1251,
    "60,75": 1252,
    "60,75,77": 1253,
    "60,76": 1254,
    "60,76,77": 1255,
    "60,76,79": 1256,
    "60,76,81": 1257,
    "60,77": 1258,
    "60,77,79": 1259,
    "60,79": 1260,
    "60,79,81": 1261,
    "60,79,82": 1262,
    "60,79,83": 1263,
    "60,81": 1264,
    "60,81,83": 1265,
    "60,81,84": 1266,
    "60,84": 1267,
    "61": 1268,
    "61,62": 1269,
    "61,62,64,66,69": 1270,
    "61,62,66,69": 1271,
    "61,62,69": 1272,
    "61,62,76,78": 1273,
    "61,62,76,79": 1274,
    "61,63": 1275,
    "61,63,67,70": 1276,
    "61,63,75": 1277,
    "61,64": 1278,
    "61,64,69": 1279,
    "61,64,69,76": 1280,
    "61,64,69,79": 1281,
    "61,64,79": 1282,
    "61,64,79,81": 1283,
    "61,67": 1284,
    "61,67,70": 1285,
    "61,67,73": 1286,
    "61,67,77": 1287,
    "61,68,77": 1288,
    "61,69": 1289,
    "61,69,71": 1290,
    "61,69,76": 1291,
    "61,69,76,78": 1292,
    "61,69,76,81": 1293,
    "61,69,81": 1294,
    "61,70": 1295,
    "61,70,73": 1296,
    "61,71,73": 1297,
    "61,73": 1298,
    "61,75": 1299,
    "61,76,78": 1300,
    "61,76,79": 1301,
    "61,77": 1302,
    "61,77,80": 1303,
    "61,78,79": 1304,
    "61,79": 1305,
    "61,79,81": 1306,
    "61,81": 1307,
    "62": 1308,
    "62,63,67,78,79": 1309,
    "62,63,75": 1310,
    "62,63,75,79": 1311,
    "62,64": 1312,
    "62,64,66,67,86": 1313,
    "62,64,67,69": 1314,
    "62,64,73,74": 1315,
    "62,64,78,79": 1316,
    "62,65": 1317,
    "62,65,69": 1318,
    "62,65,70": 1319,
    "62,65,71": 1320,
    "62,65,72": 1321,
    "62,65,72,74": 1322,
    "62,65,74": 1323,
    "62,65,74,76": 1324,
    "62,65,79,80": 1325,
    "62,65,80": 1326,
    "62,65,81": 1327,
    "62,65,81,82": 1328,
    "62,65,82": 1329,
    "62,65,85,86": 1330,
    "62,65,86": 1331,
    "62,66": 1332,
    "62,66,67,69,71": 1333,
    "62,66,67,73,74": 1334,
    "62,66,67,74,76": 1335,
    "62,66,67,81,83": 1336,
    "62,66,69": 1337,
    "62,66,71": 1338,
    "62,66,71,83,86": 1339,
    "62,66,71,86": 1340,
    "62,66,72": 1341,
    "62,66,73,74": 1342,
    "62,66,74": 1343,
    "62,66,74,76": 1344,
    "62,66,74,78": 1345,
    "62,66,76,78": 1346,
    "62,66,78,79": 1347,
    "62,66,78,81": 1348,
    "62,66,79,81": 1349,
    "62,66,79,81,83": 1350,
    "62,66,81": 1351,
    "62,66,81,83": 1352,
    "62,66,81,84": 1353,
    "62,66,83": 1354,
    "62,66,83,84": 1355,
    "62,66,83,85": 1356,
    "62,66,85,86": 1357,
    "62,66,86": 1358,
    "62,67": 1359,
    "62,67,69": 1360,
    "62,67,69,72,74": 1361,
    "62,67,71,72": 1362,
    "62,67,71,73": 1363,
    "62,67,72": 1364,
    "62,67,72,74": 1365,
    "62,67,73,74": 1366,
    "62,67,74": 1367,
    "62,67,74,76": 1368,
    "62,67,76": 1369,
    "62,67,76,78": 1370,
    "62,67,76,79": 1371,
    "62,67,77": 1372,
    "62,67,77,79": 1373,
    "62,67,78": 1374,
    "62,67,78,79": 1375,
    "62,67,79": 1376,
    "62,67,79,81": 1377,
    "62,67,83,84": 1378,
    "62,67,84": 1379,
    "62,67,85,88": 1380,
    "62,68": 1381,
    "62,69": 1382,
    "62,69,71": 1383,
    "62,69,72": 1384,
    "62,69,72,78": 1385,
    "62,69,72,78,81": 1386,
    "62,69,72,81": 1387,
    "62,69,76,78,80": 1388,
    "62,69,77,79": 1389,
    "62,69,78": 1390,
    "62,69,78,80": 1391,
    "62,69,78,81": 1392,
    "62,69,81": 1393,
    "62,70,79": 1394,
    "62,70,82": 1395,
    "62,71": 1396,
    "62,71,72": 1397,
    "62,71,74": 1398,
    "62,71,74,79": 1399,
    "62,71,79": 1400,
    "62,72": 1401,
    "62,72,78": 1402,
    "62,72,78,79": 1403,
    "62,72,78,81": 1404,
    "62,73,74": 1405,
    "62,74": 1406,
    "62,74,76": 1407,
    "62,74,78": 1408,
    "62,74,79": 1409,
    "62,74,81": 1410,
    "62,76": 1411,
    "62,76,78": 1412,
    "62,77": 1413,
    "62,77,79": 1414,
    "62,78": 1415,
    "62,78,79": 1416,
    "62,78,80": 1417,
    "62,78,81": 1418,
    "62,79": 1419,
    "62,79,81": 1420,
    "62,79,83": 1421,
    "62,80": 1422,
    "62,80,81": 1423,
    "62,80,82": 1424,
    "62,81": 1425,
    "62,81,83": 1426,
    "62,83": 1427,
    "62,84": 1428,
    "62,86": 1429,
    "63": 1430,
    "63,64": 1431,
    "63,65,68,74": 1432,
    "63,65,69": 1433,
    "63,65,71,72,80": 1434,
    "63,65,74": 1435,
    "63,65,75": 1436,
    "63,65,79,80": 1437,
    "63,66,69,72": 1438,
    "63,67": 1439,
    "63,67,70": 1440,
    "63,67,70,73": 1441,
    "63,67,70,73,79": 1442,
    "63,67,70,73,85": 1443,
    "63,67,72": 1444,
    "63,67,73": 1445,
    "63,67,74,75": 1446,
    "63,67,74,77": 1447,
    "63,67,75": 1448,
    "63,67,75,77": 1449,
    "63,67,79": 1450,
    "63,67,79,82": 1451,
    "63,67,80": 1452,
    "63,67,82": 1453,
    "63,67,84": 1454,
    "63,68": 1455,
    "63,68,70,74": 1456,
    "63,68,72": 1457,
    "63,68,74": 1458,
    "63,68,75": 1459,
    "63,68,77": 1460,
    "63,68,77,80": 1461,
    "63,68,78": 1462,
    "63,68,80": 1463,
    "63,70": 1464,
    "63,70,75": 1465,
    "63,70,75,80": 1466,
    "63,70,80,82": 1467,
    "63,70,82": 1468,
    "63,71": 1469,
    "63,72": 1470,
    "63,72,75": 1471,
    "63,72,79": 1472,
    "63,72,80": 1473,
    "63,73": 1474,
    "63,73,75": 1475,
    "63,74,75,77": 1476,
    "63,74,77,82": 1477,
    "63,75": 1478,
    "63,77": 1479,
    "63,79": 1480,
    "63,80": 1481,
    "63,82": 1482,
    "63,82,84": 1483,
    "64": 1484,
    "64,65": 1485,
    "64,65,67,68,71": 1486,
    "64,65,67,72,76": 1487,
    "64,65,69,70": 1488,
    "64,65,70,79,81,86": 1489,
    "64,65,72,79,81": 1490,
    "64,65,79,81": 1491,
    "64,65,84": 1492,
    "64,66": 1493,
    "64,66,73,74": 1494,
    "64,67": 1495,
    "64,67,69": 1496,
    "64,67,70": 1497,
    "64,67,70,73,82": 1498,
    "64,67,70,79": 1499,
    "64,67,71": 1500,
    "64,67,72": 1501,
    "64,67,72,74": 1502,
    "64,67,72,74,76": 1503,
    "64,67,72,76": 1504,
    "64,67,73": 1505,
    "64,67,74": 1506,
    "64,67,74,76": 1507,
    "64,67,76": 1508,
    "64,67,76,77": 1509,
    "64,67,77,79": 1510,
    "64,67,79": 1511,
    "64,67,79,81": 1512,
    "64,67,82,84": 1513,
    "64,67,83,84": 1514,
    "64,67,84": 1515,
    "64,67,84,86": 1516,
    "64,67,86": 1517,
    "64,68,83,85": 1518,
    "64,69,73,88": 1519,
    "64,69,77": 1520,
    "64,70,79": 1521,
    "64,72": 1522,
    "64,72,79": 1523,
    "64,72,79,82": 1524,
    "64,72,82": 1525,
    "64,72,83": 1526,
    "64,72,84": 1527,
    "64,73": 1528,
    "64,73,79": 1529,
    "64,74,76": 1530,
    "64,76,77": 1531,
    "64,76,79": 1532,
    "64,77,79": 1533,
    "64,79": 1534,
    "64,79,81": 1535,
    "64,80": 1536,
    "64,81,83": 1537,
    "64,82,84": 1538,
    "64,83,84": 1539,
    "64,84": 1540,
    "65": 1541,
    "65,67": 1542,
    "65,67,69": 1543,
    "65,67,69,70": 1544,
    "65,67,69,71": 1545,
    "65,67,69,81,82,84": 1546,
    "65,67,71": 1547,
    "65,67,72": 1548,
    "65,67,74": 1549,
    "65,67,74,76": 1550,
    "65,67,75": 1551,
    "65,67,76,77": 1552,
    "65,67,80,82": 1553,
    "65,67,81,82": 1554,
    "65,67,81,83": 1555,
    "65,68": 1556,
    "65,68,70": 1557,
    "65,68,71": 1558,
    "65,68,72": 1559,
    "65,68,73": 1560,
    "65,68,74": 1561,
    "65,68,77": 1562,
    "65,68,80": 1563,
    "65,69": 1564,
    "65,69,70,72,74": 1565,
    "65,69,72": 1566,
    "65,69,72,77": 1567,
    "65,69,72,81": 1568,
    "65,69,73": 1569,
    "65,69,74": 1570,
    "65,69,77": 1571,
    "65,69,77,79": 1572,
    "65,69,77,84": 1573,
    "65,69,79,81": 1574,
    "65,69,81,82": 1575,
    "65,69,82,84": 1576,
    "65,69,84": 1577,
    "65,70": 1578,
    "65,70,74": 1579,
    "65,70,74,76": 1580,
    "65,70,74,77": 1581,
    "65,70,76": 1582,
    "65,70,76,77": 1583,
    "65,70,82": 1584,
    "65,71,80": 1585,
    "65,72": 1586,
    "65,72,77": 1587,
    "65,72,77,80": 1588,
    "65,72,77,81": 1589,
    "65,72,79,80": 1590,
    "65,72,80": 1591,
    "65,72,81": 1592,
    "65,73": 1593,
    "65,73,74": 1594,
    "65,74": 1595,
    "65,75": 1596,
    "65,77": 1597,
    "65,79": 1598,
    "65,79,82": 1599,
    "65,80": 1600,
    "65,81": 1601,
    "65,81,83": 1602,
    "65,82": 1603,
    "65,83,84": 1604,
    "65,84": 1605,
    "65,86": 1606,
    "66": 1607,
    "66,67": 1608,
    "66,67,69,70,74,75": 1609,
    "66,67,69,71,76": 1610,
    "66,67,69,74,81,82": 1611,
    "66,67,71,74": 1612,
    "66,67,78,83": 1613,
    "66,67,79,83": 1614,
    "66,67,81,83": 1615,
    "66,69": 1616,
    "66,69,72,74": 1617,
    "66,69,74": 1618,
    "66,69,74,76": 1619,
    "66,69,74,81": 1620,
    "66,69,75": 1621,
    "66,69,75,76": 1622,
    "66,69,78": 1623,
    "66,69,81,82": 1624,
    "66,69,81,86": 1625,
    "66,69,86": 1626,
    "66,70": 1627,
    "66,71": 1628,
    "66,72,74": 1629,
    "66,72,74,86": 1630,
    "66,73,74": 1631,
    "66,74": 1632,
    "66,74,76": 1633,
    "66,74,83": 1634,
    "66,74,84": 1635,
    "66,74,86": 1636,
    "66,76": 1637,
    "66,76,78": 1638,
    "66,78": 1639,
    "66,78,79": 1640,
    "66,78,81": 1641,
    "66,79": 1642,
    "66,81": 1643,
    "66,81,83": 1644,
    "66,84": 1645,
    "67": 1646,
    "67,68": 1647,
    "67,68,70": 1648,
    "67,68,74,75,83": 1649,
    "67,69": 1650,
    "67,69,70,72,75,77": 1651,
    "67,69,71": 1652,
    "67,69,71,72": 1653,
    "67,69,73,76": 1654,
    "67,69,83,85": 1655,
    "67,70": 1656,
    "67,70,72": 1657,
    "67,70,73,79,82,85,88": 1658,
    "67,70,74,75": 1659,
    "67,70,75": 1660,
    "67,70,75,77": 1661,
    "67,70,76": 1662,
    "67,70,77": 1663,
    "67,70,82": 1664,
    "67,71": 1665,
    "67,71,72": 1666,
    "67,71,72,78,79": 1667,
    "67,71,74": 1668,
    "67,71,74,76": 1669,
    "67,71,74,79": 1670,
    "67,71,74,86": 1671,
    "67,71,75,76": 1672,
    "67,71,76": 1673,
    "67,71,76,78": 1674,
    "67,71,78,79": 1675,
    "67,71,79": 1676,
    "67,71,79,81": 1677,
    "67,71,79,81,83": 1678,
    "67,71,79,83": 1679,
    "67,71,81,83": 1680,
    "67,71,83": 1681,
    "67,71,83,86": 1682,
    "67,71,86": 1683,
    "67,72": 1684,
    "67,72,74": 1685,
    "67,72,74,76": 1686,
    "67,72,74,78": 1687,
    "67,72,76": 1688,
    "67,72,76,84": 1689,
    "67,72,78,79": 1690,
    "67,72,78,81": 1691,
    "67,72,79,81": 1692,
    "67,72,81,84": 1693,
    "67,72,84": 1694,
    "67,73": 1695,
    "67,73,75": 1696,
    "67,74": 1697,
    "67,74,76": 1698,
    "67,74,79,82": 1699,
    "67,74,81": 1700,
    "67,74,82": 1701,
    "67,74,83": 1702,
    "67,75": 1703,
    "67,75,79": 1704,
    "67,75,82": 1705,
    "67,76": 1706,
    "67,76,78": 1707,
    "67,76,79,84": 1708,
    "67,77": 1709,
    "67,77,83,86": 1710,
    "67,79": 1711,
    "67,79,82": 1712,
    "67,79,83": 1713,
    "67,81,83": 1714,
    "67,82": 1715,
    "67,83": 1716,
    "67,83,86": 1717,
    "67,84": 1718,
    "67,86": 1719,
    "68": 1720,
    "68,69": 1721,
    "68,69,73,81": 1722,
    "68,69,76": 1723,
    "68,69,81": 1724,
    "68,70": 1725,
    "68,71,74,77,83": 1726,
    "68,72": 1727,
    "68,72,77": 1728,
    "68,72,80": 1729,
    "68,73,75": 1730,
    "68,74": 1731,
    "68,74,76": 1732,
    "68,74,76,88": 1733,
    "68,74,77": 1734,
    "68,74,83": 1735,
    "68,75": 1736,
    "68,77": 1737,
    "68,80": 1738,
    "69": 1739,
    "69,70": 1740,
    "69,70,72": 1741,
    "69,70,84,86": 1742,
    "69,71": 1743,
    "69,71,74,78": 1744,
    "69,71,78,79": 1745,
    "69,72": 1746,
    "69,72,74,75": 1747,
    "69,72,75,84": 1748,
    "69,72,76": 1749,
    "69,72,78": 1750,
    "69,72,78,81": 1751,
    "69,72,79": 1752,
    "69,72,81": 1753,
    "69,72,81,84": 1754,
    "69,72,84": 1755,
    "69,73": 1756,
    "69,73,74": 1757,
    "69,73,76": 1758,
    "69,73,78": 1759,
    "69,74": 1760,
    "69,74,78": 1761,
    "69,74,83": 1762,
    "69,75": 1763,
    "69,75,77": 1764,
    "69,76,78": 1765,
    "69,77": 1766,
    "69,78": 1767,
    "69,78,79": 1768,
    "69,79": 1769,
    "69,79,81": 1770,
    "69,81": 1771,
    "69,83": 1772,
    "69,84": 1773,
    "69,84,86": 1774,
    "70": 1775,
    "70,72": 1776,
    "70,73": 1777,
    "70,74": 1778,
    "70,74,82": 1779,
    "70,75": 1780,
    "70,75,77": 1781,
    "70,79": 1782,
    "70,82": 1783,
    "71": 1784,
    "71,72": 1785,
    "71,72,74": 1786,
    "71,72,74,75": 1787,
    "71,72,74,76,79,81": 1788,
    "71,72,74,81": 1789,
    "71,73": 1790,
    "71,73,76,79": 1791,
    "71,74": 1792,
    "71,74,78": 1793,
    "71,74,79": 1794,
    "71,75": 1795,
    "71,76": 1796,
    "71,78,79": 1797,
    "71,79": 1798,
    "71,79,81": 1799,
    "71,83": 1800,
    "71,86": 1801,
    "71,88": 1802,
    "72": 1803,
    "72,73": 1804,
    "72,74": 1805,
    "72,74,75,77": 1806,
    "72,74,76": 1807,
    "72,75": 1808,
    "72,76": 1809,
    "72,76,79": 1810,
    "72,76,80": 1811,
    "72,76,84": 1812,
    "72,77": 1813,
    "72,78": 1814,
    "72,78,81": 1815,
    "72,79": 1816,
    "72,80": 1817,
    "72,80,81": 1818,
    "72,81": 1819,
    "72,82": 1820,
    "72,84": 1821,
    "73": 1822,
    "73,74": 1823,
    "73,74,76": 1824,
    "73,74,80,81": 1825,
    "73,75": 1826,
    "73,76": 1827,
    "73,76,81": 1828,
    "73,77": 1829,
    "73,78": 1830,
    "73,79": 1831,
    "73,80": 1832,
    "73,81": 1833,
    "73,81,83": 1834,
    "73,85": 1835,
    "74": 1836,
    "74,75": 1837,
    "74,75,77,79": 1838,
    "74,76": 1839,
    "74,76,77": 1840,
    "74,76,78": 1841,
    "74,76,78,84": 1842,
    "74,77": 1843,
    "74,78": 1844,
    "74,78,81": 1845,
    "74,78,82": 1846,
    "74,78,83": 1847,
    "74,79": 1848,
    "74,80": 1849,
    "74,80,83": 1850,
    "74,81": 1851,
    "74,81,83": 1852,
    "74,83": 1853,
    "74,86": 1854,
    "75": 1855,
    "75,76": 1856,
    "75,77": 1857,
    "75,79": 1858,
    "75,80": 1859,
    "75,82": 1860,
    "75,87": 1861,
    "76": 1862,
    "76,77": 1863,
    "76,77,79": 1864,
    "76,78": 1865,
    "76,78,79": 1866,
    "76,79": 1867,
    "76,79,83": 1868,
    "76,80": 1869,
    "76,81": 1870,
    "76,83,84": 1871,
    "76,84": 1872,
    "76,85": 1873,
    "76,88": 1874,
    "77": 1875,
    "77,79": 1876,
    "77,80": 1877,
    "77,81": 1878,
    "77,84": 1879,
    "77,86": 1880,
    "78": 1881,
    "78,79": 1882,
    "78,79,81,88": 1883,
    "78,81": 1884,
    "78,81,84,86": 1885,
    "78,81,85": 1886,
    "78,81,86": 1887,
    "78,86": 1888,
    "79": 1889,
    "79,80": 1890,
    "79,81": 1891,
    "79,82": 1892,
    "79,83": 1893,
    "79,83,87": 1894,
    "79,87,88": 1895,
    "80": 1896,
    "80,82": 1897,
    "80,83": 1898,
    "80,84": 1899,
    "81": 1900,
    "81,82": 1901,
    "81,82,84": 1902,
    "81,83": 1903,
    "81,84": 1904,
    "81,84,86": 1905,
    "81,86": 1906,
    "82": 1907,
    "82,83": 1908,
    "82,84": 1909,
    "83": 1910,
    "83,84": 1911,
    "83,85": 1912,
    "84": 1913,
    "84,86": 1914,
    "85": 1915,
    "85,86": 1916,
    "85,88": 1917,
    "86": 1918,
    "86,89": 1919,
    "87": 1920,
    "rest": 1921,
    "<UNK>": 0
  },
  "id_to_token": {
    "1": "29,41",
    "2": "29,41,77",
    "3": "30,42",
    "4": "31,43",
    "5": "31,43,67",
    "6": "31,43,74",
    "7": "31,67",
    "8": "32,44,56",
    "9": "32,44,60,63,68",
    "10": "33,45,61,62",
    "11": "33,45,72,84",
    "12": "33,56",
    "13": "33,61",
    "14": "34,46",
    "15": "34,46,58,62",
    "16": "34,46,74",
    "17": "34,46,74,77",
    "18": "34,89",
    "19": "36",
    "20": "36,40,43,48,52,55,60",
    "21": "36,48",
    "22": "36,48,64,67,72",
    "23": "36,48,65,69",
    "24": "36,48,67,70",
    "25": "36,48,67,72,76",
    "26": "36,48,72",
    "27": "36,48,76",
    "28": "36,48,76,88",
    "29": "36,48,77,79",
    "30": "36,64,67,72",
    "31": "36,72",
    "32": "38",
    "33": "38,42,45,50,86",
    "34": "38,50",
    "35": "38,50,54,62",
    "36": "38,50,58,62,67,79",
    "37": "38,50,62",
    "38": "38,50,62,66",
    "39": "38,50,65",
    "40": "38,50,66",
    "41": "38,50,66,69",
    "42": "38,50,66,74",
    "43": "38,50,69",
    "44": "38,50,74",
    "45": "38,62",
    "46": "38,62,64",
    "47": "38,66",
    "48": "38,70,71",
    "49": "38,74",
    "50": "38,74,78",
    "51": "39",
    "52": "39,43",
    "53": "39,51",
    "54": "39,51,61",
    "55": "39,68",
    "56": "39,75",
    "57": "39,75,77",
    "58": "39,80",
    "59": "40",
    "60": "40,41,52,53,69,79",
    "61": "40,52",
    "62": "40,52,64",
    "63": "40,52,67",
    "64": "40,52,67,79",
    "65": "40,52,68,71",
    "66": "40,52,69,72",
    "67": "40,52,71,74",
    "68": "40,52,79",
    "69": "40,52,82",
    "70": "41",
    "71": "41,43,53,55,70,72",
    "72": "41,43,53,55,72,74",
    "73": "41,45,48,53,57,60,65",
    "74": "41,45,53,57,77",
    "75": "41,53,62",
    "76": "41,53,65,69,72,77",
    "77": "41,53,69",
    "78": "41,53,69,72",
    "79": "41,53,69,79",
    "80": "41,53,74",
    "81": "41,53,74,77",
    "82": "41,53,76",
    "83": "41,53,76,77",
    "84": "41,53,77",
    "85": "41,53,77,79",
    "86": "41,53,79",
    "87": "41,65",
    "88": "41,65,69",
    "89": "41,69",
    "90": "41,77",
    "91": "41,84",
    "92": "42,45,54,57",
    "93": "42,54,72,74",
    "94": "42,54,74",
    "95": "42,66",
    "96": "43",
    "97": "43,45,55,57,72,74",
    "98": "43,47,50,55,59,62,67",
    "99": "43,47,50,62",
    "100": "43,47,55,62,65",
    "101": "43,48,52,60",
    "102": "43,48,71,72",
    "103": "43,48,72",
    "104": "43,50,59",
    "105": "43,50,79",
    "106": "43,55",
    "107": "43,55,64,67",
    "108": "43,55,67",
    "109": "43,55,67,71,74,76",
    "110": "43,55,70",
    "111": "43,55,70,74",
    "112": "43,55,70,79",
    "113": "43,55,71",
    "114": "43,55,71,72",
    "115": "43,55,71,74",
    "116": "43,55,71,74,79",
    "117": "43,55,72",
    "118": "43,55,72,75",
    "119": "43,55,74",
    "120": "43,55,74,82",
    "121": "43,62,71",
    "122": "43,63,64",
    "123": "43,67",
    "124": "43,69,70",
    "125": "43,70",
    "126": "43,71",
    "127": "43,71,72",
    "128": "43,71,74",
    "129": "43,72",
    "130": "43,72,75",
    "131": "43,79",
    "132": "44",
    "133": "44,46,75,77,79,80",
    "134": "44,46,77,79,80,82",
    "135": "44,48",
    "136": "44,51,68",
    "137": "44,56",
    "138": "44,56,60,68",
    "139": "44,56,65",
    "140": "44,56,68",
    "141": "44,56,72,73",
    "142": "44,60",
    "143": "44,65",
    "144": "44,68",
    "145": "44,72",
    "146": "44,73",
    "147": "44,75",
    "148": "44,77,79,80,82",
    "149": "44,79,80,82,84",
    "150": "44,79,82",
    "151": "45",
    "152": "45,46,57,58,74,84",
    "153": "45,46,57,58,77",
    "154": "45,48,54,57,62,66,69,72",
    "155": "45,48,57,60,77,82",
    "156": "45,49,52,55,64",
    "157": "45,49,52,57,65",
    "158": "45,49,52,57,76",
    "159": "45,49,52,57,85",
    "160": "45,49,52,58,61,64,67",
    "161": "45,50,74,76",
    "162": "45,52,55",
    "163": "45,52,61",
    "164": "45,53,57,65,72,74",
    "165": "45,54,62",
    "166": "45,57",
    "167": "45,57,59,61",
    "168": "45,57,61,69",
    "169": "45,57,65",
    "170": "45,57,65,72",
    "171": "45,57,67",
    "172": "45,57,71,72",
    "173": "45,57,72",
    "174": "45,57,72,74",
    "175": "45,57,72,76",
    "176": "45,57,72,84",
    "177": "45,57,73,81",
    "178": "45,57,74",
    "179": "45,57,74,76",
    "180": "45,57,76",
    "181": "45,57,76,77",
    "182": "45,57,77",
    "183": "45,57,84",
    "184": "45,59",
    "185": "45,61,64",
    "186": "45,62",
    "187": "45,73,76",
    "188": "45,74",
    "189": "45,74,76",
    "190": "45,76,77",
    "191": "46",
    "192": "46,48,77,80",
    "193": "46,50,53,56",
    "194": "46,50,56,77",
    "195": "46,53,62",
    "196": "46,53,74",
    "197": "46,55,63",
    "198": "46,58,67,69",
    "199": "46,58,70,72",
    "200": "46,58,70,74",
    "201": "46,58,72,74",
    "202": "46,58,73",
    "203": "46,58,74",
    "204": "46,58,74,76",
    "205": "46,58,74,84",
    "206": "46,58,76,77",
    "207": "46,58,79,81",
    "208": "46,58,79,82",
    "209": "46,58,81",
    "210": "46,58,81,82",
    "211": "46,58,82",
    "212": "46,58,82,84",
    "213": "46,58,84",
    "214": "46,58,86",
    "215": "46,62",
    "216": "46,63",
    "217": "46,63,74,75,77",
    "218": "46,74,75,77,79",
    "219": "46,74,77",
    "220": "46,75,79",
    "221": "47",
    "222": "47,48,67,71",
    "223": "47,50,55",
    "224": "47,50,86",
    "225": "47,55,69,71",
    "226": "47,55,86",
    "227": "47,57",
    "228": "47,57,59,72,74",
    "229": "47,59",
    "230": "47,59,74",
    "231": "47,59,74,76",
    "232": "47,59,76,78",
    "233": "47,59,78,79",
    "234": "47,60",
    "235": "47,67",
    "236": "47,67,69",
    "237": "47,69",
    "238": "47,86",
    "239": "48",
    "240": "48,49,60,61",
    "241": "48,50,51,53,67",
    "242": "48,50,59,60,67,69",
    "243": "48,50,67,69",
    "244": "48,50,74,75,77,79",
    "245": "48,50,77,80",
    "246": "48,51",
    "247": "48,51,56",
    "248": "48,51,75,79",
    "249": "48,52,55,60,64,67,72",
    "250": "48,52,55,60,67",
    "251": "48,52,55,60,79",
    "252": "48,52,55,70",
    "253": "48,52,55,74,76",
    "254": "48,52,60",
    "255": "48,52,67",
    "256": "48,53,59",
    "257": "48,53,60,65,76,77",
    "258": "48,53,69",
    "259": "48,53,77",
    "260": "48,53,77,79",
    "261": "48,55,64,65",
    "262": "48,55,76,77",
    "263": "48,56,60,68",
    "264": "48,56,75",
    "265": "48,57,58,65",
    "266": "48,57,65",
    "267": "48,57,77",
    "268": "48,58,64,67",
    "269": "48,58,65,69",
    "270": "48,59",
    "271": "48,60",
    "272": "48,60,64,67,72",
    "273": "48,60,69",
    "274": "48,60,69,71",
    "275": "48,60,71,72",
    "276": "48,60,72",
    "277": "48,60,72,74",
    "278": "48,60,74,76",
    "279": "48,60,76",
    "280": "48,60,76,77",
    "281": "48,60,76,79",
    "282": "48,60,76,84",
    "283": "48,60,77,79",
    "284": "48,60,79,81",
    "285": "48,60,79,82",
    "286": "48,60,82",
    "287": "48,63",
    "288": "48,63,75,79",
    "289": "48,64",
    "290": "48,64,67,72",
    "291": "48,67",
    "292": "48,69",
    "293": "48,69,71",
    "294": "48,69,76",
    "295": "48,71",
    "296": "48,72",
    "297": "48,74,76",
    "298": "48,76",
    "299": "48,77",
    "300": "48,79",
    "301": "48,79,81",
    "302": "48,80",
    "303": "49,50,67",
    "304": "49,51,61,63",
    "305": "49,52,55",
    "306": "49,57,69",
    "307": "49,61,70,73",
    "308": "49,61,73",
    "309": "49,61,73,77",
