{
  "token_to_id": {
    "100": 1,
    "101": 2,
    "21,33,45,57": 3,
    "24,28,31,36,40,43,48": 4,
    "24,33,36,45,48,57,60,69": 5,
    "24,36,40,43": 6,
    "24,36,48": 7,
    "25,30,34,37,49,54,58,61": 8,
    "25,32,37,44,49,53,56": 9,
    "25,33,37,45,49,57,61,69": 10,
    "25,37,49,61": 11,
    "25,49,52,61,68,73": 12,
    "25,61,73": 13,
    "26,33,34,38,50,54,55,57,58,62": 14,
    "26,33,38,50,54,57,62": 15,
    "26,33,38,57,62,66,69": 16,
    "26,38": 17,
    "26,38,50,62": 18,
    "27,30,34,39,51,54,58,63": 19,
    "27,31,34,39,51": 20,
    "27,31,34,39,51,63": 21,
    "27,31,34,39,58,70": 22,
    "27,33,39,45,51,57,63,69": 23,
    "27,34,39,55,58,63,67": 24,
    "27,39,51": 25,
    "27,39,51,63": 26,
    "28": 27,
    "28,29,40,41,52,53,64,65": 28,
    "28,33,40,45,52,57,64,69": 29,
    "28,39": 30,
    "28,40,52": 31,
    "28,40,52,64": 32,
    "28,40,71,80,83": 33,
    "28,52": 34,
    "29": 35,
    "29,33,41,45,53,57,65,69": 36,
    "29,34,37,41,53,58,61,65": 37,
    "29,38,47,50,56": 38,
    "29,40": 39,
    "29,41,53": 40,
    "29,41,53,57,63,65": 41,
    "29,41,53,65": 42,
    "29,41,74,77,86": 43,
    "30": 44,
    "30,31,42,43": 45,
    "30,33,42,45,54,57,66,69": 46,
    "30,34,37,42,54,58,61,66": 47,
    "30,36,39,42,57,63,69": 48,
    "30,38,85,89,97": 49,
    "30,42": 50,
    "30,42,53,57,63,65": 51,
    "30,42,54": 52,
    "30,42,54,58,61,66,78,82,85,90": 53,
    "30,42,54,66": 54,
    "31,32,43,44": 55,
    "31,33,43,45,55,57,67,69": 56,
    "31,34,43": 57,
    "31,35,43": 58,
    "31,37,40,43,82,85,88,94": 59,
    "31,38,43,47,50,55,59,62": 60,
    "31,39,85,89,97": 61,
    "31,40,46,49": 62,
    "31,43": 63,
    "31,43,53,58,63,65": 64,
    "31,43,55": 65,
    "31,43,55,59,62,67": 66,
    "31,43,55,67": 67,
    "32": 68,
    "32,100": 69,
    "32,33": 70,
    "32,33,37,38,41,42": 71,
    "32,33,48,52,57": 72,
    "32,36,38,44,89,96,98,101": 73,
    "32,37,40,44,51,56,63": 74,
    "32,37,44,49,80,84,85,92": 75,
    "32,37,44,56,61,68": 76,
    "32,38,47,50,53": 77,
    "32,39,44,47,51,56": 78,
    "32,39,44,48,54,60": 79,
    "32,40": 80,
    "32,43": 81,
    "32,44": 82,
    "32,44,50,54,59": 83,
    "32,44,51,63,82,83,87,94,95": 84,
    "32,44,53,59,63,65": 85,
    "32,44,54,56,60,63,68": 86,
    "32,44,56": 87,
    "32,44,56,59,63": 88,
    "32,44,56,68": 89,
    "32,44,68": 90,
    "32,44,86,94,98": 91,
    "32,48,51,54,56": 92,
    "32,48,54,56,60,64,68": 93,
    "32,49,53,56": 94,
    "32,50,54,56": 95,
    "32,73,80": 96,
    "32,75,80": 97,
    "32,76": 98,
    "32,85,92,93": 99,
    "33": 100,
    "33,34,35": 101,
    "33,34,38,39,42,43": 102,
    "33,34,45,46": 103,
    "33,34,45,46,57,58,69,70": 104,
    "33,34,45,46,88,89,92,93,100,101": 105,
    "33,35,45,47,59,72,76": 106,
    "33,36,40,45,81,84,88,93": 107,
    "33,36,45,48,57,69,72,76": 108,
    "33,36,48,52,57": 109,
    "33,37,40,45,52": 110,
    "33,37,40,45,52,57,61,64": 111,
    "33,37,40,45,81,85,88,93": 112,
    "33,37,40,45,81,85,93": 113,
    "33,37,40,45,88,93,97,100": 114,
    "33,37,40,45,93,97,105": 115,
    "33,37,45,49": 116,
    "33,38,42,45,57,62,66,69": 117,
    "33,39,48,51,54": 118,
    "33,40,45,49,52,53,61,64": 119,
    "33,40,45,49,52,57,61,64": 120,
    "33,40,45,49,52,57,61,64,69,81,85,93": 121,
    "33,40,45,49,52,61,64": 122,
    "33,40,45,49,53,61,64": 123,
    "33,40,45,81,85,93": 124,
    "33,41,73,77,85": 125,
    "33,42,45,49,54,61": 126,
    "33,42,45,54,66": 127,
    "33,45": 128,
    "33,45,48,51,54,57,60,63,66,69": 129,
    "33,45,52": 130,
    "33,45,52,57": 131,
    "33,45,52,57,61,64,83,85,95,97": 132,
    "33,45,53,57,61,65,85,97": 133,
    "33,45,53,60,63,65": 134,
    "33,45,54,56,60,63,68": 135,
    "33,45,57": 136,
    "33,45,57,60,64": 137,
    "33,45,57,61,64,69,81,85,88,93": 138,
    "33,45,57,62,66,69,74,78,81": 139,
    "33,45,57,64,69": 140,
    "33,45,57,69": 141,
    "33,45,64,69": 142,
    "33,45,69,72,76": 143,
    "33,45,69,81": 144,
    "33,45,76,88": 145,
    "33,45,81,93": 146,
    "33,45,83,85,95,97": 147,
    "33,45,83,95": 148,
    "33,45,84,88,96": 149,
    "33,45,85,97": 150,
    "33,45,86,98": 151,
    "33,45,88,93,97,100": 152,
    "33,48,52,57": 153,
    "33,73": 154,
    "34": 155,
    "34,35,36": 156,
    "34,35,39,40,43,44": 157,
    "34,35,46,47": 158,
    "34,35,46,47,87,88,91,92,99,100": 159,
    "34,36": 160,
    "34,37,42,46,58,61,66,70": 161,
    "34,37,46,49,58,61,70,73": 162,
    "34,38,41,46,58,62,65,70": 163,
    "34,38,41,46,74,77,82,86": 164,
    "34,38,41,46,89,94,98,101": 165,
    "34,40,46,52,58,64,70,76": 166,
    "34,41,44,46,58,62,65,70": 167,
    "34,41,46,50,53,58": 168,
    "34,41,46,50,53,58,62": 169,
    "34,41,46,86,94,98": 170,
    "34,41,50,53,58,62,65": 171,
    "34,43,46,55,58,67,70,79": 172,
    "34,44,53,56,61,65": 173,
    "34,46": 174,
    "34,46,49,52,58,61,64,70": 175,
    "34,46,50,62": 176,
    "34,46,51,54,58,63,66,70": 177,
    "34,46,53,58,62,65": 178,
    "34,46,53,60,65,84,86,92,94,96,98": 179,
    "34,46,56,62,70": 180,
    "34,46,58": 181,
    "34,46,58,70": 182,
    "34,46,63,66,70,75": 183,
    "34,46,70,82": 184,
    "34,46,74,77,86": 185,
    "34,46,75,78,82,87": 186,
    "34,46,82,94": 187,
    "34,46,84,92,96": 188,
    "34,62,65": 189,
    "34,62,68,77": 190,
    "34,84,92": 191,
    "35": 192,
    "35,36": 193,
    "35,36,37": 194,
    "35,36,47,48": 195,
    "35,36,47,48,60,93,98,100": 196,
    "35,36,47,48,74,77,80,86": 197,
    "35,36,47,48,86,87,90,91,98,99": 198,
    "35,37,42,47,64,66": 199,
    "35,37,49,53,56": 200,
    "35,38,41,44,47,74,77,80,86": 201,
    "35,40,47,49": 202,
    "35,40,47,52,59,64,71,76": 203,
    "35,41,44,50": 204,
    "35,41,44,50,53,56,62": 205,
    "35,42,45,47,51,57,63": 206,
    "35,42,47,54": 207,
    "35,42,54,59": 208,
    "35,42,59,63,66": 209,
    "35,44,51,56,63": 210,
    "35,44,53,56,62,65": 211,
    "35,45,52,54": 212,
    "35,46,51,58,63": 213,
    "35,47": 214,
    "35,47,53,57,63,65": 215,
    "35,47,54,59,62,66,74,78,83,86": 216,
    "35,47,55,59,64,67": 217,
    "35,47,59": 218,
    "35,47,59,71": 219,
    "35,47,59,76,80": 220,
    "35,47,59,80,86,88": 221,
    "35,47,59,86,88": 222,
    "35,47,74,77,80,86": 223,
    "35,47,75,78,82,87": 224,
    "35,47,75,78,87": 225,
    "35,47,77,82,86,89": 226,
    "35,47,82,86,89,94": 227,
    "35,47,83,95": 228,
    "35,47,88,92": 229,
    "35,47,92,98,100": 230,
    "35,50,54,56": 231,
    "35,52": 232,
    "35,52,56,59,64": 233,
    "35,52,56,64": 234,
    "35,52,64": 235,
    "35,64": 236,
    "35,69": 237,
    "36,37,48,49": 238,
    "36,37,48,49,60,61,72,73": 239,
    "36,38,48,50": 240,
    "36,40,48,52,60,64,72,76": 241,
    "36,40,88,96,100": 242,
    "36,43,51,55,60,63,67": 243,
    "36,43,52,55,60,64,67": 244,
    "36,45,51,54,57,66": 245,
    "36,48": 246,
    "36,48,51,54,57,60,69": 247,
    "36,48,51,54,60,63,66,72": 248,
    "36,48,51,54,60,69,81": 249,
    "36,48,53,56,60,65,68,72": 250,
    "36,48,55,60,63": 251,
    "36,48,60": 252,
    "36,48,60,72": 253,
    "36,48,60,81,84,88": 254,
    "36,48,60,84,88": 255,
    "36,48,60,88,93": 256,
    "36,48,72,76": 257,
    "36,48,72,76,84": 258,
    "36,48,74,77,80,86": 259,
    "36,48,76,81": 260,
    "36,48,81,93": 261,
    "37": 262,
    "37,38": 263,
    "37,38,43,45,50,51,57,62": 264,
    "37,38,43,45,50,55,57,62": 265,
    "37,38,44,49,50,84,85,89,90,96,97": 266,
    "37,38,49,50": 267,
    "37,38,49,50,61,62,73,74": 268,
    "37,38,49,50,69,76,79,81": 269,
    "37,39": 270,
    "37,40,43,45": 271,
    "37,40,43,45,49,69,76,79,81": 272,
    "37,40,45,49,81,85,93": 273,
    "37,40,49,52,61,64,73,76": 274,
    "37,41,44,49,80,85,89": 275,
    "37,41,44,49,85,89,92,97": 276,
    "37,41,46,49,58,70": 277,
    "37,42,43,46,52,58,64,67": 278,
    "37,42,45,49,57,61,69": 279,
    "37,42,49,54": 280,
    "37,42,54,58": 281,
    "37,42,58,64,66": 282,
    "37,43,46,49,61,64,70,73": 283,
    "37,43,49,55,61,67,73,79": 284,
    "37,44": 285,
    "37,44,46,52,56,58": 286,
    "37,44,49,52,56,61": 287,
    "37,44,49,52,56,64": 288,
    "37,44,49,52,61": 289,
    "37,44,49,53,56": 290,
    "37,44,49,53,56,61": 291,
    "37,44,49,53,56,61,65,68,73,85,89,97": 292,
    "37,44,49,85,89,97": 293,
    "37,44,53,56,61": 294,
    "37,45,61,65,73": 295,
    "37,46,53,58": 296,
    "37,49": 297,
    "37,49,52,56,61": 298,
    "37,49,52,56,61,64": 299,
    "37,49,52,61,64,68,73": 300,
    "37,49,53,56": 301,
    "37,49,56": 302,
    "37,49,61": 303,
    "37,49,61,64,68,73": 304,
    "37,49,61,65,73": 305,
    "37,49,61,73": 306,
    "37,49,66,69,78": 307,
    "37,49,69,76,79,81": 308,
    "37,49,70,78,82": 309,
    "37,49,71,77,83": 310,
    "37,49,73,85": 311,
    "37,49,75,83,87": 312,
    "37,49,78,81,90": 313,
    "37,49,78,82,90": 314,
    "37,49,80,85,92": 315,
    "37,57,61,64,73": 316,
    "37,61": 317,
    "37,61,73": 318,
    "37,69": 319,
    "37,73": 320,
    "38": 321,
    "38,39,40": 322,
    "38,39,42,45,50,54,57,62": 323,
    "38,39,50,51": 324,
    "38,39,51": 325,
    "38,40,50,52,62,64,74,76": 326,
    "38,41": 327,
    "38,41,45,50,77,81,86,89": 328,
    "38,41,50,53,62,65,74,77": 329,
    "38,41,50,68,71,80": 330,
    "38,42,43,47,50,55,59,62,67": 331,
    "38,42,43,47,50,55,59,67": 332,
    "38,42,45,50,62,66,69,74": 333,
    "38,42,45,50,86,90,98": 334,
    "38,42,47,50,54,59": 335,
    "38,43,50,54,55,57,58,70,76,82": 336,
    "38,43,50,54,57,70,76,82": 337,
    "38,43,50,55,62,67,74,79": 338,
    "38,43,50,70,76,82": 339,
    "38,45,50,52,56,74,77,86": 340,
    "38,45,50,53,57,62,69": 341,
    "38,45,50,74,77,86": 342,
    "38,46,53,58,65,68,70": 343,
    "38,47,50,55,59,62,67": 344,
    "38,47,53,56,59,65": 345,
    "38,50": 346,
    "38,50,62": 347,
    "38,50,62,74": 348,
    "38,50,69,76,79,81": 349,
    "38,50,74,77,80,86": 350,
    "38,50,74,86": 351,
    "38,50,77,82,86,89": 352,
    "38,50,83,89,92,95": 353,
    "38,50,84,90,96": 354,
    "38,54": 355,
    "38,57,60,66": 356,
    "38,59": 357,
    "38,66": 358,
    "38,71": 359,
    "39": 360,
    "39,40": 361,
    "39,40,44,47,52,53,59,64": 362,
    "39,40,44,47,52,56,59,64": 363,
    "39,40,44,47,52,59,64": 364,
    "39,40,45,48,52,53,60,64": 365,
    "39,40,45,48,52,57,60,64": 366,
    "39,40,45,48,52,60,64": 367,
    "39,40,45,48,53,60,64": 368,
    "39,40,51,52": 369,
    "39,41,51,53": 370,
    "39,41,53": 371,
    "39,42": 372,
    "39,42,43,48,55,60,67": 373,
    "39,42,46,54,58,63,66,70": 374,
    "39,43,48,51,72,75,84": 375,
    "39,43,51,55,63,67,75,79": 376,
    "39,44,45,48,51,57,59,66,69": 377,
    "39,44,45,48,51,57,60,66,69": 378,
    "39,44,45,48,51,57,66,69": 379,
    "39,44,45,48,51,59,66,69": 380,
    "39,45,48,51,57,60,66,69": 381,
    "39,45,48,51,57,60,69": 382,
    "39,46": 383,
    "39,46,49,51,63,67,73,75": 384,
    "39,46,51": 385,
    "39,46,51,54,58,63": 386,
    "39,46,51,55,58,63": 387,
    "39,46,51,55,58,63,67": 388,
    "39,46,51,55,58,65,67": 389,
    "39,46,51,55,63": 390,
    "39,46,51,58": 391,
    "39,46,51,63,67,75": 392,
    "39,46,53,65,68,77": 393,
    "39,46,54,58": 394,
    "39,46,54,58,66,70": 395,
    "39,46,54,66,69,78": 396,
    "39,46,55,58,63": 397,
    "39,46,55,58,63,67": 398,
    "39,46,55,63": 399,
    "39,46,55,63,70": 400,
    "39,46,55,67,70,79": 401,
    "39,46,56,58,65": 402,
    "39,46,56,62,65": 403,
    "39,46,56,62,67": 404,
    "39,46,57,58,66": 405,
    "39,46,58": 406,
    "39,46,58,67": 407,
    "39,46,60": 408,
    "39,46,62": 409,
    "39,46,63,67": 410,
    "39,47,48,54,57,59": 411,
    "39,47,50,53,65,68,77": 412,
    "39,47,51,57,66,69": 413,
    "39,47,56,62,65": 414,
    "39,48,51,57,66,69": 415,
    "39,48,51,59,66,69": 416,
    "39,49,54,57,61,66,69": 417,
    "39,49,54,66": 418,
    "39,51": 419,
    "39,51,53,62,65,79,84,87,91,92,96": 420,
    "39,51,55,58,67": 421,
    "39,51,55,63,67,82,91,94": 422,
    "39,51,63": 423,
    "39,51,63,75": 424,
    "39,51,75,87": 425,
    "39,51,78,90": 426,
    "39,51,79,82,87,91": 427,
    "39,51,79,87,91": 428,
    "39,51,82,91,94": 429,
    "39,53": 430,
    "39,55": 431,
    "39,55,60": 432,
    "39,56,61,65,70": 433,
    "39,58": 434,
    "39,58,60": 435,
    "39,58,63": 436,
    "39,59": 437,
    "39,60,62": 438,
    "39,63": 439,
    "39,63,65,67,68": 440,
    "39,63,67": 441,
    "39,65,67,68,70": 442,
    "39,65,68": 443,
    "39,67,75": 444,
    "39,70": 445,
    "39,70,75,82": 446,
    "39,71": 447,
    "39,80,87,96": 448,
    "40": 449,
    "40,41": 450,
    "40,41,52,53": 451,
    "40,41,52,53,64,65,76,77": 452,
    "40,42": 453,
    "40,42,44,45,47,52,76,78,80,81,83,88": 454,
    "40,42,45,52,88,90,93,100": 455,
    "40,42,52,54": 456,
    "40,43": 457,
    "40,43,48,52,84,88,91,96": 458,
    "40,43,52,55,64,67,76,79": 459,
    "40,44,47,52,56,59,64": 460,
    "40,44,47,52,64,68,71,76": 461,
    "40,44,47,52,68,71,80": 462,
    "40,44,47,52,71,76,80,83": 463,
    "40,44,47,52,76,80,83,88": 464,
    "40,44,47,52,88,92,95,100": 465,
    "40,44,49,52,56": 466,
    "40,44,51,52": 467,
    "40,44,52,56,64,68,76,80": 468,
    "40,45,48,52,57,60,64": 469,
    "40,45,48,52,57,60,64,69": 470,
    "40,45,49,52,64,69,73,76": 471,
    "40,45,49,52,88,93,97,100": 472,
    "40,45,49,55,57,58,61,69": 473,
    "40,45,49,55,57,61,69": 474,
    "40,45,49,55,58,61,69": 475,
    "40,45,49,55,61,62,69": 476,
    "40,45,52,76,85,88": 477,
    "40,46,49,55,58,61,67": 478,
    "40,46,49,55,61,67": 479,
    "40,47,48,52,57,59": 480,
    "40,47,50,52,59,68,71": 481,
    "40,47,50,52,88,95,98,100": 482,
    "40,47,50,56,62,68,71,76": 483,
    "40,47,50,56,68,80": 484,
    "40,47,50,56,74,83,86": 485,
    "40,47,52,55,64,67": 486,
    "40,47,52,56,59": 487,
    "40,47,52,56,64": 488,
    "40,47,52,56,64,68": 489,
    "40,47,52,56,64,71": 490,
    "40,47,52,64,68,76": 491,
    "40,47,52,71,80,83": 492,
    "40,47,52,80,83,92": 493,
    "40,47,56,59,64": 494,
    "40,47,56,59,64,66": 495,
    "40,47,56,59,64,68": 496,
    "40,47,56,59,64,71": 497,
    "40,47,56,64": 498,
    "40,48,55,67,72,79": 499,
    "40,49,52,57,61,64,69,73,81": 500,
    "40,49,52,57,64,69,73,81": 501,
    "40,49,52,61,69": 502,
    "40,49,52,61,69,73": 503,
    "40,49,57,61,69,73": 504,
    "40,49,57,76,81,88": 505,
    "40,49,57,88,93,100": 506,
    "40,51": 507,
    "40,51,52": 508,
    "40,52": 509,
    "40,52,55,59,64": 510,
    "40,52,56,59,64": 511,
    "40,52,56,59,64,68,71,76,80,92": 512,
    "40,52,56,59,64,76,80,88": 513,
    "40,52,56,64": 514,
    "40,52,59,62,64,68": 515,
    "40,52,64": 516,
    "40,52,64,76": 517,
    "40,52,68,71,80": 518,
    "40,52,69,76,79,81": 519,
    "40,52,72,76,79,84": 520,
    "40,52,76,80": 521,
    "40,52,76,88": 522,
    "40,52,80,88,92": 523,
    "40,55,64,71,76": 524,
    "40,56": 525,
    "40,56,59": 526,
    "40,56,62,64,71": 527,
    "40,56,62,64,71,76": 528,
    "40,56,64": 529,
    "40,56,64,71": 530,
    "40,57": 531,
    "40,57,61": 532,
    "40,62": 533,
    "40,62,64,68": 534,
    "40,64": 535,
    "40,68": 536,
    "40,69": 537,
    "41": 538,
    "41,43,53,55": 539,
    "41,43,53,55,65,67,77,79": 540,
    "41,44": 541,
    "41,44,45": 542,
    "41,44,46,53,58,62,65,70": 543,
    "41,44,49,61,65,73": 544,
    "41,44,53,56": 545,
    "41,44,53,56,65,68,77,80": 546,
    "41,45": 547,
    "41,45,48,53,57,60,65,69,72,77,89,93,101": 548,
    "41,45,48,53,89,93,101": 549,
    "41,45,50,53,57,58,62,69": 550,
    "41,45,50,53,57,62,69": 551,
    "41,45,51,57,69,75,81,87": 552,
    "41,46,53,58,62": 553,
    "41,46,53,58,65,70": 554,
    "41,46,53,58,65,70,77,82": 555,
    "41,47,48,50,57,59": 556,
    "41,47,48,51,57,59": 557,
    "41,48,57,65,69,77": 558,
    "41,48,57,65,72,81": 559,
    "41,48,57,69,72,81": 560,
    "41,49,53,61,65": 561,
    "41,49,56,61,68,73": 562,
    "41,50,53,57,65": 563,
    "41,53": 564,
    "41,53,56,62,65,71,74,83": 565,
    "41,53,58,70": 566,
    "41,53,63,68,71": 567,
    "41,53,65": 568,
    "41,53,65,69,77": 569,
    "41,53,65,77": 570,
    "41,53,68,71,80": 571,
    "41,53,69,72,81": 572,
    "41,53,69,76,79,81": 573,
    "41,53,70,73,82": 574,
    "41,53,74,77,86": 575,
    "41,53,77,80,89": 576,
    "41,53,77,81,89": 577,
    "41,53,77,89": 578,
    "41,53,82,85,94": 579,
    "41,60,65,68": 580,
    "41,65,77": 581,
    "41,70,74,77,82,86": 582,
    "41,70,82": 583,
    "42": 584,
    "42,43": 585,
    "42,43,54,55": 586,
    "42,44": 587,
    "42,44,54,56": 588,
    "42,44,56": 589,
    "42,45,48,50,54,57": 590,
    "42,45,49,54,78,90": 591,
    "42,45,50,54,57,62,66": 592,
    "42,46,47,49,51,54,59,61,63,66,70,71,73,75": 593,
    "42,46,47,49,51,54,59,73,75,78,82,83,85,87": 594,
    "42,46,49,54,61,66,70,73": 595,
    "42,46,49,54,66,70,73,78": 596,
    "42,46,49,54,73,78,82,85": 597,
    "42,46,51,58,63,70": 598,
    "42,46,51,58,70,75,82,87": 599,
    "42,46,54,63,75": 600,
    "42,46,58,63": 601,
    "42,47,54,75,83,87": 602,
    "42,48,51,57,60,63": 603,
    "42,49,54,57,61,66": 604,
    "42,50,54,66,74,78": 605,
    "42,54": 606,
    "42,54,58,64,66": 607,
    "42,54,63,68,71": 608,
    "42,54,66": 609,
    "42,54,66,78": 610,
    "42,54,75,87": 611,
    "42,54,81,85,93": 612,
    "42,57,62": 613,
    "42,57,62,69": 614,
    "42,57,62,69,74": 615,
    "42,57,62,78,90": 616,
    "43": 617,
    "43,44": 618,
    "43,44,55,56": 619,
    "43,44,55,56,78,79,82,83,90,91": 620,
    "43,45,48,51,54,69,72,81": 621,
    "43,45,48,51,54,72,75,84": 622,
    "43,46,55,58,67,70,79,82": 623,
    "43,46,55,73,76,85": 624,
    "43,47,50,55,83,86,91,95": 625,
    "43,47,51,59,71,75,83,87": 626,
    "43,48,52,55,79,84,88,91": 627,
    "43,50,55,58,62": 628,
    "43,50,55,59,67,71": 629,
    "43,50,59,67": 630,
    "43,51,55,82,87,94": 631,
    "43,52,58,61,64,73": 632,
    "43,53,56,59,71,74,83": 633,
    "43,55": 634,
    "43,55,63,68,71": 635,
    "43,55,67,79": 636,
    "43,55,79,91": 637,
    "44": 638,
    "44,45": 639,
    "44,45,56,57": 640,
    "44,45,56,57,68,69,80,81": 641,
    "44,46,50,58,62,70": 642,
    "44,47,52,56,59,64": 643,
    "44,47,52,56,64,76": 644,
    "44,47,52,76,80,83,88": 645,
    "44,47,53": 646,
    "44,47,56,64,74,76": 647,
    "44,47,56,76,86,88": 648,
    "44,48,51,54,56": 649,
    "44,48,51,60,72,75,84,87": 650,
    "44,49,51,56": 651,
    "44,50,56,61,64,77,83,89": 652,
    "44,50,56,77,83,89": 653,
    "44,51": 654,
    "44,51,56,59,63,68": 655,
    "44,51,56,60,66,72": 656,
    "44,51,56,60,66,72,80": 657,
    "44,51,56,71,75,80,83": 658,
    "44,51,60,68": 659,
    "44,52,54,56,60,64,68": 660,
    "44,52,56,59,64,71": 661,
    "44,52,59,74,86": 662,
    "44,52,59,75,87": 663,
    "44,53,60,65,72,77": 664,
    "44,56": 665,
    "44,56,57,69": 666,
    "44,56,59,64,68,71,76,80": 667,
    "44,56,59,65,68,74,77,86": 668,
    "44,56,61,64,73": 669,
    "44,56,63,68,71": 670,
    "44,56,64,68,76": 671,
    "44,56,64,71,76": 672,
    "44,56,68,80": 673,
    "44,56,71,75,80,83": 674,
    "44,56,73,77,85": 675,
    "44,59,63,65": 676,
    "44,65,73": 677,
    "44,66,75": 678,
    "44,68,72": 679,
    "44,68,77": 680,
    "44,72,75": 681,
    "44,72,75,84": 682,
    "44,75,80": 683,
    "44,76,80": 684,
    "44,85,92,93": 685,
    "45": 686,
    "45,46,57,58,69,70,81,82": 687,
    "45,46,57,58,76,77,80,81,88,89": 688,
    "45,47": 689,
    "45,47,49,50,52,76,81,83,85,86,88": 690,
    "45,47,57,59": 691,
    "45,47,57,59,69,71,81,83": 692,
    "45,48,52,57,60,64,69": 693,
    "45,48,52,57,64,69": 694,
    "45,48,52,57,69,72,81": 695,
    "45,48,53,57,60,65": 696,
    "45,48,53,57,75,84,87": 697,
    "45,49,51": 698,
    "45,49,52,57,61,69,73": 699,
    "45,49,52,57,69,73,76,81": 700,
    "45,49,52,57,88,93,97,100": 701,
    "45,49,52,76,81,85,88": 702,
    "45,49,54,57,81,85,90": 703,
    "45,49,57": 704,
    "45,49,57,59": 705,
    "45,49,57,76,81,88": 706,
    "45,49,57,81,93": 707,
    "45,50,52,56,59,64,71": 708,
    "45,50,53,57,62,65,69": 709,
    "45,50,54,57,69,74,78,81": 710,
    "45,51,57,78,84,90": 711,
    "45,52": 712,
    "45,52,54,57,64,76": 713,
    "45,52,54,57,64,76,88": 714,
    "45,52,56,59,64,76": 715,
    "45,52,56,59,64,76,88": 716,
    "45,52,56,59,68,83": 717,
    "45,52,56,62,64,71": 718,
    "45,52,56,64,71": 719,
    "45,52,56,64,76": 720,
    "45,52,56,64,76,88": 721,
    "45,52,57": 722,
    "45,52,57,60,61,63,64,73,81,85": 723,
    "45,52,57,60,64": 724,
    "45,52,57,60,64,69,72,81": 725,
    "45,52,57,60,64,72": 726,
    "45,52,57,61,64,69": 727,
    "45,52,57,61,64,73": 728,
    "45,52,57,61,64,76": 729,
    "45,52,57,61,64,76,88": 730,
    "45,52,57,61,69": 731,
    "45,52,57,61,69,73": 732,
    "45,52,57,61,69,85": 733,
    "45,52,57,61,73": 734,
    "45,52,57,61,76,81,85,93": 735,
    "45,52,57,61,85,93,97": 736,
    "45,52,57,64,73": 737,
    "45,52,57,69,72,81": 738,
    "45,52,57,69,73,76,81,88": 739,
    "45,52,57,69,73,81": 740,
    "45,52,57,73,81,85": 741,
    "45,52,57,81,84,88,93": 742,
    "45,52,59,62,68,83": 743,
    "45,52,59,62,68,86": 744,
    "45,52,59,64,74": 745,
    "45,52,60,72,76,84": 746,
    "45,52,61": 747,
    "45,52,61,69,76,85": 748,
    "45,52,61,69,85": 749,
    "45,52,61,73,85": 750,
    "45,52,62,88,98,100": 751,
    "45,52,73,76,85": 752,
    "45,53": 753,
    "45,54,60,63,66,75": 754,
    "45,55,57,64,73": 755,
    "45,55,58,61,73,76,85": 756,
    "45,56,62,64,71": 757,
    "45,57": 758,
    "45,57,58,70": 759,
    "45,57,61,64": 760,
    "45,57,64,69,72,76": 761,
    "45,57,64,69,73": 762,
    "45,57,68,80": 763,
    "45,57,69,72,81": 764,
    "45,57,69,81": 765,
    "45,57,73,76,85": 766,
    "45,57,77,81,89": 767,
    "45,59": 768,
    "45,61": 769,
    "45,61,64,69,76,85": 770,
    "45,64,73": 771,
    "45,64,73,76,83,85": 772,
    "45,69": 773,
    "45,73,76": 774,
    "45,73,85": 775,
    "46": 776,
    "46,47,51,58,59,63,70,71,75": 777,
    "46,47,58,59": 778,
    "46,47,58,59,70,71,82,83": 779,
    "46,49,52,58,61,64": 780,
    "46,49,58,61,70,73,82,85": 781,
    "46,50,53,58": 782,
    "46,50,53,58,74,77,86": 783,
    "46,50,55": 784,
    "46,50,55,56": 785,
    "46,50,56": 786,
    "46,50,58,82,94": 787,
    "46,51": 788,
    "46,51,57,58": 789,
    "46,51,58": 790,
    "46,52,55,61,64,67,73,76": 791,
    "46,52,58,79,85,91": 792,
    "46,53": 793,
    "46,53,56,58,62,70": 794,
    "46,53,56,62": 795,
    "46,53,56,62,64,65,67,68": 796,
    "46,53,56,62,65,68": 797,
    "46,53,58,62": 798,
    "46,53,58,62,65": 799,
    "46,53,58,62,65,70": 800,
    "46,53,58,62,68,74": 801,
    "46,53,58,62,82,86,89,94": 802,
    "46,53,58,65": 803,
    "46,53,60": 804,
    "46,53,62": 805,
    "46,53,62,65,70,77": 806,
    "46,54,58,60,63": 807,
    "46,54,58,62": 808,
    "46,54,63": 809,
    "46,55": 810,
    "46,55,58": 811,
    "46,55,58,61,64": 812,
    "46,55,61,64,70,76": 813,
    "46,55,63": 814,
    "46,55,63,67": 815,
    "46,55,63,75": 816,
    "46,55,64,73": 817,
    "46,55,75,87": 818,
    "46,57,58,69": 819,
    "46,58": 820,
    "46,58,59,71": 821,
    "46,58,61,65,70,73,77,82": 822,
    "46,58,62,65": 823,
    "46,58,62,65,70,74": 824,
    "46,58,65,77": 825,
    "46,58,70": 826,
    "46,58,70,82": 827,
    "46,58,73,76,85": 828,
    "46,58,76,88": 829,
    "46,58,78,82,90": 830,
    "46,58,85,89,97": 831,
    "46,58,89,94,98,101": 832,
    "46,62,74": 833,
    "46,62,74,77": 834,
    "46,65,77,82": 835,
    "46,67,79": 836,
    "46,70,82": 837,
    "46,74,77,86": 838,
    "46,74,86": 839,
    "46,79,91": 840,
    "46,82,94": 841,
    "46,86,98": 842,
    "47": 843,
    "47,48": 844,
    "47,48,57,59": 845,
    "47,48,59,60": 846,
    "47,48,59,60,71,72,83,84": 847,
    "47,49,51,59,61,63,71,73,75": 848,
    "47,49,59,61,71,73,83,85": 849,
    "47,51,54,59,63,66,71,75": 850,
    "47,51,54,59,71,75,78,83": 851,
    "47,51,54,59,75,78,83,87": 852,
    "47,51,56,59,86,100": 853,
    "47,52": 854,
    "47,52,54,60,76,81,84,90": 855,
    "47,52,54,61,64,69,73,78": 856,
    "47,52,56,59,71,76,80,83": 857,
    "47,52,56,62": 858,
    "47,54,57,59,63,71": 859,
    "47,54,57,63,69,71": 860,
    "47,54,57,63,71": 861,
    "47,54,62,86,98": 862,
    "47,56,59,64,71": 863,
    "47,57": 864,
    "47,57,59": 865,
    "47,59": 866,
    "47,59,62,68,71,77,80,89": 867,
    "47,59,71": 868,
    "47,59,71,83": 869,
    "47,59,75,78,87": 870,
    "47,78,90": 871,
    "47,80,92": 872,
    "47,81,93": 873,
    "48": 874,
    "48,49,60,61": 875,
    "48,49,60,61,72,73,84,85": 876,
    "48,50": 877,
    "48,50,54,56": 878,
    "48,50,60,62": 879,
    "48,51,54,60,63,66": 880,
    "48,51,55,60,63,67,72": 881,
    "48,51,55,60,63,67,75": 882,
    "48,51,55,60,67,72,75,79": 883,
    "48,51,57": 884,
    "48,52": 885,
    "48,52,55,60,64,67": 886,
    "48,52,55,60,72,76,79,84": 887,
    "48,52,57": 888,
    "48,52,57,60,72,76,81,84": 889,
    "48,52,57,69": 890,
    "48,53": 891,
    "48,55,60,63": 892,
    "48,55,60,64,72,74": 893,
    "48,55,63,67,72": 894,
    "48,55,63,72,74": 895,
    "48,57,59": 896,
    "48,57,64,76,81,88": 897,
    "48,59,60,71": 898,
    "48,60": 899,
    "48,60,61,73": 900,
    "48,60,64,67": 901,
    "48,60,64,72": 902,
    "48,60,69,76,81": 903,
    "48,60,72,84": 904,
    "48,67,79": 905,
    "48,68,75,80": 906,
    "48,72,84": 907,
    "48,75,81,87": 908,
    "49": 909,
    "49,50,52,61,62,64": 910,
    "49,50,61,62,73,74,85,86": 911,
    "49,51": 912,
    "49,51,61,63": 913,
    "49,52,55,57": 914,
    "49,52,55,57,85,88,93": 915,
    "49,52,56,61,64": 916,
    "49,52,56,64,68": 917,
    "49,52,57": 918,
    "49,52,61,64,73,76,85,88": 919,
    "49,54,57,61,66,69": 920,
    "49,54,58,61,66,70,73,78": 921,
    "49,55,58,70,82": 922,
    "49,56": 923,
    "49,56,61,63,64,68,71,76": 924,
    "49,56,61,64,68,73": 925,
    "49,56,61,65,73": 926,
    "49,56,61,77,80,89": 927,
    "49,56,65,68": 928,
    "49,56,68,77,80": 929,
    "49,56,80,87": 930,
    "49,56,87,92,94": 931,
    "49,56,89,90,92,94": 932,
    "49,56,89,92": 933,
    "49,57,61,64,67,69": 934,
    "49,57,61,69,76": 935,
    "49,57,64,71,83": 936,
    "49,57,64,73,76": 937,
    "49,57,76,85,88": 938,
    "49,57,76,88": 939,
    "49,57,81,90,93": 940,
    "49,61": 941,
    "49,61,64,68,73": 942,
    "49,61,64,68,73,76,80,85": 943,
    "49,61,64,69": 944,
    "49,61,71,76,80,83": 945,
    "49,61,73,85": 946,
    "49,61,76,81,85,88": 947,
    "49,61,85,94,97": 948,
    "49,65,73": 949,
    "49,66,73": 950,
    "49,66,73,78": 951,
    "49,68,73,80": 952,
    "49,73": 953,
    "49,73,77": 954,
    "49,73,85": 955,
    "49,75,78": 956,
    "49,77,80": 957,
    "49,78": 958,
    "49,80": 959,
    "49,81": 960,
    "49,82,90,97": 961,
    "49,83": 962,
    "49,83,89,97": 963,
    "49,85,97": 964,
    "49,89,97": 965,
    "49,90,97": 966,
    "50": 967,
    "50,51": 968,
    "50,51,62,63": 969,
    "50,51,62,63,74,75,86,87": 970,
    "50,52,62,64,74,76,86,88": 971,
    "50,53": 972,
    "50,53,56,62,74": 973,
    "50,53,56,62,89,92,98": 974,
    "50,53,57,58": 975,
    "50,53,58": 976,
    "50,53,58,65,77": 977,
    "50,53,62,65": 978,
    "50,54,57,62,74,78,81,86": 979,
    "50,54,57,66,74": 980,
    "50,57,59": 981,
    "50,57,62,74,77,86": 982,
    "50,58,77,82": 983,
    "50,59": 984,
    "50,59,65,77,80,89": 985,
    "50,61,62,73": 986,
    "50,62": 987,
    "50,62,63,75": 988,
    "50,62,65,77": 989,
    "50,62,66,71,74": 990,
    "50,62,66,71,86": 991,
    "50,62,74": 992,
    "50,62,74,77,86": 993,
    "50,62,74,86": 994,
    "50,62,83,89,92,95": 995,
    "51": 996,
    "51,52": 997,
    "51,52,63,64": 998,
    "51,53": 999,
    "51,53,57,69,81": 1000,
    "51,54,59,66,69": 1001,
    "51,54,63,66": 1002,
    "51,55,58,63": 1003,
    "51,55,58,67,70": 1004,
    "51,55,60": 1005,
    "51,56": 1006,
    "51,56,59,63": 1007,
    "51,56,59,63,68": 1008,
    "51,58": 1009,
    "51,58,63,67": 1010,
    "51,58,63,67,70,79": 1011,
    "51,58,63,67,75": 1012,
    "51,58,67,70,79,82": 1013,
    "51,59,66,69": 1014,
    "51,59,66,69,71": 1015,
    "51,59,66,70": 1016,
    "51,59,66,70,71": 1017,
    "51,59,66,71": 1018,
    "51,59,66,71,73": 1019,
    "51,59,66,71,80,81,83,85": 1020,
    "51,59,66,71,80,83": 1021,
    "51,59,66,73": 1022,
    "51,61,67,70": 1023,
    "51,61,81,93": 1024,
    "51,63": 1025,
    "51,63,66,78": 1026,
    "51,63,67,70": 1027,
    "51,63,70,75,79,82": 1028,
    "51,63,75,87": 1029,
    "51,63,91,94,99,103": 1030,
    "51,80,83": 1031,
    "51,82,91,94": 1032,
    "52": 1033,
    "52,53": 1034,
    "52,53,56,59,64,65,76,77,80,83,88,89": 1035,
    "52,53,64,65": 1036,
    "52,53,64,65,76,77,88,89": 1037,
    "52,53,64,68,69": 1038,
    "52,53,76,77": 1039,
    "52,54": 1040,
    "52,54,76,78": 1041,
    "52,55,58,60,64,70": 1042,
    "52,55,58,64,67,70": 1043,
    "52,55,59,60": 1044,
    "52,55,60": 1045,
    "52,55,60,64": 1046,
    "52,55,60,72,84": 1047,
    "52,55,64,67,76,79,88,91": 1048,
    "52,56": 1049,
    "52,56,59": 1050,
    "52,56,59,64,68": 1051,
    "52,56,59,64,68,71,76": 1052,
    "52,56,59,64,71,74,76": 1053,
    "52,56,59,64,76,78,88,90": 1054,
    "52,56,59,64,76,80,83,88": 1055,
    "52,56,59,64,78,90": 1056,
    "52,56,59,68,71": 1057,
    "52,56,61,64,68,73": 1058,
    "52,56,61,64,68,73,76": 1059,
    "52,56,61,88,97,100": 1060,
    "52,56,63,64": 1061,
    "52,56,64": 1062,
    "52,56,64,68": 1063,
    "52,56,64,68,71": 1064,
    "52,56,64,68,76,80,88,92": 1065,
    "52,56,64,68,78": 1066,
    "52,56,64,76,88": 1067,
    "52,56,68,71": 1068,
    "52,56,68,76,80": 1069,
    "52,56,76,80": 1070,
    "52,57,59": 1071,
    "52,57,59,64,71,76,81,83": 1072,
    "52,57,61,64,69": 1073,
    "52,57,61,64,69,73": 1074,
    "52,57,61,64,69,73,76": 1075,
    "52,57,61,64,73": 1076,
    "52,57,61,64,76": 1077,
    "52,57,61,64,81,93": 1078,
    "52,57,61,69,73": 1079,
    "52,57,64,69": 1080,
    "52,57,76,78,85": 1081,
    "52,59,62,64,68": 1082,
    "52,59,62,64,68,76": 1083,
    "52,59,62,64,71": 1084,
    "52,59,62,68,80": 1085,
    "52,59,62,71,80,83": 1086,
    "52,59,64,68": 1087,
    "52,59,64,68,71,76": 1088,
    "52,59,64,68,71,76,80": 1089,
    "52,59,64,68,71,76,80,88": 1090,
    "52,59,64,71": 1091,
    "52,59,64,76,80": 1092,
    "52,59,64,80,92": 1093,
    "52,59,64,88,92": 1094,
    "52,59,68,71": 1095,
    "52,59,68,71,83,85,92,93,95,97": 1096,
    "52,59,68,71,83,92,95": 1097,
    "52,59,68,76": 1098,
    "52,59,71,76,78,80": 1099,
    "52,59,71,76,78,80,81": 1100,
    "52,59,71,80,83,88": 1101,
    "52,59,78,80,81,83": 1102,
    "52,59,88,90,92,93": 1103,
    "52,60,67,79": 1104,
    "52,61,64": 1105,
    "52,61,64,69,73": 1106,
    "52,61,64,69,85": 1107,
    "52,61,64,73,81": 1108,
    "52,61,69": 1109,
    "52,62,64,68,71": 1110,
    "52,62,68,71": 1111,
    "52,63,64,75": 1112,
    "52,64": 1113,
    "52,64,65,77": 1114,
    "52,64,66,69": 1115,
    "52,64,68": 1116,
    "52,64,68,71": 1117,
    "52,64,68,71,76,78": 1118,
    "52,64,68,73": 1119,
    "52,64,68,80": 1120,
    "52,64,71,76": 1121,
    "52,64,71,76,80": 1122,
    "52,64,71,80": 1123,
    "52,64,71,80,83,88,90": 1124,
    "52,64,71,88,92": 1125,
    "52,64,72,76,79,84": 1126,
    "52,64,72,81,84": 1127,
    "52,64,73,76,85,88": 1128,
    "52,64,76": 1129,
    "52,64,76,80,83,88": 1130,
    "52,64,76,88": 1131,
    "52,68,71,74,83": 1132,
    "52,68,71,76,78": 1133,
    "52,68,76,80,88": 1134,
    "52,71,76,78,80": 1135,
    "52,71,78,80,81,83": 1136,
    "52,71,83,88,90,92": 1137,
    "52,76": 1138,
    "52,76,88": 1139,
    "53": 1140,
    "53,54": 1141,
    "53,54,62,66,71": 1142,
    "53,54,65,66": 1143,
    "53,54,72,77,81": 1144,
    "53,55": 1145,
    "53,55,65,67,77,79,89,91": 1146,
    "53,56": 1147,
    "53,56,57": 1148,
    "53,56,61,73,77,85": 1149,
    "53,56,62,80,89": 1150,
    "53,56,65,68": 1151,
    "53,56,65,68,77,80,89,92": 1152,
    "53,57": 1153,
    "53,57,60,69,72,77,81,84": 1154,
    "53,57,61,62": 1155,
    "53,57,61,65,85,97": 1156,
    "53,57,62": 1157,
    "53,57,63,65,75": 1158,
    "53,57,63,65,77": 1159,
    "53,57,63,75,81,87": 1160,
    "53,57,65,69": 1161,
    "53,57,69,77,81": 1162,
    "53,58,62,65,74,77,86": 1163,
    "53,58,62,74": 1164,
    "53,58,62,74,77,86": 1165,
    "53,58,65,70,77,82,89,94": 1166,
    "53,58,70,74,77": 1167,
    "53,58,74,77,82": 1168,
    "53,58,82,86,89": 1169,
    "53,58,86,89,94": 1170,
    "53,59,65,68,74": 1171,
    "53,59,67,74": 1172,
    "53,60,65,86,94,98": 1173,
    "53,61,68,73,80,85": 1174,
    "53,62": 1175,
    "53,62,65": 1176,
    "53,62,65,84,92,96": 1177,
    "53,65": 1178,
    "53,65,72,81,84": 1179,
    "53,65,74,86": 1180,
    "53,65,76,77,88,89": 1181,
    "53,65,77": 1182,
    "53,65,77,89": 1183,
    "53,68,76,81,88": 1184,
    "53,69,76,81,88": 1185,
    "53,69,81": 1186,
    "53,69,81,82": 1187,
    "53,70,74,82": 1188,
    "53,70,82": 1189,
    "53,72,77,81": 1190,
    "53,77,89": 1191,
    "53,81,88": 1192,
    "54": 1193,
    "54,55": 1194,
    "54,55,66,67": 1195,
    "54,56": 1196,
    "54,56,60,65,73": 1197,
    "54,56,78,80": 1198,
    "54,57": 1199,
    "54,57,60,62,66,69,74": 1200,
    "54,57,62,66,74,78": 1201,
    "54,57,66,69": 1202,
    "54,57,66,69,78,81": 1203,
    "54,58": 1204,
    "54,58,64,78,90": 1205,
    "54,58,66,70": 1206,
    "54,59,62,71": 1207,
    "54,59,63": 1208,
    "54,59,63,66,75": 1209,
    "54,60,69,74": 1210,
    "54,61,70,78": 1211,
    "54,62,66,71": 1212,
    "54,62,71": 1213,
    "54,65,73,77,82,85,89,90": 1214,
    "54,66": 1215,
    "54,66,70,82": 1216,
    "54,66,71,83": 1217,
    "54,66,82,90,97": 1218,
    "54,66,88,97,100": 1219,
    "54,69,76,82,88": 1220,
    "54,70,76,82": 1221,
    "54,73,85": 1222,
    "54,78": 1223,
    "54,81": 1224,
    "55": 1225,
    "55,56": 1226,
    "55,56,67,68": 1227,
    "55,57": 1228,
    "55,58,61,67,70,73": 1229,
    "55,58,62": 1230,
    "55,58,63,67": 1231,
    "55,58,63,67,70,75,79": 1232,
    "55,58,63,67,70,75,82": 1233,
    "55,58,63,67,75,79,87": 1234,
    "55,58,64,72,76,84": 1235,
    "55,58,67": 1236,
    "55,58,67,70,79,82,91,94": 1237,
    "55,59,62,67,79,83,86,91": 1238,
    "55,60,63,67,72,75": 1239,
    "55,60,63,75,84,87": 1240,
    "55,60,64": 1241,
    "55,60,64,65": 1242,
    "55,62": 1243,
    "55,62,67,71,74": 1244,
    "55,62,67,72,74": 1245,
    "55,62,67,79,83,91": 1246,
    "55,63": 1247,
    "55,63,67,70,75,82": 1248,
    "55,63,67,82,91,94": 1249,
    "55,63,68": 1250,
    "55,63,82,87,94": 1251,
    "55,67": 1252,
    "55,67,70,75,79": 1253,
    "55,67,79": 1254,
    "55,70,76,83": 1255,
    "55,71,76,83": 1256,
    "56": 1257,
    "56,57": 1258,
    "56,57,59,60,64": 1259,
    "56,57,59,60,64,65,68,69,76,77": 1260,
    "56,57,61,73,81,85": 1261,
    "56,57,68": 1262,
    "56,57,68,69": 1263,
    "56,57,68,69,80,81,92,93": 1264,
    "56,57,80,81": 1265,
    "56,58": 1266,
    "56,59": 1267,
    "56,59,63,68": 1268,
    "56,59,64": 1269,
    "56,59,64,66": 1270,
    "56,59,64,66,68,69,71": 1271,
    "56,59,64,68": 1272,
    "56,59,64,68,71": 1273,
    "56,59,64,68,76": 1274,
    "56,59,64,68,80": 1275,
    "56,59,64,71,80": 1276,
    "56,59,64,74": 1277,
    "56,59,64,76": 1278,
    "56,59,68,71": 1279,
    "56,59,68,76": 1280,
    "56,59,74,83,86": 1281,
    "56,60,63": 1282,
    "56,60,63,72,75": 1283,
    "56,60,66": 1284,
    "56,60,66,72,80": 1285,
    "56,60,66,75": 1286,
    "56,61": 1287,
    "56,61,64,68": 1288,
    "56,61,64,68,73": 1289,
    "56,61,64,68,73,76": 1290,
    "56,61,64,68,73,85": 1291,
    "56,61,64,68,76,80,85,88": 1292,
    "56,61,65": 1293,
    "56,61,65,68,73": 1294,
    "56,61,65,71,73,77,83,85": 1295,
    "56,61,65,71,77,83": 1296,
    "56,61,65,73": 1297,
    "56,61,65,73,80,85": 1298,
    "56,61,65,85,92,94": 1299,
    "56,61,68,89,92": 1300,
    "56,62,65,71": 1301,
    "56,63": 1302,
    "56,63,68,71": 1303,
    "56,63,71": 1304,
    "56,64": 1305,
    "56,64,68,71": 1306,
    "56,64,68,73,76,80,85": 1307,
    "56,64,68,73,76,80,88": 1308,
    "56,64,68,80,88,92": 1309,
    "56,64,71": 1310,
    "56,64,71,76,83": 1311,
    "56,64,71,76,83,85": 1312,
    "56,64,72": 1313,
    "56,65": 1314,
    "56,65,76,78,79,82": 1315,
    "56,66,72,75,80,87": 1316,
    "56,66,72,80,92": 1317,
    "56,68": 1318,
    "56,68,75": 1319,
    "56,68,77,82,86,89": 1320,
    "56,68,79,82,87,91": 1321,
    "56,68,80,92": 1322,
    "56,68,88,95,100": 1323,
    "56,71,76,84": 1324,
    "56,71,83": 1325,
    "56,72,76,84": 1326,
    "56,72,84": 1327,
    "56,73": 1328,
    "56,73,85": 1329,
    "56,80": 1330,
    "56,80,81": 1331,
    "56,83": 1332,
    "56,83,88,95": 1333,
    "56,83,89,97": 1334,
    "56,84": 1335,
    "56,85": 1336,
    "57": 1337,
    "57,58": 1338,
    "57,58,60": 1339,
    "57,58,69,70": 1340,
    "57,58,69,70,81,82,93,94": 1341,
    "57,58,70": 1342,
    "57,58,76,81,85": 1343,
    "57,59": 1344,
    "57,59,60,62,64": 1345,
    "57,59,61,64,69": 1346,
    "57,59,63,66": 1347,
    "57,59,66": 1348,
    "57,59,69": 1349,
    "57,59,81,83": 1350,
    "57,60": 1351,
    "57,60,64": 1352,
    "57,60,64,69": 1353,
    "57,60,64,69,81,84,88,93": 1354,
    "57,60,65": 1355,
    "57,60,65,72,77,81": 1356,
    "57,60,66,75,87": 1357,
    "57,60,66,76,88": 1358,
    "57,60,69,81": 1359,
    "57,60,72,81,84": 1360,
    "57,60,76": 1361,
    "57,61": 1362,
    "57,61,64,69": 1363,
    "57,61,64,69,73": 1364,
    "57,61,64,69,81,85,88,93": 1365,
    "57,61,64,69,81,85,93": 1366,
    "57,61,64,76,81,88": 1367,
    "57,61,64,88,93,100": 1368,
    "57,61,66,73": 1369,
    "57,61,68,73": 1370,
    "57,61,69": 1371,
    "57,61,69,73": 1372,
    "57,61,69,73,81,85": 1373,
    "57,61,69,81,85,93": 1374,
    "57,61,73,76": 1375,
    "57,61,81,85": 1376,
    "57,62,65,67": 1377,
    "57,62,66,71": 1378,
    "57,62,66,72,74": 1379,
    "57,63": 1380,
    "57,63,66,75,87": 1381,
    "57,63,69": 1382,
    "57,64": 1383,
    "57,64,69": 1384,
    "57,64,69,73": 1385,
    "57,64,69,81,85": 1386,
    "57,64,73,85,88,97": 1387,
    "57,64,76,78,85": 1388,
    "57,65": 1389,
    "57,65,69,74": 1390,
    "57,66": 1391,
    "57,66,69": 1392,
    "57,66,73,78": 1393,
    "57,67,69,76,85": 1394,
    "57,69": 1395,
    "57,69,70,82": 1396,
    "57,69,77,89": 1397,
    "57,69,81": 1398,
    "57,69,81,93": 1399,
    "57,69,84,96": 1400,
    "57,69,94,99,103": 1401,
    "57,72,84": 1402,
    "57,73": 1403,
    "57,76": 1404,
    "57,76,84": 1405,
    "57,78,85": 1406,
    "57,81": 1407,
    "57,84": 1408,
    "57,88": 1409,
    "58": 1410,
    "58,59": 1411,
    "58,59,70": 1412,
    "58,59,70,71": 1413,
    "58,60": 1414,
    "58,61": 1415,
    "58,61,65,77,85,89": 1416,
    "58,61,66,70,73,78,82,85": 1417,
    "58,61,66,70,78,82": 1418,
    "58,61,66,70,78,85,90": 1419,
    "58,61,66,73,78,82,85,90": 1420,
    "58,61,66,73,82,85": 1421,
    "58,61,66,78,82,90": 1422,
    "58,61,66,85,97": 1423,
    "58,61,70,73,82,85,94,97": 1424,
    "58,61,78,82": 1425,
    "58,62,63,75": 1426,
    "58,62,65,70,74": 1427,
    "58,62,65,70,74,77": 1428,
    "58,62,65,74,77": 1429,
    "58,62,65,74,77,82": 1430,
    "58,62,65,74,77,86": 1431,
    "58,62,65,77": 1432,
    "58,62,65,82,86,89": 1433,
    "58,62,65,86,89,94": 1434,
    "58,62,67": 1435,
    "58,62,67,70,74": 1436,
    "58,62,68,89,98": 1437,
    "58,62,70": 1438,
    "58,62,70,74": 1439,
    "58,62,70,74,77": 1440,
    "58,62,70,74,79": 1441,
    "58,62,70,82": 1442,
    "58,62,74,77,82": 1443,
    "58,62,74,82,86": 1444,
    "58,62,77,89": 1445,
    "58,63": 1446,
    "58,63,66,70,78": 1447,
    "58,63,67": 1448,
    "58,63,67,70": 1449,
    "58,63,67,70,75": 1450,
    "58,63,67,98,99": 1451,
    "58,64,67,73": 1452,
    "58,64,78,90": 1453,
    "58,65": 1454,
    "58,66": 1455,
    "58,66,70,73,78": 1456,
    "58,67,70,87,94": 1457,
    "58,67,73,76": 1458,
    "58,67,75,99": 1459,
    "58,67,76,85": 1460,
    "58,70": 1461,
    "58,70,74,79": 1462,
    "58,70,74,86": 1463,
    "58,70,82": 1464,
    "58,70,82,94": 1465,
    "58,70,85,92,97": 1466,
    "59": 1467,
    "59,60": 1468,
    "59,60,71,72": 1469,
    "59,60,71,72,83,84,95,96": 1470,
    "59,60,72": 1471,
    "59,60,83,84": 1472,
    "59,61": 1473,
    "59,61,64,69": 1474,
    "59,61,81,93,95": 1475,
    "59,62,64,68,71,74": 1476,
    "59,62,66,71": 1477,
    "59,62,66,78,86,90": 1478,
    "59,62,71,74": 1479,
    "59,63": 1480,
    "59,63,66": 1481,
    "59,63,66,69": 1482,
    "59,63,66,71,75,78,87": 1483,
    "59,63,66,75": 1484,
    "59,63,68": 1485,
    "59,63,68,71,80,83,87,92": 1486,
    "59,63,71,78,81": 1487,
    "59,63,78,83": 1488,
    "59,64": 1489,
    "59,64,66,68": 1490,
    "59,64,68": 1491,
    "59,64,68,71": 1492,
    "59,64,68,71,76": 1493,
    "59,64,68,71,76,80": 1494,
    "59,64,68,74": 1495,
    "59,64,68,76,80": 1496,
    "59,64,68,76,88": 1497,
    "59,64,71,80,88": 1498,
    "59,64,74,76,85,86": 1499,
    "59,64,74,76,86": 1500,
    "59,64,92": 1501,
    "59,65,68,74": 1502,
    "59,65,69,74": 1503,
    "59,65,74,78,79": 1504,
    "59,66": 1505,
    "59,66,68": 1506,
    "59,66,71,75": 1507,
    "59,66,71,83,86": 1508,
    "59,66,74,78,86": 1509,
    "59,66,75": 1510,
    "59,67": 1511,
    "59,68": 1512,
    "59,68,71": 1513,
    "59,68,73,80": 1514,
    "59,68,76": 1515,
    "59,71": 1516,
    "59,71,73,76": 1517,
    "59,71,75,81,83,90": 1518,
    "59,71,76,80,83,92": 1519,
    "59,71,80,92": 1520,
    "59,71,81,93": 1521,
    "59,71,83,95": 1522,
    "59,71,84,96": 1523,
    "59,73": 1524,
    "59,74,86": 1525,
    "59,81": 1526,
    "59,81,83,90": 1527,
    "59,83": 1528,
    "59,92": 1529,
    "60": 1530,
    "60,61": 1531,
    "60,61,63,64": 1532,
    "60,61,72": 1533,
    "60,61,72,73": 1534,
    "60,61,73": 1535,
    "60,62": 1536,
    "60,62,72,74,84,86,96,98": 1537,
    "60,62,84,86": 1538,
    "60,63": 1539,
    "60,63,66,68": 1540,
    "60,63,66,72": 1541,
    "60,63,68": 1542,
    "60,63,69": 1543,
    "60,63,69,72,77": 1544,
    "60,63,69,81": 1545,
    "60,64": 1546,
    "60,64,66,69,75": 1547,
    "60,64,67,72,76,79,84,88": 1548,
    "60,64,67,72,84,88,96": 1549,
    "60,64,69": 1550,
    "60,64,69,72,76,81": 1551,
    "60,64,72,76,79": 1552,
    "60,64,72,84": 1553,
    "60,64,76,79,88": 1554,
    "60,64,81,93": 1555,
    "60,64,84,88": 1556,
    "60,65,69,77,81,84": 1557,
    "60,65,69,81": 1558,
    "60,66,69,75": 1559,
    "60,67": 1560,
    "60,67,72,76": 1561,
    "60,67,72,76,84,86": 1562,
    "60,68": 1563,
    "60,68,72": 1564,
    "60,68,73,77": 1565,
    "60,68,75,80": 1566,
    "60,68,75,80,88": 1567,
    "60,69": 1568,
    "60,69,76,77,88,89": 1569,
    "60,70,72": 1570,
    "60,72": 1571,
    "60,72,75,80,84": 1572,
    "60,72,80": 1573,
    "60,72,81,93": 1574,
    "60,72,83,95": 1575,
    "60,72,84,96": 1576,
    "60,81": 1577,
    "60,84": 1578,
    "61": 1579,
    "61,62": 1580,
    "61,62,64,65": 1581,
    "61,62,64,65,77,83,89": 1582,
    "61,62,64,69": 1583,
    "61,62,73,74": 1584,
    "61,62,74": 1585,
    "61,63": 1586,
    "61,63,64,66": 1587,
    "61,63,67,70": 1588,
    "61,64": 1589,
    "61,64,67,70,76": 1590,
    "61,64,68": 1591,
    "61,64,68,69": 1592,
    "61,64,68,76,80": 1593,
    "61,64,69": 1594,
    "61,64,69,73": 1595,
    "61,64,69,76": 1596,
    "61,64,70": 1597,
    "61,64,73,76": 1598,
    "61,64,73,76,85,88": 1599,
    "61,64,76,88": 1600,
    "61,65": 1601,
    "61,65,67,68,70,73,80,82": 1602,
    "61,65,68,73": 1603,
    "61,65,70": 1604,
    "61,65,71": 1605,
    "61,65,71,73": 1606,
    "61,65,71,73,85": 1607,
    "61,65,71,77,80": 1608,
    "61,65,71,80": 1609,
    "61,65,71,85": 1610,
    "61,65,71,85,92,97": 1611,
    "61,65,71,97": 1612,
    "61,65,73,80,85": 1613,
    "61,65,80,85,92": 1614,
    "61,65,85,92,97": 1615,
    "61,65,85,97": 1616,
    "61,66,69,73": 1617,
    "61,66,69,73,78,81": 1618,
    "61,66,69,81": 1619,
    "61,66,69,81,90,93": 1620,
    "61,66,70": 1621,
    "61,66,70,73": 1622,
    "61,66,70,73,85": 1623,
    "61,66,70,78": 1624,
    "61,66,70,85": 1625,
    "61,66,70,85,94,97": 1626,
    "61,66,70,92": 1627,
    "61,66,70,97": 1628,
    "61,66,85,94,97": 1629,
    "61,67,70": 1630,
    "61,68,71,77": 1631,
    "61,68,73,76,80,85,87": 1632,
    "61,68,83,89": 1633,
    "61,69": 1634,
    "61,69,78,90": 1635,
    "61,70": 1636,
    "61,73": 1637,
    "61,73,80": 1638,
    "61,73,86,92,100": 1639,
    "61,76,79": 1640,
    "61,77,85,92": 1641,
    "61,78,85": 1642,
    "61,81,97": 1643,
    "61,82,97": 1644,
    "61,85": 1645,
    "62": 1646,
    "62,63": 1647,
    "62,63,66,67": 1648,
    "62,63,74": 1649,
    "62,63,74,75": 1650,
    "62,63,75": 1651,
    "62,64": 1652,
    "62,64,74,76,86,88,98,100": 1653,
    "62,64,86,88": 1654,
    "62,65": 1655,
    "62,65,68,70,77": 1656,
    "62,65,68,71": 1657,
    "62,65,69,77": 1658,
    "62,65,70": 1659,
    "62,65,70,73,77,83,89": 1660,
    "62,65,70,74": 1661,
    "62,65,70,74,77": 1662,
    "62,65,70,77": 1663,
    "62,65,71,83": 1664,
    "62,65,72,81,84": 1665,
    "62,65,74,77": 1666,
    "62,65,74,77,79": 1667,
    "62,65,74,77,82": 1668,
    "62,65,77,82": 1669,
    "62,65,86,89": 1670,
    "62,66,69,74": 1671,
    "62,66,69,74,86,90,93,98": 1672,
    "62,66,69,78,86": 1673,
    "62,68,71,78": 1674,
    "62,68,83,90": 1675,
    "62,69": 1676,
    "62,69,71,77": 1677,
    "62,69,71,78": 1678,
    "62,69,71,79": 1679,
    "62,69,71,80": 1680,
    "62,70": 1681,
    "62,70,74": 1682,
    "62,70,74,77": 1683,
    "62,71": 1684,
    "62,71,74": 1685,
    "62,71,78,79,90,91": 1686,
    "62,71,78,90": 1687,
    "62,74": 1688,
    "62,74,77": 1689,
    "62,74,77,82,86": 1690,
    "62,74,77,89": 1691,
    "62,74,78": 1692,
    "62,74,78,81,86": 1693,
    "62,74,83,95": 1694,
    "62,74,86": 1695,
    "62,74,86,98": 1696,
    "62,74,89,101": 1697,
    "62,77,81,86": 1698,
    "62,86": 1699,
    "63": 1700,
    "63,64": 1701,
    "63,64,66,67": 1702,
    "63,64,67,68,70,73": 1703,
    "63,64,75": 1704,
    "63,64,75,76": 1705,
    "63,65": 1706,
    "63,66": 1707,
    "63,66,70,71,78": 1708,
    "63,66,70,78": 1709,
    "63,66,71,75": 1710,
    "63,66,71,75,78,83": 1711,
    "63,67": 1712,
    "63,67,70": 1713,
    "63,67,73,82,87,94": 1714,
    "63,67,75,87,88": 1715,
    "63,68": 1716,
    "63,68,71": 1717,
    "63,68,72": 1718,
    "63,69,72,78": 1719,
    "63,69,73,78,81,85,90": 1720,
    "63,71": 1721,
    "63,72": 1722,
    "63,75": 1723,
    "63,75,79,82,87,91": 1724,
    "63,75,87": 1725,
    "63,75,87,99": 1726,
    "63,76,80": 1727,
    "63,87,99": 1728,
    "63,87,99,100": 1729,
    "64": 1730,
    "64,65": 1731,
    "64,65,67,68": 1732,
    "64,65,68,69": 1733,
    "64,65,68,71,76,77,88,89,92,95,100,101": 1734,
    "64,65,76": 1735,
    "64,65,76,77,88,89": 1736,
    "64,65,77": 1737,
    "64,65,88,89": 1738,
    "64,66": 1739,
    "64,66,68,69": 1740,
    "64,66,69": 1741,
    "64,67": 1742,
    "64,67,70": 1743,
    "64,67,72": 1744,
    "64,67,72,76": 1745,
    "64,68": 1746,
    "64,68,71": 1747,
    "64,68,71,76": 1748,
    "64,68,71,76,80,83": 1749,
    "64,68,71,76,88,92,95,100": 1750,
    "64,68,71,80,83": 1751,
    "64,68,71,83,92,95": 1752,
    "64,68,73": 1753,
    "64,68,76": 1754,
    "64,68,76,80": 1755,
    "64,69": 1756,
    "64,69,71,76": 1757,
    "64,69,72": 1758,
    "64,69,72,76": 1759,
    "64,69,72,81": 1760,
    "64,69,73": 1761,
    "64,69,73,76,81,85": 1762,
    "64,69,73,81,85": 1763,
    "64,69,73,85,93,97": 1764,
    "64,70,72": 1765,
    "64,71": 1766,
    "64,71,73,78,83": 1767,
    "64,71,76,80,83,92": 1768,
    "64,71,80": 1769,
    "64,72": 1770,
    "64,72,76": 1771,
    "64,72,80,81,92,93": 1772,
    "64,73": 1773,
    "64,73,76": 1774,
    "64,73,76,80,81": 1775,
    "64,73,76,88,97,100": 1776,
    "64,73,81": 1777,
    "64,76": 1778,
    "64,76,80": 1779,
    "64,76,83": 1780,
    "64,76,85": 1781,
    "64,76,88": 1782,
    "64,76,88,100": 1783,
    "64,76,89,101": 1784,
    "64,78": 1785,
    "64,79": 1786,
    "64,83": 1787,
    "64,84": 1788,
    "64,84,88,93": 1789,
    "64,88": 1790,
    "64,92": 1791,
    "65": 1792,
    "65,66,77": 1793,
    "65,67": 1794,
    "65,68": 1795,
    "65,68,70": 1796,
    "65,68,71,73,77,85,89": 1797,
    "65,68,71,74": 1798,
    "65,68,71,77,89,92,95,101": 1799,
    "65,68,73": 1800,
    "65,68,87,92,99": 1801,
    "65,69": 1802,
    "65,69,71": 1803,
    "65,69,71,74": 1804,
    "65,69,74": 1805,
    "65,69,74,77,86": 1806,
    "65,69,77,87,93,99": 1807,
    "65,69,77,87,93,99,101": 1808,
    "65,70": 1809,
    "65,70,77,82": 1810,
    "65,70,77,89,94": 1811,
    "65,71,73": 1812,
    "65,71,80": 1813,
    "65,72,74,75,77,81,82": 1814,
    "65,72,81": 1815,
    "65,73": 1816,
    "65,73,85,92,97": 1817,
    "65,73,97": 1818,
    "65,74": 1819,
    "65,74,80,92,94,96": 1820,
    "65,74,83": 1821,
    "65,76,84": 1822,
    "65,77": 1823,
    "65,77,82,89": 1824,
    "65,77,86,98": 1825,
    "65,77,89": 1826,
    "65,77,89,101": 1827,
    "65,89": 1828,
    "66": 1829,
    "66,67": 1830,
    "66,67,69,70": 1831,
    "66,67,79": 1832,
    "66,68": 1833,
    "66,68,69,71": 1834,
    "66,68,71,74": 1835,
    "66,69": 1836,
    "66,69,71,74": 1837,
    "66,69,73,80": 1838,
    "66,69,73,81": 1839,
    "66,69,74": 1840,
    "66,69,75": 1841,
    "66,69,78,81": 1842,
    "66,70": 1843,
    "66,70,71": 1844,
    "66,70,73,82": 1845,
    "66,70,77,87,94,99": 1846,
    "66,70,78,82": 1847,
    "66,70,78,85,90": 1848,
    "66,70,90,97": 1849,
    "66,71": 1850,
    "66,71,73,78": 1851,
    "66,71,73,78,80": 1852,
    "66,71,75": 1853,
    "66,73": 1854,
    "66,73,82,88": 1855,
    "66,74": 1856,
    "66,75": 1857,
    "66,78": 1858,
    "66,85,97": 1859,
    "66,87,97": 1860,
    "67": 1861,
    "67,100,103": 1862,
    "67,68": 1863,
    "67,68,71,72": 1864,
    "67,68,79": 1865,
    "67,68,79,80": 1866,
    "67,70": 1867,
    "67,70,75": 1868,
    "67,70,75,76,87": 1869,
    "67,70,75,79": 1870,
    "67,71": 1871,
    "67,71,76": 1872,
    "67,71,77,87,95,99": 1873,
    "67,72,76": 1874,
    "67,73": 1875,
    "67,73,83,88": 1876,
    "67,75": 1877,
    "67,76": 1878,
    "67,77": 1879,
    "67,79": 1880,
    "67,91,103": 1881,
    "68": 1882,
    "68,69": 1883,
    "68,69,70": 1884,
    "68,69,71,72": 1885,
    "68,69,71,73": 1886,
    "68,69,72,73": 1887,
    "68,69,80,81": 1888,
    "68,69,81": 1889,
    "68,71": 1890,
    "68,71,73,75,83": 1891,
