{
  "token_to_id": {
    "24,26,36,38,54,57,62": 1,
    "24,27,36,39,57,70,82": 2,
    "24,36,45,50,54": 3,
    "24,36,45,51,55,57": 4,
    "24,36,45,54": 5,
    "24,36,45,57": 6,
    "24,36,48": 7,
    "24,36,50,54": 8,
    "24,36,54,55": 9,
    "25,37": 10,
    "25,37,38,50,60,62,69": 11,
    "25,37,45": 12,
    "25,37,45,52,55,58": 13,
    "25,37,55,57,61,64": 14,
    "26": 15,
    "26,27,38,39,58,60,70,72": 16,
    "26,28,30,38,40,42,57,66,69,74": 17,
    "26,28,38,40,47,50,52,54,56,59": 18,
    "26,29,38,41,58,67,69": 19,
    "26,30,38,42,49,50,54,57,59": 20,
    "26,31,38,58,67": 21,
    "26,31,38,67,70": 22,
    "26,33,38,50,54,57": 23,
    "26,38": 24,
    "26,38,45": 25,
    "26,38,50": 26,
    "26,38,50,54,59": 27,
    "26,38,55,57,61,64": 28,
    "26,38,57,60,63": 29,
    "26,38,57,62,66": 30,
    "26,38,58,62": 31,
    "26,38,58,65,70": 32,
    "26,38,58,67": 33,
    "26,38,60,62,66": 34,
    "26,38,60,66,69": 35,
    "26,38,60,69": 36,
    "26,38,62,66,69": 37,
    "26,38,65,69,70": 38,
    "26,38,77,82,89": 39,
    "26,45": 40,
    "26,45,50,53,58": 41,
    "26,54,57,62": 42,
    "27,29,39,41,57,60": 43,
    "27,29,39,41,60,69,72": 44,
    "27,29,39,41,63,67,70": 45,
    "27,31,39,43,60,74,82,86": 46,
    "27,31,39,43,60,74,86": 47,
    "27,39,48,53,57": 48,
    "27,39,48,55,60": 49,
    "27,39,48,57": 50,
    "27,39,48,60": 51,
    "27,39,55,57,58,60": 52,
    "27,39,70,75": 53,
    "27,39,70,75,79,82": 54,
    "27,39,72,77,84": 55,
    "28,30,40,42,59,62,66,67": 56,
    "28,33,40,47,49,52,56,57": 57,
    "28,35,40,47,54,56,59,63,64": 58,
    "28,40,47,52,56": 59,
    "28,40,55,57,61,64": 60,
    "28,40,56,59,64": 61,
    "28,40,59,62,67": 62,
    "28,40,62": 63,
    "29,30,41,42,49,50,54,56,57,59": 64,
    "29,30,41,44,49,51,60,61": 65,
    "29,31,41,43,55,58,64": 66,
    "29,33,41,45,50,52,56,57,59,61": 67,
    "29,36,41,48,65,77": 68,
    "29,36,45,48": 69,
    "29,36,45,48,53": 70,
    "29,36,45,53": 71,
    "29,36,48,52": 72,
    "29,36,48,52,53": 73,
    "29,36,52,53": 74,
    "29,37,43,46": 75,
    "29,37,46,52": 76,
    "29,37,46,53": 77,
    "29,37,51,52": 78,
    "29,38,61,62,64": 79,
    "29,41,44": 80,
    "29,41,48": 81,
    "29,41,48,53,57": 82,
    "29,41,48,53,57,60": 83,
    "29,41,48,58,60,62": 84,
    "29,41,55,58,64": 85,
    "29,41,57,60,64,65": 86,
    "29,41,57,60,65": 87,
    "29,41,58": 88,
    "29,41,58,63,67": 89,
    "29,41,60": 90,
    "29,41,60,65": 91,
    "29,41,60,65,69": 92,
    "29,41,65,70,74,77": 93,
    "29,41,65,72,77": 94,
    "29,41,68,72,80": 95,
    "29,41,68,74,77": 96,
    "29,41,69,72,77": 97,
    "29,41,69,77": 98,
    "29,45": 99,
    "29,45,48,53": 100,
    "30,31,42,43,48,63,72": 101,
    "30,31,42,43,51,63": 102,
    "30,31,42,43,55,60,62,69": 103,
    "30,31,42,43,63,74,75": 104,
    "30,31,50,58,60": 105,
    "30,31,62,70,72": 106,
    "30,32,42,44,51,59": 107,
    "30,33,42,45,57,69": 108,
    "30,33,42,45,70,72": 109,
    "30,38,42,50,57,62,64,66,67,69,71": 110,
    "30,42,44,46,53,58,60": 111,
    "30,42,44,53,58,60": 112,
    "30,42,46,54,58,63": 113,
    "30,42,48": 114,
    "30,42,48,50,53,57,62": 115,
    "30,42,48,51,57": 116,
    "30,42,48,51,57,60": 117,
    "30,42,48,51,57,60,63": 118,
    "30,42,48,57,60": 119,
    "30,42,49,54,57": 120,
    "30,42,51,52,58,59,61": 121,
    "30,42,51,54,58,63": 122,
    "30,42,51,58,63": 123,
    "30,42,51,63": 124,
    "30,42,54,59,62": 125,
    "30,42,57,62,66,69": 126,
    "30,42,59,62,66": 127,
    "30,42,60,62,69": 128,
    "30,42,60,63,72": 129,
    "30,42,62,69,72,74": 130,
    "30,42,62,69,74": 131,
    "30,42,62,74": 132,
    "30,42,63": 133,
    "30,42,66,70": 134,
    "30,42,69,72,74": 135,
    "30,44,51,53,60": 136,
    "30,50,60": 137,
    "30,62,72,74": 138,
    "30,62,74": 139,
    "31": 140,
    "31,32,43,44,46,48": 141,
    "31,32,43,44,46,48,51,53,58": 142,
    "31,32,43,44,53,59,62": 143,
    "31,32,43,44,53,63,72": 144,
    "31,32,43,44,63,66,72": 145,
    "31,32,47,48,65,67": 146,
    "31,33,43,45,55,57,61,62,64,67,71": 147,
    "31,33,43,45,57,60,63": 148,
    "31,33,43,45,63,69,72,75": 149,
    "31,33,43,45,70,74": 150,
    "31,33,43,45,70,74,79": 151,
    "31,34": 152,
    "31,34,50,55": 153,
    "31,36,38,62,69,70": 154,
    "31,36,38,69": 155,
    "31,36,43,48,52,67,74,79": 156,
    "31,36,43,60,62": 157,
    "31,36,43,62,65,71": 158,
    "31,36,43,62,69,70": 159,
    "31,36,43,69": 160,
    "31,38": 161,
    "31,38,43,50,58,63,67": 162,
    "31,38,43,50,62,66,69": 163,
    "31,38,43,50,65,68,74": 164,
    "31,38,43,50,69,70,72,74,78,79": 165,
    "31,38,55": 166,
    "31,38,55,62": 167,
    "31,38,57,60,63": 168,
    "31,38,58": 169,
    "31,38,58,62": 170,
    "31,38,58,67": 171,
    "31,38,60,62,66": 172,
    "31,38,62": 173,
    "31,38,62,66,69": 174,
    "31,38,62,67,70": 175,
    "31,38,62,70": 176,
    "31,38,67,69,72": 177,
    "31,38,67,70": 178,
    "31,38,67,70,74": 179,
    "31,38,67,72": 180,
    "31,38,69": 181,
    "31,38,70,72,74,79": 182,
    "31,38,70,74": 183,
    "31,38,72,75,79": 184,
    "31,38,72,79": 185,
    "31,41,43,53,58,62,65": 186,
    "31,43": 187,
    "31,43,45,51,57,63": 188,
    "31,43,46,51,58": 189,
    "31,43,48": 190,
    "31,43,48,52,55,60": 191,
    "31,43,48,63": 192,
    "31,43,50": 193,
    "31,43,50,55": 194,
    "31,43,50,55,57": 195,
    "31,43,50,55,57,58": 196,
    "31,43,50,57": 197,
    "31,43,50,57,58": 198,
    "31,43,50,58": 199,
    "31,43,50,58,60": 200,
    "31,43,50,60,62": 201,
    "31,43,50,65,67": 202,
    "31,43,51,57,60": 203,
    "31,43,51,58,63": 204,
    "31,43,51,60,62": 205,
    "31,43,51,63": 206,
    "31,43,53": 207,
    "31,43,53,55,59,62": 208,
    "31,43,53,55,67": 209,
    "31,43,53,59": 210,
    "31,43,53,59,62": 211,
    "31,43,53,59,62,67": 212,
    "31,43,53,62": 213,
    "31,43,55": 214,
    "31,43,55,58,62,64": 215,
    "31,43,55,60,62": 216,
    "31,43,55,62,65,71,72": 217,
    "31,43,55,62,65,72": 218,
    "31,43,56,60": 219,
    "31,43,56,65": 220,
    "31,43,57": 221,
    "31,43,57,58": 222,
    "31,43,57,62,66,69": 223,
    "31,43,57,65": 224,
    "31,43,58": 225,
    "31,43,58,60": 226,
    "31,43,58,62,63": 227,
    "31,43,58,62,65": 228,
    "31,43,58,62,67": 229,
    "31,43,58,64,65": 230,
    "31,43,58,67": 231,
    "31,43,59,62": 232,
    "31,43,59,62,64": 233,
    "31,43,59,65": 234,
    "31,43,60,62": 235,
    "31,43,60,62,69": 236,
    "31,43,60,65": 237,
    "31,43,60,69": 238,
    "31,43,62": 239,
    "31,43,62,63,71,72": 240,
    "31,43,62,64,67,71": 241,
    "31,43,62,65": 242,
    "31,43,62,65,71": 243,
    "31,43,62,65,72": 244,
    "31,43,62,66,69": 245,
    "31,43,62,67,69,70": 246,
    "31,43,62,67,70": 247,
    "31,43,62,67,71": 248,
    "31,43,62,70": 249,
    "31,43,62,71": 250,
    "31,43,63": 251,
    "31,43,63,65,72,74": 252,
    "31,43,63,72": 253,
    "31,43,65,67,74,79": 254,
    "31,43,65,68,74": 255,
    "31,43,65,70,74": 256,
    "31,43,65,74": 257,
    "31,43,67": 258,
    "31,43,67,69,72": 259,
    "31,43,67,70": 260,
    "31,43,67,70,72,74": 261,
    "31,43,67,70,74": 262,
    "31,43,67,72": 263,
    "31,43,68": 264,
    "31,43,69": 265,
    "31,43,70,72,74,79": 266,
    "31,43,70,74": 267,
    "31,43,70,74,79": 268,
    "31,43,72,75,79": 269,
    "31,43,72,79": 270,
    "31,43,74,79,82": 271,
    "31,43,75": 272,
    "31,43,82,94": 273,
    "31,47,50,59,60,67": 274,
    "31,47,50,60,67": 275,
    "31,47,50,62,63,67": 276,
    "31,47,50,63,67": 277,
    "31,47,50,65,67": 278,
    "31,47,50,67": 279,
    "31,47,55,62": 280,
    "31,47,57,59,67,69": 281,
    "31,47,59,67": 282,
    "31,47,60,62,67": 283,
    "31,47,62,67": 284,
    "31,47,63,65,67": 285,
    "31,47,65,67": 286,
    "31,50,55": 287,
    "31,50,58": 288,
    "31,50,62": 289,
    "31,55,57": 290,
    "31,55,59,62": 291,
    "31,62": 292,
    "31,62,70": 293,
    "31,70,79": 294,
    "32,33,44,45,52,57,61": 295,
    "32,34,46,48,62,63": 296,
    "32,38,44,50,63,65,66,69,72,74": 297,
    "32,44,48": 298,
    "32,44,50,51,53,57,62": 299,
    "32,44,51": 300,
    "32,44,51,54,60": 301,
    "32,44,51,54,60,63": 302,
    "32,44,51,59": 303,
    "32,44,52": 304,
    "32,44,52,59,62": 305,
    "32,44,52,59,62,65": 306,
    "32,44,53,59,61,62": 307,
    "32,44,60,63,72": 308,
    "32,44,60,67": 309,
    "32,44,62,65,70": 310,
    "32,44,63": 311,
    "32,44,63,66,72": 312,
    "32,48,50,63": 313,
    "32,48,50,63,65": 314,
    "32,48,65": 315,
    "32,63,68": 316,
    "33,34,45,46,48,64,72": 317,
    "33,34,45,46,50,62": 318,
    "33,34,45,46,61,62,67,69": 319,
    "33,34,45,46,62,67,73,74": 320,
    "33,34,45,46,66,74": 321,
    "33,34,48,50,54,55": 322,
    "33,34,64,67,73": 323,
    "33,34,65,74,75": 324,
    "33,35,45,47": 325,
    "33,35,45,47,53,56,62": 326,
    "33,35,45,47,54,57,59,61,63,66": 327,
    "33,35,45,47,61,67,71,73": 328,
    "33,36,43,63,69,72": 329,
    "33,36,63,69,72": 330,
    "33,38,43,63,70,72": 331,
    "33,38,43,70": 332,
    "33,38,45,50,54,55,57,61,62,64": 333,
    "33,38,45,50,57,66": 334,
    "33,38,45,50,67,69,72,78,79": 335,
    "33,38,45,55,61,62,64": 336,
    "33,38,45,59,67,69,71": 337,
    "33,38,45,64,69,73": 338,
    "33,38,63,70,72": 339,
    "33,38,64,65,67,73,74": 340,
    "33,38,70": 341,
    "33,40,45,52,59,61,64,68,69": 342,
    "33,40,47,56,62,64": 343,
    "33,40,49,52,57": 344,
    "33,40,61,64": 345,
    "33,40,62,64": 346,
    "33,43,63,72": 347,
    "33,45": 348,
    "33,45,48": 349,
    "33,45,48,53,57": 350,
    "33,45,48,53,57,60": 351,
    "33,45,49,52,57": 352,
    "33,45,52": 353,
    "33,45,52,57,59,61,62": 354,
    "33,45,52,57,60,71": 355,
    "33,45,52,57,61": 356,
    "33,45,52,57,61,64,67,71": 357,
    "33,45,52,61,64": 358,
    "33,45,53,60,65": 359,
    "33,45,55,57,61,64": 360,
    "33,45,55,60,62": 361,
    "33,45,55,61,64": 362,
    "33,45,55,64": 363,
    "33,45,57,58,64,69": 364,
    "33,45,57,61,64,69": 365,
    "33,45,57,61,66": 366,
    "33,45,57,62,64,66": 367,
    "33,45,57,62,66": 368,
    "33,45,57,62,66,69": 369,
    "33,45,57,64,65,69,73,74": 370,
    "33,45,57,64,69": 371,
    "33,45,57,64,69,72": 372,
    "33,45,58,61,69": 373,
    "33,45,59,67,71": 374,
    "33,45,60,62": 375,
    "33,45,60,62,69": 376,
    "33,45,61,64,69": 377,
    "33,45,61,67,73": 378,
    "33,45,62,63": 379,
    "33,45,62,64,67,71": 380,
    "33,45,62,67,70": 381,
    "33,45,62,70": 382,
    "33,45,63,67": 383,
    "33,45,63,69": 384,
    "33,45,64,67,68": 385,
    "33,45,64,67,68,69": 386,
    "33,45,64,67,69": 387,
    "33,45,64,69,73": 388,
    "33,45,66,75": 389,
    "33,45,67,70": 390,
    "33,45,67,72": 391,
    "33,45,72,74": 392,
    "33,45,74,75": 393,
    "33,45,75": 394,
    "33,46,65,77": 395,
    "33,48,54": 396,
    "33,50,52,55": 397,
    "33,52,57,61": 398,
    "33,52,57,62": 399,
    "33,63,66,72,75": 400,
    "33,63,72": 401,
    "33,65,66,73,75": 402,
    "33,65,75,77": 403,
    "33,65,77": 404,
    "34": 405,
    "34,35,46,47,64,67,74,76": 406,
    "34,36,46,48,50,51,56,60,62": 407,
    "34,36,46,48,51,56,58": 408,
    "34,36,46,48,62,70": 409,
    "34,36,46,48,63,69,72": 410,
    "34,36,46,48,72,74": 411,
    "34,36,55,63,65": 412,
    "34,37,64,67,69,73": 413,
    "34,38": 414,
    "34,38,46,50,62,63,65,67": 415,
    "34,38,46,50,65,68,74": 416,
    "34,41,46,48,72,74": 417,
    "34,41,46,50,56,57,60,62,63": 418,
    "34,41,46,51,53,57,58": 419,
    "34,41,46,53,62,65,70": 420,
    "34,41,48,50,53,57,58,63,65": 421,
    "34,41,50,58,65,70": 422,
    "34,41,51,57,65,70": 423,
    "34,45,46,60,62,74,75": 424,
    "34,45,60,75": 425,
    "34,46": 426,
    "34,46,48": 427,
    "34,46,48,50,52,55,62": 428,
    "34,46,48,50,63,65,77,79": 429,
    "34,46,48,52,55,60": 430,
    "34,46,48,52,55,60,64": 431,
    "34,46,48,62,63,75,77": 432,
    "34,46,48,62,63,77": 433,
    "34,46,50": 434,
    "34,46,50,53,55,58": 435,
    "34,46,50,53,58": 436,
    "34,46,50,55,58": 437,
    "34,46,50,56,62": 438,
    "34,46,50,57": 439,
    "34,46,50,57,58": 440,
    "34,46,50,58": 441,
    "34,46,50,60": 442,
    "34,46,50,60,62": 443,
    "34,46,50,62": 444,
    "34,46,51,58": 445,
    "34,46,53,55,69,70,72": 446,
    "34,46,53,58,60,62,72,74": 447,
    "34,46,53,58,62": 448,
    "34,46,55": 449,
    "34,46,55,57": 450,
    "34,46,55,58,63,70": 451,
    "34,46,55,62": 452,
    "34,46,55,62,67": 453,
    "34,46,56,57,71,72,74": 454,
    "34,46,56,60,63,68,72": 455,
    "34,46,57,58": 456,
    "34,46,58": 457,
    "34,46,58,60": 458,
    "34,46,58,62": 459,
    "34,46,60,64": 460,
    "34,46,60,64,72": 461,
    "34,46,62": 462,
    "34,46,62,63": 463,
    "34,46,62,64,67": 464,
    "34,46,62,67,74": 465,
    "34,46,62,68": 466,
    "34,46,62,72,74": 467,
    "34,46,62,74": 468,
    "34,46,62,77": 469,
    "34,46,63,66": 470,
    "34,46,63,72": 471,
    "34,46,64": 472,
    "34,46,64,65,67": 473,
    "34,46,65,68,74": 474,
    "34,46,65,70": 475,
    "34,46,65,74": 476,
    "34,46,67,70": 477,
    "34,46,67,72,75": 478,
    "34,46,67,74": 479,
    "34,46,67,75": 480,
    "34,46,68": 481,
    "34,46,68,71,77": 482,
    "34,46,68,77": 483,
    "34,46,70,72,79": 484,
    "34,46,70,74": 485,
    "34,46,72": 486,
    "34,48,50,51,53,57,58,65": 487,
    "34,48,50,56,70": 488,
    "34,48,50,63,65,77": 489,
    "34,48,50,63,65,79": 490,
    "34,48,51,57,65": 491,
    "34,48,63,77": 492,
    "34,48,63,79": 493,
    "34,50,51,65,67,79": 494,
    "34,50,53,58,65": 495,
    "34,50,55": 496,
    "34,50,62": 497,
    "34,50,65,79": 498,
    "34,51,53,67,70,72": 499,
    "34,53,55,69,70": 500,
    "34,53,55,69,70,72": 501,
    "34,55,57,70,72": 502,
    "34,55,57,70,72,74": 503,
    "34,55,65": 504,
    "34,55,70": 505,
    "34,55,70,72": 506,
    "34,57,58,62,72,74": 507,
    "34,57,72": 508,
    "34,57,72,74": 509,
    "34,58,62,74": 510,
    "34,65": 511,
    "34,65,74": 512,
    "34,70": 513,
    "35,36,47,48": 514,
    "35,36,47,48,54,57,63": 515,
    "35,36,47,48,62,66,67,69": 516,
    "35,36,55,60,64": 517,
    "35,37,47,49,62,67,69,71": 518,
    "35,37,54,59,62": 519,
    "35,38,47,50,55,59,62,67": 520,
    "35,47": 521,
    "35,47,53,56,62,63": 522,
    "35,47,54,57,63": 523,
    "35,47,54,59,63": 524,
    "35,47,55,60,62": 525,
    "35,47,55,62,67": 526,
    "35,47,55,62,67,71": 527,
    "35,47,62,64,67,71": 528,
    "35,47,62,67,71": 529,
    "35,47,62,67,71,76": 530,
    "35,47,63,66": 531,
    "35,47,64,67,76": 532,
    "35,47,65": 533,
    "35,51,58,63": 534,
    "35,52,55,60,64": 535,
    "35,52,58,61,64,73": 536,
    "35,55,60,64": 537,
    "35,55,60,64,71": 538,
    "35,59,63,66": 539,
    "35,63,71,73": 540,
    "35,73": 541,
    "36": 542,
    "36,37,48,49,55,57,64": 543,
    "36,37,48,49,56,57,61,63,64,66": 544,
    "36,37,48,49,58,67": 545,
    "36,37,48,49,63,67,69": 546,
    "36,37,48,49,64,67,70": 547,
    "36,37,48,49,67,68,71,72": 548,
    "36,37,48,49,67,70,79,81": 549,
    "36,37,65,68": 550,
    "36,37,67,70": 551,
    "36,38,41,48,57,63,65": 552,
    "36,38,41,57,63,65": 553,
    "36,38,48,50,51,53,56,58": 554,
    "36,38,48,50,62,66,69,71": 555,
    "36,38,48,50,66,72": 556,
    "36,38,55,60,64,65,76,77": 557,
    "36,39,48,51,53,60": 558,
    "36,39,48,51,55,56,60": 559,
    "36,40,41,48,50,60,67,72": 560,
    "36,40,43,48,52,60,64,67,72": 561,
    "36,40,43,48,52,64,67,72": 562,
    "36,40,48,52": 563,
    "36,40,48,52,57,59,63,64,66,68": 564,
    "36,40,48,60,67,72": 565,
    "36,40,48,60,72": 566,
    "36,41,43,50,52,62,64,67,72": 567,
    "36,41,48,57,63,65": 568,
    "36,41,50,62,67,72": 569,
    "36,41,52,53,60,70,72,74": 570,
    "36,41,52,57,58": 571,
    "36,43": 572,
    "36,43,45,52,53,64,65,67,72": 573,
    "36,43,45,52,53,65,67,72": 574,
    "36,43,48": 575,
    "36,43,48,51": 576,
    "36,43,48,60,64,67,72": 577,
    "36,43,48,62,64": 578,
    "36,43,48,64,65": 579,
    "36,43,51,55": 580,
    "36,43,52,55,64": 581,
    "36,43,52,60,67,72": 582,
    "36,43,52,64,67,72": 583,
    "36,43,55,60": 584,
    "36,43,55,60,62,64,74,76": 585,
    "36,43,55,60,64": 586,
    "36,43,59,60,64,67": 587,
    "36,43,59,62,64,65": 588,
    "36,43,59,65,67": 589,
    "36,43,60,64,72": 590,
    "36,43,60,67,72": 591,
    "36,43,62,64": 592,
    "36,43,62,65,67,69": 593,
    "36,43,62,67,71,72": 594,
    "36,43,62,69,71": 595,
    "36,43,64,67,72": 596,
    "36,43,65,67": 597,
    "36,43,67,68": 598,
    "36,43,69": 599,
    "36,44,67,70": 600,
    "36,45,46,72,74,79,81": 601,
    "36,45,46,72,76,79,81": 602,
    "36,45,48,53": 603,
    "36,45,53,65,67,72": 604,
    "36,45,72,81": 605,
    "36,46,48,64,74,77,79": 606,
    "36,46,48,69,76,77,79": 607,
    "36,46,65,68": 608,
    "36,46,74,79": 609,
    "36,46,76,79": 610,
    "36,48": 611,
    "36,48,50,51,55,60": 612,
    "36,48,50,63,75": 613,
    "36,48,50,64,65,76,77": 614,
    "36,48,50,64,67,72": 615,
    "36,48,50,69,72,76,77": 616,
    "36,48,51,56,58": 617,
    "36,48,51,56,60": 618,
    "36,48,51,57": 619,
    "36,48,51,57,58": 620,
    "36,48,51,58,60": 621,
    "36,48,51,60": 622,
    "36,48,51,70,72": 623,
    "36,48,52": 624,
    "36,48,52,55,60": 625,
    "36,48,52,55,60,64": 626,
    "36,48,52,57": 627,
    "36,48,52,64,67,69,70": 628,
    "36,48,52,64,67,72": 629,
    "36,48,52,67,70,79,81": 630,
    "36,48,52,67,72": 631,
    "36,48,53,55,64,69,70,72": 632,
    "36,48,53,57": 633,
    "36,48,54,57,63,64": 634,
    "36,48,55,58,60,64": 635,
    "36,48,55,60,62": 636,
    "36,48,55,60,63": 637,
    "36,48,55,60,63,67": 638,
    "36,48,55,60,63,72": 639,
    "36,48,55,63": 640,
    "36,48,55,64,65,72": 641,
    "36,48,57": 642,
    "36,48,60": 643,
    "36,48,60,62,67": 644,
    "36,48,60,63": 645,
    "36,48,60,72": 646,
    "36,48,62": 647,
    "36,48,62,63,67": 648,
    "36,48,62,66,69": 649,
    "36,48,63,65": 650,
    "36,48,63,67": 651,
    "36,48,63,69": 652,
    "36,48,63,69,72": 653,
    "36,48,63,72": 654,
    "36,48,63,75": 655,
    "36,48,64,67,69": 656,
    "36,48,64,67,69,70": 657,
    "36,48,64,67,70": 658,
    "36,48,64,67,70,76": 659,
    "36,48,64,67,72": 660,
    "36,48,64,77": 661,
    "36,48,65,68,72": 662,
    "36,48,67": 663,
    "36,48,67,70,76": 664,
    "36,48,67,70,76,81": 665,
    "36,48,67,70,81": 666,
    "36,48,69,72": 667,
    "36,48,69,77": 668,
    "36,50,51,56,58,70": 669,
    "36,50,52,65,67,72": 670,
    "36,50,52,67,72,74,76": 671,
    "36,50,65,67,72": 672,
    "36,50,72,76": 673,
    "36,51,53,58,60,72": 674,
    "36,51,58,74": 675,
    "36,51,63": 676,
    "36,51,72": 677,
    "36,51,72,74": 678,
    "36,51,74": 679,
    "36,52,53,67,69,72,74": 680,
    "36,52,55,58,61": 681,
    "36,52,55,61": 682,
    "36,52,55,62,64,67,70,74": 683,
    "36,52,58": 684,
    "36,52,58,61,64,67": 685,
    "36,52,58,61,67": 686,
    "36,52,58,67": 687,
    "36,52,58,69": 688,
    "36,52,58,70": 689,
    "36,52,58,70,73": 690,
    "36,52,58,73": 691,
    "36,52,60,70,74": 692,
    "36,52,61,64": 693,
    "36,52,61,67,70": 694,
    "36,52,67,72": 695,
    "36,52,67,74": 696,
    "36,52,70": 697,
    "36,53,60,72,74": 698,
    "36,53,69,72": 699,
    "36,55,59,62": 700,
    "36,55,60,64": 701,
    "36,55,63": 702,
    "36,57,60,65": 703,
    "36,60,64,76": 704,
    "36,65,68": 705,
    "36,67,70": 706,
    "36,67,72": 707,
    "36,69": 708,
    "37,38,49,50,53,57,65": 709,
    "37,38,49,50,53,65,67": 710,
    "37,38,49,50,55,64": 711,
    "37,38,49,50,66,69": 712,
    "37,38,49,50,67,70,78,79": 713,
    "37,38,69,78,79": 714,
    "37,40,64,67,70": 715,
    "37,40,64,69,73": 716,
    "37,49,52,58,67": 717,
    "37,49,53,57,65": 718,
    "37,49,55,57,64": 719,
    "37,49,55,57,64,65": 720,
    "37,49,55,66,67": 721,
    "37,49,56,61,64": 722,
    "37,49,58,67": 723,
    "37,49,58,69,70": 724,
    "37,49,61,64,69": 725,
    "37,49,63,67,69": 726,
    "37,49,64,65,71,77": 727,
    "37,49,64,70": 728,
    "37,49,65,67,71": 729,
    "37,49,67": 730,
    "37,49,67,70,79": 731,
    "37,49,70": 732,
    "37,50,69,81": 733,
    "37,51,52,56,58,70": 734,
    "37,55,57": 735,
    "37,56,64": 736,
    "37,65,68": 737,
    "37,67,70": 738,
    "37,69,79,81": 739,
    "37,69,81": 740,
    "38": 741,
    "38,39": 742,
    "38,39,46,56,66,70": 743,
    "38,39,46,58,66,67": 744,
    "38,39,48,50,51,58": 745,
    "38,39,50,51,55,58,62": 746,
    "38,39,50,51,60": 747,
    "38,39,54,55,61,62": 748,
    "38,39,55,60,62": 749,
    "38,40,50,52,59,62,64,66,68,71": 750,
    "38,40,50,52,66,69,73,78": 751,
    "38,41,65,74": 752,
    "38,42,45,57,66,69": 753,
    "38,42,50,54,61,62,66,69,71": 754,
    "38,43,50,54,55,57,62": 755,
    "38,43,50,59,66,67": 756,
    "38,45,46,66,70": 757,
    "38,45,50,52,55,57,61,62": 758,
    "38,45,54,57,62": 759,
    "38,45,54,62": 760,
    "38,45,57,66,69": 761,
    "38,45,62": 762,
    "38,46,48,56,70": 763,
    "38,46,52,55": 764,
    "38,46,53,55,58,70": 765,
    "38,46,54,66": 766,
    "38,46,55,58": 767,
    "38,46,58,66,70": 768,
    "38,46,58,70": 769,
    "38,48,54,57,62": 770,
    "38,50": 771,
    "38,50,52": 772,
    "38,50,53": 773,
    "38,50,53,56,58": 774,
    "38,50,53,57,65": 775,
    "38,50,53,58,65": 776,
    "38,50,53,59,60,62": 777,
    "38,50,53,60,62": 778,
    "38,50,53,62,65": 779,
    "38,50,54": 780,
    "38,50,54,55,62": 781,
    "38,50,54,57,62": 782,
    "38,50,54,57,62,66": 783,
    "38,50,54,62": 784,
    "38,50,55,57,64,66": 785,
    "38,50,55,58": 786,
    "38,50,55,58,61,64": 787,
    "38,50,55,58,62": 788,
    "38,50,55,58,64": 789,
    "38,50,55,59,62": 790,
    "38,50,55,60,62": 791,
    "38,50,55,60,63": 792,
    "38,50,55,62": 793,
    "38,50,55,63": 794,
    "38,50,57": 795,
    "38,50,57,60": 796,
    "38,50,57,61,62,64,66,69": 797,
    "38,50,57,62,65": 798,
    "38,50,57,62,66": 799,
    "38,50,57,62,66,69": 800,
    "38,50,57,62,66,71": 801,
    "38,50,57,62,66,74": 802,
    "38,50,57,65": 803,
    "38,50,57,66": 804,
    "38,50,57,66,67": 805,
    "38,50,57,67,69": 806,
    "38,50,58": 807,
    "38,50,58,60,67,69": 808,
    "38,50,58,62": 809,
    "38,50,58,62,67": 810,
    "38,50,58,67": 811,
    "38,50,59": 812,
    "38,50,60": 813,
    "38,50,60,62": 814,
    "38,50,60,62,66": 815,
    "38,50,60,62,69": 816,
    "38,50,60,66": 817,
    "38,50,60,66,69": 818,
    "38,50,60,66,69,74": 819,
    "38,50,60,69": 820,
    "38,50,61,64,67": 821,
    "38,50,61,67": 822,
    "38,50,62": 823,
    "38,50,62,64,67,71": 824,
    "38,50,62,65,70": 825,
    "38,50,62,65,71": 826,
    "38,50,62,66": 827,
    "38,50,62,66,71": 828,
    "38,50,62,74": 829,
    "38,50,63,72": 830,
    "38,50,65": 831,
    "38,50,65,67": 832,
    "38,50,65,69,74": 833,
    "38,50,66": 834,
    "38,50,66,69": 835,
    "38,50,66,69,70,74,79": 836,
    "38,50,66,69,74": 837,
    "38,50,66,69,78": 838,
    "38,50,67,69": 839,
    "38,50,68": 840,
    "38,50,69": 841,
    "38,50,69,72,78": 842,
    "38,50,70,74": 843,
    "38,50,70,74,79": 844,
    "38,50,72": 845,
    "38,52,53,56,64,70": 846,
    "38,53,60": 847,
    "38,53,65": 848,
    "38,54,62": 849,
    "38,55,59,65,67,77,79": 850,
    "38,55,62": 851,
    "38,55,65,77": 852,
    "38,57": 853,
    "38,57,58,66": 854,
    "38,58,60,66": 855,
    "38,59,61,62": 856,
    "38,59,67,79": 857,
    "38,60,62,63": 858,
    "38,60,62,66": 859,
    "38,62,66,69": 860,
    "38,62,69": 861,
    "38,65,69,74": 862,
    "38,66": 863,
    "38,69": 864,
    "38,69,78": 865,
    "38,70": 866,
    "39": 867,
    "39,41,48,65,69,70": 868,
    "39,41,57,58,77,78": 869,
    "39,41,57,77": 870,
    "39,42,58,73": 871,
    "39,42,66,69,72": 872,
    "39,43,51,55,58,63,67": 873,
    "39,43,51,55,60,70": 874,
    "39,45,51,58,60,62,67": 875,
    "39,46,51,58,60,70": 876,
    "39,46,55,58,60": 877,
    "39,46,55,58,65,70": 878,
    "39,46,55,63,67,70,75": 879,
    "39,46,55,67": 880,
    "39,46,55,67,70": 881,
    "39,46,55,68,70": 882,
    "39,46,55,70": 883,
    "39,46,56,68,70": 884,
    "39,46,56,70": 885,
    "39,46,58,67": 886,
    "39,46,58,67,69": 887,
    "39,46,58,69,70": 888,
    "39,46,67,70": 889,
    "39,46,68,70": 890,
    "39,48,51": 891,
    "39,48,54,58,60": 892,
    "39,48,58,72,73": 893,
    "39,48,63,69": 894,
    "39,48,63,69,70": 895,
    "39,48,63,70,72": 896,
    "39,48,63,72": 897,
    "39,48,69,70": 898,
    "39,48,70": 899,
    "39,51,55": 900,
    "39,51,55,56,60": 901,
    "39,51,55,60": 902,
    "39,51,55,62,63": 903,
    "39,51,55,67": 904,
    "39,51,58,62,67": 905,
    "39,51,58,63,67": 906,
    "39,51,58,67": 907,
    "39,51,59,71": 908,
    "39,51,60": 909,
    "39,51,62,63": 910,
    "39,51,63": 911,
    "39,51,67": 912,
    "39,51,67,70": 913,
    "39,51,72,75": 914,
    "39,54,70": 915,
    "39,54,70,78": 916,
    "39,55,60": 917,
    "39,55,61": 918,
    "39,55,63": 919,
    "39,56,58,65,66,77,78": 920,
    "39,56,62,68": 921,
    "39,56,65,77": 922,
    "39,58,63,73,75": 923,
    "39,58,63,75": 924,
    "39,58,63,77,78": 925,
    "39,58,63,78": 926,
    "39,58,73": 927,
    "39,58,73,75": 928,
    "39,58,75,77": 929,
    "39,58,77": 930,
    "39,63": 931,
    "39,63,71": 932,
    "39,67,68": 933,
    "39,68": 934,
    "39,69,72": 935,
    "39,71": 936,
    "40,41,52,53,67,69,73,76": 937,
    "40,41,57,58,61": 938,
    "40,41,57,58,65,67,77,79": 939,
    "40,42,47,54,56,59,63,64": 940,
    "40,43,52,55": 941,
    "40,43,61,64,67": 942,
    "40,47,49,52,56,62": 943,
    "40,47,49,56,59,64": 944,
    "40,47,49,68,71,76": 945,
    "40,47,49,71,76,80,83": 946,
    "40,47,52,59,66,68,71,75,76": 947,
    "40,47,54,56,57,59,63,64,66,71": 948,
    "40,47,54,68,69,71,75,76,78,83": 949,
    "40,47,56,57,59,63,66,68,71": 950,
    "40,47,56,59,64": 951,
    "40,47,56,69,71,75,78,80,83": 952,
    "40,47,57,59,63,66,68,71,76": 953,
    "40,47,68,71,76": 954,
    "40,47,69,71,75,76,78,80,83": 955,
    "40,48": 956,
    "40,48,49,52,57,61": 957,
    "40,48,55,58,60": 958,
    "40,48,57,61": 959,
    "40,48,60,67,72": 960,
    "40,51,59,70": 961,
    "40,52": 962,
    "40,52,55,60,62": 963,
    "40,52,55,64,67": 964,
    "40,52,56": 965,
    "40,52,56,62,68": 966,
    "40,52,58,64,67": 967,
    "40,52,58,67": 968,
    "40,52,59,61,64,68,69": 969,
    "40,52,59,64,68": 970,
    "40,52,62,68": 971,
    "40,52,67,69,73": 972,
    "40,52,68,71,76": 973,
    "40,54,56,57,63,66,68,71": 974,
    "40,54,56,69,75,78,80,83": 975,
    "40,56,57,63,66,68,71": 976,
    "40,56,69,75,78,80,83": 977,
    "40,57,61": 978,
    "40,58,60,67,69,79,81": 979,
    "40,58,61,67,70": 980,
    "40,58,67": 981,
    "40,58,67,79": 982,
    "40,59,63,66": 983,
    "40,59,64,67": 984,
    "40,60,69,81": 985,
    "40,64,67": 986,
    "40,64,70,71": 987,
    "40,70": 988,
    "41,42,44,49,68,73": 989,
    "41,42,49,61": 990,
    "41,42,53,54,61,62,66,68,69,71": 991,
    "41,42,53,54,64,69,74,76": 992,
    "41,43,51,53,57,60,65": 993,
    "41,43,51,53,60,62,72,74": 994,
    "41,43,55,57,63,65,75,77": 995,
    "41,43,60,65,72": 996,
    "41,44,49,61": 997,
    "41,45,53,57,60,63,64,65,67": 998,
    "41,45,53,57,62,64,68,69,71,73": 999,
    "41,45,53,60": 1000,
    "41,45,53,60,69,72": 1001,
    "41,45,60,65": 1002,
    "41,45,65,74,85,93": 1003,
    "41,46,48,53,57,63,74": 1004,
    "41,46,48,53,57,77": 1005,
    "41,46,48,57,77": 1006,
    "41,46,50,51,57,58,60": 1007,
    "41,46,53,60,62,63,69": 1008,
    "41,46,56,60,62,65,68": 1009,
    "41,46,56,68": 1010,
    "41,46,65": 1011,
    "41,47,48,56,57,65": 1012,
    "41,47,49,56,58,65,67": 1013,
    "41,48,49,57,81": 1014,
    "41,48,50,57,58,65": 1015,
    "41,48,50,70,72": 1016,
    "41,48,51,53,57,62,63": 1017,
    "41,48,52,58,60,65,67": 1018,
    "41,48,53": 1019,
    "41,48,53,57": 1020,
    "41,48,53,57,60": 1021,
    "41,48,53,57,60,63,64": 1022,
    "41,48,53,57,60,64": 1023,
    "41,48,53,57,60,64,65": 1024,
    "41,48,53,57,60,65": 1025,
    "41,48,53,57,60,65,69": 1026,
    "41,48,53,57,60,69": 1027,
    "41,48,53,57,60,69,72": 1028,
    "41,48,53,57,62,65,77": 1029,
    "41,48,53,57,63": 1030,
    "41,48,57,60,65": 1031,
    "41,48,57,64,67,69,81": 1032,
    "41,48,57,65": 1033,
    "41,48,57,72": 1034,
    "41,48,57,72,77": 1035,
    "41,48,57,72,81": 1036,
    "41,48,57,81": 1037,
    "41,48,58,60,64,65,67,68": 1038,
    "41,48,63,65,67,69": 1039,
    "41,48,63,65,69": 1040,
    "41,48,63,69": 1041,
    "41,48,63,72": 1042,
    "41,48,63,72,73": 1043,
    "41,48,67,69": 1044,
    "41,48,70": 1045,
    "41,48,70,72": 1046,
    "41,49,50,57,58,65,73,74": 1047,
    "41,49,51,61,73": 1048,
    "41,49,57,65,73,77": 1049,
    "41,49,57,65,77": 1050,
    "41,49,61": 1051,
    "41,49,61,73": 1052,
    "41,50": 1053,
    "41,50,51,53,57,58,60,65,70": 1054,
    "41,50,51,57,58,60,65": 1055,
    "41,50,51,57,60,62,65": 1056,
    "41,50,51,69,70": 1057,
    "41,50,53": 1058,
    "41,50,53,58,65": 1059,
    "41,50,53,58,70": 1060,
    "41,50,53,62,65": 1061,
    "41,50,53,65": 1062,
    "41,50,58": 1063,
    "41,50,58,65": 1064,
    "41,50,62,67,72": 1065,
    "41,51,53,57": 1066,
    "41,51,53,57,58,60,65,70": 1067,
    "41,51,53,57,60,62": 1068,
    "41,51,53,57,60,65": 1069,
    "41,51,53,61": 1070,
    "41,51,53,61,73": 1071,
    "41,51,53,65,67": 1072,
    "41,51,53,65,67,69": 1073,
    "41,51,57,60,62": 1074,
    "41,51,57,60,62,63,65": 1075,
    "41,51,57,60,62,65": 1076,
    "41,51,57,60,65": 1077,
    "41,51,57,60,77": 1078,
    "41,51,57,62,63,65": 1079,
    "41,51,57,63": 1080,
    "41,51,57,65,72": 1081,
    "41,51,57,65,74": 1082,
    "41,51,60,65": 1083,
    "41,51,61,73": 1084,
    "41,53": 1085,
    "41,53,55,57,65": 1086,
    "41,53,55,62,63,74,75": 1087,
    "41,53,55,65": 1088,
    "41,53,56,62,67": 1089,
    "41,53,57": 1090,
    "41,53,57,58,60,65": 1091,
    "41,53,57,60,62": 1092,
    "41,53,57,60,65": 1093,
    "41,53,57,62": 1094,
    "41,53,57,62,63,65": 1095,
    "41,53,57,63,65": 1096,
    "41,53,57,65": 1097,
    "41,53,58,60,62,72,74": 1098,
    "41,53,58,61,64": 1099,
    "41,53,58,63,67": 1100,
    "41,53,58,64,65": 1101,
    "41,53,58,70": 1102,
    "41,53,60,63,69": 1103,
    "41,53,60,69": 1104,
    "41,53,60,69,72": 1105,
    "41,53,62,65": 1106,
    "41,53,62,65,67": 1107,
    "41,53,64,69,76": 1108,
    "41,53,65,69": 1109,
    "41,53,65,77": 1110,
    "41,53,69,78": 1111,
    "41,55,63,67": 1112,
    "41,55,65": 1113,
    "41,57,58,65": 1114,
    "41,57,60,62": 1115,
    "41,57,60,62,65": 1116,
    "41,57,60,63": 1117,
    "41,57,60,63,67": 1118,
    "41,57,60,65": 1119,
    "41,57,60,67": 1120,
    "41,57,62,63,65,67": 1121,
    "41,57,62,65": 1122,
    "41,57,63,65": 1123,
    "41,57,63,65,67": 1124,
    "41,57,63,69": 1125,
    "41,57,63,69,70": 1126,
    "41,57,63,72": 1127,
    "41,57,63,72,74": 1128,
    "41,57,63,75": 1129,
    "41,57,63,75,77": 1130,
    "41,57,65": 1131,
    "41,57,65,77": 1132,
    "41,57,67": 1133,
    "41,57,67,69": 1134,
    "41,57,70": 1135,
    "41,57,70,72": 1136,
    "41,57,74": 1137,
    "41,57,74,75": 1138,
    "41,58": 1139,
    "41,58,59,66,67,78,79": 1140,
    "41,58,62,65,74,77": 1141,
    "41,58,62,74": 1142,
    "41,58,66,78": 1143,
    "41,60,63,69,77": 1144,
    "41,60,65,68": 1145,
    "41,62,63,65,67,77,79": 1146,
    "41,62,65,77": 1147,
    "41,65": 1148,
    "41,67": 1149,
    "41,69": 1150,
    "41,69,75": 1151,
    "41,70": 1152,
    "41,72": 1153,
    "41,74": 1154,
    "41,77": 1155,
    "41,79": 1156,
    "41,89,101": 1157,
    "42": 1158,
    "42,43,54,55,62,69,71,74": 1159,
    "42,44,47,54,56,59,63": 1160,
    "42,44,60,70": 1161,
    "42,44,61,66,69": 1162,
    "42,44,68,70": 1163,
    "42,45,46,53,65": 1164,
    "42,45,51,60,69": 1165,
    "42,45,54,57": 1166,
    "42,45,54,57,69,81": 1167,
    "42,45,57,62,64,66": 1168,
    "42,45,57,62,66": 1169,
    "42,45,63,66,69": 1170,
    "42,46,48,53,65": 1171,
    "42,46,57,69": 1172,
    "42,47,49,61": 1173,
    "42,47,50": 1174,
    "42,47,50,53,62,65,77": 1175,
    "42,47,50,55,62,67,79": 1176,
    "42,47,52,54,58,59,61,63": 1177,
    "42,47,60,63,64,66,69": 1178,
    "42,48,60,64,67,69": 1179,
    "42,49,50,58,70": 1180,
    "42,49,58,61": 1181,
    "42,49,58,61,63": 1182,
    "42,49,58,65": 1183,
    "42,49,58,65,66": 1184,
    "42,49,58,68": 1185,
    "42,49,58,68,70": 1186,
    "42,49,58,70": 1187,
    "42,49,58,71": 1188,
    "42,49,58,71,72": 1189,
    "42,49,58,71,73": 1190,
    "42,49,63": 1191,
    "42,49,63,65": 1192,
    "42,49,66": 1193,
    "42,49,66,68": 1194,
    "42,49,70": 1195,
    "42,49,70,71": 1196,
    "42,49,72": 1197,
    "42,49,73": 1198,
    "42,50,51,58,70": 1199,
    "42,50,53": 1200,
    "42,50,53,56": 1201,
    "42,50,56,59,62": 1202,
    "42,50,56,62": 1203,
    "42,50,57,60,62": 1204,
    "42,50,58,70": 1205,
    "42,50,59,62": 1206,
    "42,50,59,62,65,68": 1207,
    "42,50,59,62,68": 1208,
    "42,50,59,71,74": 1209,
    "42,50,59,74": 1210,
    "42,50,62,65": 1211,
    "42,50,62,68,71": 1212,
    "42,50,71": 1213,
    "42,51,58,70": 1214,
    "42,51,60,69": 1215,
    "42,52,58,61": 1216,
    "42,52,58,61,63": 1217,
    "42,52,59,73": 1218,
    "42,54": 1219,
    "42,54,55,70,72,76": 1220,
    "42,54,56,57,70,76": 1221,
    "42,54,56,64,70,76": 1222,
    "42,54,57,69,72": 1223,
    "42,54,59,60,70,76": 1224,
    "42,54,60,61,70,76": 1225,
    "42,54,60,62,72": 1226,
    "42,54,60,64,69": 1227,
    "42,54,60,69,72": 1228,
    "42,54,60,72": 1229,
    "42,54,61,62,70,76": 1230,
    "42,54,61,66,69": 1231,
    "42,54,62,63,70,76": 1232,
    "42,54,62,69,74": 1233,
    "42,54,63,64,70,76": 1234,
    "42,54,63,76": 1235,
    "42,54,64,65,70,76": 1236,
    "42,54,64,69": 1237,
    "42,54,64,70,76": 1238,
    "42,54,65,66,70,71,76": 1239,
    "42,54,66,71,74": 1240,
    "42,54,69,74": 1241,
    "42,54,70,72,74,75": 1242,
    "42,54,72,75": 1243,
    "42,55,59,61,64,73": 1244,
    "42,60,69": 1245,
    "42,60,70,72": 1246,
    "42,63,72,73": 1247,
    "42,63,73": 1248,
    "42,64,73,75": 1249,
    "42,66,69": 1250,
    "42,66,73,75": 1251,
    "42,66,73,76": 1252,
    "42,70,72": 1253,
    "42,72": 1254,
    "42,73": 1255,
    "42,76": 1256,
    "43": 1257,
    "43,44,46,47,53,62": 1258,
    "43,44,50,51,58,60,70,72": 1259,
    "43,44,53,55,62,63,74,75": 1260,
    "43,44,67,70": 1261,
    "43,45,50,62,69,71": 1262,
    "43,45,53,55,62,64,74,76": 1263,
    "43,45,55,57": 1264,
    "43,45,55,57,62,66,67,71": 1265,
    "43,45,55,67,70,76": 1266,
    "43,45,58": 1267,
    "43,45,59,62,63,66,67": 1268,
    "43,45,60": 1269,
    "43,46": 1270,
    "43,46,50,51,53,55,58,63,65": 1271,
    "43,46,50,55,57,62,69": 1272,
    "43,46,50,55,57,69": 1273,
    "43,46,50,58,65,76,77": 1274,
    "43,46,51,53,57,60,65": 1275,
    "43,46,51,53,63,65,75,77": 1276,
    "43,46,55": 1277,
    "43,46,55,58": 1278,
    "43,46,55,60,64,67": 1279,
    "43,46,55,62,67,69": 1280,
    "43,46,55,67": 1281,
    "43,46,55,69,70": 1282,
    "43,46,58,61,64": 1283,
    "43,46,58,70": 1284,
    "43,46,60,72": 1285,
    "43,46,62,65,67": 1286,
    "43,47,48,55,62": 1287,
    "43,47,53,62": 1288,
    "43,47,59,65,67,74,77": 1289,
    "43,47,59,65,67,74,81": 1290,
    "43,47,64": 1291,
    "43,48,51,57,67,72,74,75": 1292,
    "43,48,52,55,60,62,72,74": 1293,
    "43,48,55,59,62": 1294,
    "43,48,57,60,63,66,69": 1295,
    "43,48,57,66,72": 1296,
    "43,48,57,66,75": 1297,
    "43,48,58,62,65,72,79": 1298,
    "43,48,59,62,64,67": 1299,
    "43,48,60,62,64,65,67": 1300,
    "43,50,51,55,62,63": 1301,
    "43,50,53,55": 1302,
    "43,50,55": 1303,
    "43,50,55,57,58,70": 1304,
    "43,50,55,57,59,62,72,74": 1305,
    "43,50,55,58": 1306,
    "43,50,55,58,67": 1307,
    "43,50,55,62": 1308,
    "43,50,55,62,66,69": 1309,
    "43,50,55,62,67,69,70,74,76,77": 1310,
    "43,50,55,62,70": 1311,
    "43,50,55,67,69,72": 1312,
    "43,50,55,67,70": 1313,
    "43,50,55,70,74": 1314,
    "43,50,57,62,69,70": 1315,
    "43,50,57,62,70,72": 1316,
    "43,50,57,62,71": 1317,
    "43,50,57,62,71,72": 1318,
    "43,50,57,70,72": 1319,
    "43,50,57,71": 1320,
    "43,50,58,62,65,77,79": 1321,
    "43,50,58,65,77": 1322,
    "43,50,58,67": 1323,
    "43,50,59,65,71": 1324,
    "43,50,59,65,74": 1325,
    "43,50,59,67": 1326,
    "43,50,59,67,71": 1327,
    "43,50,59,71": 1328,
    "43,50,59,74,75": 1329,
    "43,50,62,63": 1330,
    "43,50,67,71": 1331,
    "43,50,69,71,74": 1332,
    "43,50,71": 1333,
    "43,50,72,75": 1334,
    "43,51,53,57,60,65": 1335,
    "43,51,55,58,63": 1336,
    "43,51,59,70": 1337,
    "43,51,59,71": 1338,
    "43,51,60,66,69": 1339,
    "43,51,60,69,72": 1340,
    "43,51,60,72": 1341,
    "43,51,60,72,74": 1342,
    "43,51,61,70": 1343,
    "43,51,71,74": 1344,
    "43,52": 1345,
    "43,52,61,67": 1346,
    "43,52,61,70": 1347,
    "43,52,64": 1348,
    "43,52,64,67,72": 1349,
    "43,52,67,70": 1350,
    "43,53,60,65": 1351,
    "43,53,60,68": 1352,
    "43,53,65,68": 1353,
    "43,53,68,70": 1354,
    "43,55": 1355,
    "43,55,57,62": 1356,
    "43,55,57,64,65,76,77": 1357,
    "43,55,58,60,62,67,74,75": 1358,
    "43,55,58,61": 1359,
    "43,55,58,62,67,70,74": 1360,
    "43,55,58,67": 1361,
    "43,55,58,67,70": 1362,
    "43,55,58,85,89,92": 1363,
    "43,55,59,62": 1364,
    "43,55,59,62,67": 1365,
    "43,55,61,64": 1366,
    "43,55,61,64,70": 1367,
    "43,55,62,64,70": 1368,
    "43,55,62,67": 1369,
    "43,55,62,67,70": 1370,
    "43,55,62,67,71": 1371,
    "43,55,62,70": 1372,
    "43,55,62,71": 1373,
    "43,55,62,74": 1374,
    "43,55,63,67": 1375,
    "43,55,63,72": 1376,
    "43,55,63,75": 1377,
    "43,55,64,67": 1378,
    "43,55,64,76": 1379,
    "43,55,65,67,71": 1380,
    "43,55,67": 1381,
    "43,55,67,68": 1382,
    "43,55,67,69,74": 1383,
    "43,55,67,70": 1384,
    "43,55,67,70,76": 1385,
    "43,55,67,79": 1386,
    "43,55,69,70,74": 1387,
    "43,55,70,74": 1388,
    "43,55,72,75": 1389,
    "43,55,74": 1390,
    "43,55,75,79": 1391,
    "43,57,58,62": 1392,
    "43,57,60,62": 1393,
    "43,58": 1394,
    "43,58,60,62,63,66,69,70": 1395,
    "43,58,62": 1396,
    "43,58,62,65,79": 1397,
    "43,58,62,67": 1398,
    "43,58,62,70,74": 1399,
    "43,58,62,74": 1400,
    "43,58,63": 1401,
    "43,59,64": 1402,
    "43,59,64,67": 1403,
    "43,60": 1404,
    "43,60,62,63": 1405,
    "43,60,72": 1406,
    "43,61,64": 1407,
    "43,62,63,70,72,74": 1408,
    "43,62,65,68": 1409,
    "43,62,67": 1410,
    "43,62,70,74": 1411,
    "43,63,72,74": 1412,
    "43,64,70,71": 1413,
    "43,67,70": 1414,
    "43,70": 1415,
    "43,85,86": 1416,
    "44,45,50,51,53,57,58,60,65,70": 1417,
    "44,45,51,53,60,62,72,74": 1418,
    "44,45,56,57,63,66": 1419,
    "44,46,53,62": 1420,
    "44,46,65,68": 1421,
    "44,47,48,60,66": 1422,
    "44,47,49,61": 1423,
    "44,47,51,60,66": 1424,
    "44,47,56,59,63": 1425,
    "44,48,49,60,66": 1426,
    "44,48,60,66": 1427,
    "44,49,51,60,66": 1428,
    "44,49,56,60,63,65": 1429,
    "44,49,56,61,63,65": 1430,
    "44,49,56,63,65": 1431,
    "44,49,61": 1432,
    "44,49,61,65": 1433,
    "44,50,51,60,63,68": 1434,
    "44,50,54,60,63,68": 1435,
    "44,50,58,70": 1436,
    "44,50,60,66": 1437,
    "44,51,53,60,61,68,75,77": 1438,
    "44,51,53,60,63,68": 1439,
    "44,51,59,60": 1440,
    "44,51,59,66": 1441,
    "44,51,59,71": 1442,
    "44,51,60": 1443,
    "44,51,60,63,68": 1444,
    "44,51,60,65,66": 1445,
    "44,51,60,66": 1446,
    "44,51,60,68,75,80": 1447,
    "44,51,60,68,80": 1448,
    "44,51,60,72": 1449,
    "44,51,61,67": 1450,
    "44,51,63": 1451,
    "44,51,63,70": 1452,
    "44,51,66": 1453,
    "44,53,54,60,63,68,69": 1454,
    "44,53,56,60,63,68": 1455,
    "44,53,62,74": 1456,
    "44,54,60,63,68": 1457,
    "44,54,62,63": 1458,
    "44,54,62,69": 1459,
    "44,54,63,73": 1460,
    "44,54,69": 1461,
    "44,56,60,63": 1462,
    "44,56,60,63,66": 1463,
    "44,56,64,71,74": 1464,
    "44,56,65,67,74": 1465,
    "44,56,65,71,74": 1466,
    "44,56,66,67": 1467,
    "44,56,71,74": 1468,
    "44,58": 1469,
    "44,59,63": 1470,
    "44,60": 1471,
    "44,60,63": 1472,
    "44,63": 1473,
    "44,63,65": 1474,
    "44,63,67,68": 1475,
    "44,63,68": 1476,
    "44,63,68,70": 1477,
    "44,63,70": 1478,
    "44,63,70,71": 1479,
    "44,65,68": 1480,
    "44,65,73,75": 1481,
    "44,67": 1482,
    "44,67,70": 1483,
    "44,71": 1484,
    "44,73": 1485,
    "44,75,87": 1486,
    "45": 1487,
    "45,46,48,49,55,64": 1488,
    "45,46,50,51,58,60,70,72": 1489,
    "45,46,51,53,57,60,65": 1490,
    "45,46,52,53,60,62,72,74": 1491,
    "45,46,53,58,60,63,65,67": 1492,
    "45,46,53,58,60,63,70,72": 1493,
    "45,46,53,60,62": 1494,
    "45,46,54,57,58": 1495,
    "45,46,57,58": 1496,
    "45,46,57,58,60,62,66,69": 1497,
    "45,46,60,62,65,67,69": 1498,
    "45,46,60,64,65": 1499,
    "45,46,66,67": 1500,
    "45,46,69,70": 1501,
    "45,47,50,55,62,67,69": 1502,
    "45,47,54,55,62,67,72": 1503,
    "45,47,54,55,62,71,72": 1504,
    "45,47,54,59,63,66": 1505,
    "45,47,55,59,62,66,67": 1506,
    "45,47,57": 1507,
    "45,47,57,59": 1508,
    "45,47,57,59,66,69,71,73,75,78": 1509,
    "45,48,52,53,60,65,67,69": 1510,
    "45,48,53": 1511,
    "45,48,53,55,60,64,65,67": 1512,
    "45,48,53,55,60,64,65,74": 1513,
    "45,48,53,60,63": 1514,
    "45,48,54,63,72": 1515,
    "45,48,55,63,69,72": 1516,
    "45,48,57,60": 1517,
    "45,49,50,67,69,74,76": 1518,
    "45,49,54,55,57,69": 1519,
    "45,49,55,57,69": 1520,
    "45,49,55,64": 1521,
    "45,49,57,61,68,69,73,76,78": 1522,
    "45,49,57,61,76,79,81": 1523,
    "45,49,57,64,73,76": 1524,
    "45,49,57,67,69,76": 1525,
    "45,49,57,67,69,79": 1526,
    "45,49,64,67,69": 1527,
    "45,49,79,85,88,93": 1528,
    "45,50,53,58": 1529,
    "45,50,53,64": 1530,
    "45,50,54,60,62": 1531,
    "45,50,54,60,62,74": 1532,
    "45,50,54,62,66,69,74": 1533,
    "45,50,55,70": 1534,
    "45,50,57,61,62,64,65": 1535,
    "45,50,57,65,69": 1536,
    "45,50,57,66,67,69,74,78,79": 1537,
    "45,50,62,66": 1538,
    "45,50,62,66,74": 1539,
    "45,50,64,65,67,69,73,74": 1540,
    "45,50,64,66,69,72": 1541,
    "45,51,53,57,60,65": 1542,
    "45,51,57,60,67,69": 1543,
    "45,51,60": 1544,
    "45,51,60,65": 1545,
    "45,51,60,67": 1546,
    "45,51,60,72": 1547,
    "45,52,54,55,57,61": 1548,
    "45,52,55,57,61": 1549,
    "45,52,55,58": 1550,
    "45,52,57,59,64,68": 1551,
    "45,52,57,60,69,76": 1552,
    "45,52,57,67,69": 1553,
    "45,52,59,60,64,68,69": 1554,
    "45,52,64,67,69,71,72": 1555,
    "45,53,54,63": 1556,
    "45,53,60,63,65,67": 1557,
    "45,53,60,63,72": 1558,
    "45,53,60,65": 1559,
    "45,53,60,65,69": 1560,
    "45,53,62,74": 1561,
    "45,53,63": 1562,
    "45,54,55,57": 1563,
    "45,54,56,63": 1564,
    "45,54,57,62": 1565,
    "45,54,59,62,66,69": 1566,
    "45,54,62,66,69": 1567,
    "45,54,62,72": 1568,
    "45,54,63": 1569,
    "45,54,63,72": 1570,
    "45,55,57,61,64,69": 1571,
    "45,55,58,76,77,81": 1572,
    "45,56,57,63": 1573,
    "45,57": 1574,
    "45,57,59,62,66,69": 1575,
    "45,57,60,62,66": 1576,
    "45,57,60,65": 1577,
    "45,57,61,64": 1578,
    "45,57,61,64,68": 1579,
    "45,57,61,64,69,73,79": 1580,
    "45,57,61,67,69,76": 1581,
    "45,57,61,69,70": 1582,
    "45,57,62,66": 1583,
    "45,57,62,66,69": 1584,
    "45,57,62,74,77": 1585,
    "45,57,64,67,69,72,73": 1586,
    "45,57,64,68,69": 1587,
    "45,57,64,69": 1588,
    "45,57,64,69,71,73,74": 1589,
    "45,57,64,69,72": 1590,
    "45,57,64,69,73": 1591,
    "45,57,64,73,76": 1592,
    "45,57,65,68,69": 1593,
    "45,57,65,68,77": 1594,
    "45,57,65,69,74": 1595,
    "45,57,65,74,77": 1596,
    "45,57,67,69,70": 1597,
    "45,57,67,69,79": 1598,
    "45,57,67,71,73": 1599,
    "45,57,69,72": 1600,
    "45,57,69,73,78": 1601,
    "45,57,69,76,81": 1602,
    "45,57,73,76,81": 1603,
    "45,58,60,72": 1604,
    "45,59,62,66": 1605,
    "45,60": 1606,
    "45,60,62,63": 1607,
    "45,60,63": 1608,
    "45,60,64,66": 1609,
    "45,60,64,69": 1610,
    "45,60,70,72": 1611,
    "45,60,72": 1612,
    "45,61,64": 1613,
    "45,63": 1614,
    "45,63,66": 1615,
    "45,63,72": 1616,
    "45,64,67,69": 1617,
    "45,64,67,69,73": 1618,
    "45,64,67,71": 1619,
    "45,64,71,79": 1620,
    "45,64,73,76": 1621,
    "45,65,69,74": 1622,
    "45,66,70": 1623,
    "45,67,69,71,72": 1624,
    "45,69,70,77": 1625,
    "45,70": 1626,
    "45,72": 1627,
    "45,72,74": 1628,
    "45,81,82": 1629,
    "45,87,88,89": 1630,
    "46": 1631,
    "46,47,52,53,60,62,72,74": 1632,
    "46,47,57,58,59,62,67,69": 1633,
    "46,47,66,67": 1634,
    "46,48": 1635,
    "46,48,49,63,64,70,72": 1636,
    "46,48,50,63,65,72,74": 1637,
    "46,48,50,63,65,75": 1638,
    "46,48,52,55,62,67": 1639,
    "46,48,53,57,58,62,63,69,70": 1640,
    "46,48,53,57,58,63,67,69": 1641,
    "46,48,53,57,58,63,69,70": 1642,
    "46,48,55,57": 1643,
    "46,48,55,58,63": 1644,
    "46,48,55,60,64,67": 1645,
    "46,48,55,64": 1646,
    "46,48,58": 1647,
    "46,48,58,60,66,70,72": 1648,
    "46,48,60,64": 1649,
    "46,48,60,70": 1650,
    "46,48,62,63,72,74": 1651,
    "46,48,62,63,74": 1652,
    "46,48,63,72": 1653,
    "46,48,63,74": 1654,
    "46,48,63,75": 1655,
    "46,49,50,64,65,69,70": 1656,
    "46,49,58": 1657,
    "46,49,64,70": 1658,
    "46,50": 1659,
    "46,50,51,63,65,67,69": 1660,
    "46,50,51,65,67,74,75": 1661,
    "46,50,51,65,67,75,77": 1662,
    "46,50,53,58,60,62,72,74": 1663,
    "46,50,53,58,60,70,72": 1664,
    "46,50,53,58,62": 1665,
    "46,50,53,58,62,70,74": 1666,
    "46,50,53,58,65": 1667,
    "46,50,54,58": 1668,
    "46,50,58": 1669,
    "46,50,58,62": 1670,
    "46,50,58,65,74,76": 1671,
    "46,50,58,65,76": 1672,
    "46,50,58,70": 1673,
    "46,50,60,65,70": 1674,
    "46,50,62": 1675,
    "46,50,64,72": 1676,
    "46,50,65,69": 1677,
    "46,50,65,70": 1678,
    "46,50,65,75": 1679,
    "46,50,65,77": 1680,
    "46,51,52,67,68,74,75": 1681,
    "46,51,53,57,60,65": 1682,
    "46,51,53,62,63,65,67": 1683,
    "46,51,53,67,69,74,75": 1684,
    "46,51,55,63": 1685,
    "46,51,60,63,70": 1686,
    "46,51,63,67": 1687,
    "46,51,67,75": 1688,
    "46,52,53,68,69,72,74": 1689,
    "46,52,60,72": 1690,
    "46,52,68,74": 1691,
    "46,53,55,60,62,63,65": 1692,
    "46,53,55,69,70,75,77": 1693,
    "46,53,58,60,62,72,74": 1694,
    "46,53,58,62": 1695,
    "46,53,58,62,65": 1696,
    "46,53,58,62,65,74": 1697,
    "46,53,58,62,69,70": 1698,
    "46,53,58,62,70": 1699,
    "46,53,58,63,67": 1700,
    "46,53,58,63,70": 1701,
    "46,53,58,63,70,74": 1702,
    "46,53,60,72": 1703,
    "46,53,62": 1704,
    "46,53,62,65": 1705,
    "46,53,62,65,81": 1706,
    "46,53,62,79": 1707,
    "46,53,62,79,81": 1708,
    "46,53,62,81": 1709,
    "46,53,63,77": 1710,
    "46,53,69,72": 1711,
    "46,53,70": 1712,
    "46,53,72,74": 1713,
    "46,54,58,62,66,74": 1714,
    "46,55": 1715,
    "46,55,56,70,71,74,75": 1716,
    "46,55,57": 1717,
    "46,55,57,58,60": 1718,
    "46,55,57,58,60,62,63": 1719,
    "46,55,57,58,70": 1720,
    "46,55,57,60,63": 1721,
    "46,55,57,60,65,69": 1722,
    "46,55,58": 1723,
    "46,55,58,67": 1724,
    "46,55,58,70": 1725,
    "46,55,60,64,67": 1726,
    "46,55,62,67": 1727,
    "46,55,65,67,74": 1728,
    "46,55,67,79": 1729,
    "46,55,69,70": 1730,
    "46,55,70": 1731,
    "46,55,70,75": 1732,
    "46,56,62,65": 1733,
    "46,56,71,74": 1734,
    "46,57,58": 1735,
    "46,57,58,60,62": 1736,
    "46,57,58,62,69": 1737,
    "46,57,58,69": 1738,
    "46,57,58,70": 1739,
    "46,57,58,72,74,86,87": 1740,
    "46,57,60": 1741,
    "46,58": 1742,
    "46,58,60": 1743,
    "46,58,62": 1744,
    "46,58,62,65,74": 1745,
    "46,58,62,65,74,77": 1746,
    "46,58,62,67": 1747,
    "46,58,62,70": 1748,
    "46,58,62,74": 1749,
    "46,58,63,66,72": 1750,
    "46,58,65": 1751,
    "46,58,66,80": 1752,
    "46,58,70": 1753,
    "46,60,62": 1754,
    "46,62,63,65,67,74": 1755,
    "46,62,63,65,67,77,79": 1756,
    "46,62,65,70,77": 1757,
    "46,62,65,74": 1758,
    "46,62,65,77": 1759,
    "46,62,67": 1760,
    "46,62,74": 1761,
    "46,62,74,78,79": 1762,
    "46,63,67,74": 1763,
    "46,63,67,79": 1764,
    "46,64,73": 1765,
    "46,65,68": 1766,
    "46,66,67": 1767,
    "46,67": 1768,
    "46,67,69": 1769,
    "46,70,77,78": 1770,
    "46,71,77,80": 1771,
    "46,72": 1772,
    "46,74": 1773,
    "46,74,79": 1774,
    "46,77": 1775,
    "46,80": 1776,
    "46,85,97": 1777,
    "47,48,50,62,66,67": 1778,
    "47,48,51,52,59,71,76": 1779,
    "47,48,52,53,55,56,60,62": 1780,
    "47,48,52,53,60,62,72,74": 1781,
    "47,48,54": 1782,
    "47,48,55,57,62,66,67": 1783,
    "47,48,55,62,64,69,71": 1784,
    "47,48,56,57,60,65,77": 1785,
    "47,48,56,57,64,65,69,74": 1786,
    "47,48,56,64,65,72,74": 1787,
    "47,48,59,60": 1788,
    "47,48,59,60,62,65,68,69": 1789,
    "47,48,59,60,69,74": 1790,
    "47,48,62,64,67,71": 1791,
    "47,48,62,66,67,69,71": 1792,
    "47,49,52,56": 1793,
    "47,49,54,56,68,69": 1794,
    "47,49,61": 1795,
    "47,50,51,57": 1796,
    "47,50,55,67": 1797,
    "47,50,57": 1798,
    "47,50,67": 1799,
    "47,51,52,57": 1800,
    "47,51,56,63": 1801,
    "47,51,57": 1802,
    "47,51,57,59,69,78": 1803,
    "47,51,57,69,78": 1804,
    "47,51,59,66,71": 1805,
    "47,51,66,71,78": 1806,
    "47,52,54,57": 1807,
    "47,52,59,63,64,66,68": 1808,
    "47,53,56,62": 1809,
    "47,53,62,65": 1810,
    "47,53,62,74": 1811,
    "47,54": 1812,
    "47,54,63,66": 1813,
    "47,54,63,75": 1814,
    "47,54,64,67,70": 1815,
    "47,54,64,75": 1816,
    "47,54,71,73": 1817,
    "47,55,56,65,74": 1818,
    "47,55,59,62,67": 1819,
    "47,55,62,67": 1820,
    "47,55,62,67,71": 1821,
    "47,55,62,67,79": 1822,
    "47,55,62,71": 1823,
    "47,55,62,79": 1824,
    "47,55,65,74": 1825,
    "47,55,67": 1826,
    "47,55,67,71": 1827,
    "47,55,67,71,79": 1828,
    "47,55,79": 1829,
    "47,56,57,62,64,73,74,76": 1830,
    "47,56,57,62,64,74,76": 1831,
    "47,56,57,62,74": 1832,
    "47,56,57,62,74,76": 1833,
    "47,56,57,64,65,76,77": 1834,
    "47,56,57,65,74": 1835,
    "47,56,57,65,77": 1836,
    "47,56,57,68": 1837,
    "47,56,65": 1838,
    "47,56,65,74": 1839,
    "47,56,65,77": 1840,
    "47,57": 1841,
    "47,57,59,66,68": 1842,
    "47,59": 1843,
    "47,59,60,63,64,66": 1844,
    "47,59,62,66": 1845,
    "47,59,63,66": 1846,
    "47,59,66,71,75": 1847,
    "47,60,64,66": 1848,
    "47,60,65,89,91": 1849,
    "47,62,67": 1850,
