{
  "token_to_id": {
    "101": 1,
    "24,29,36,41,52,53,55,57,60": 2,
    "24,31,36,43,51,53,55,59,60,62": 3,
    "24,36": 4,
    "24,36,43": 5,
    "24,36,43,52": 6,
    "24,36,48": 7,
    "24,36,48,52,55,60": 8,
    "24,36,48,53,55,60": 9,
    "24,36,51,55,60": 10,
    "24,36,52": 11,
    "24,36,52,55": 12,
    "24,36,52,55,58,60,64": 13,
    "24,36,55,60": 14,
    "24,36,55,64": 15,
    "24,36,60,64": 16,
    "24,36,60,67": 17,
    "24,36,64,67": 18,
    "24,36,66,69,78": 19,
    "24,36,67,72": 20,
    "24,36,67,76": 21,
    "24,36,72,76": 22,
    "24,36,72,79": 23,
    "24,36,72,84": 24,
    "24,36,76,79": 25,
    "24,36,79,84": 26,
    "24,36,79,88": 27,
    "24,36,84,88": 28,
    "24,36,88,91": 29,
    "24,36,91,96": 30,
    "25,26,37,38,49,50,61,62": 31,
    "25,27,37,39,101": 32,
    "25,30,37,42,49,54,63": 33,
    "25,30,37,42,56,58,61": 34,
    "25,31,37,43,53,55,56,59,61,63,65": 35,
    "25,32,37,44,51,53,56,60,61,63,65": 36,
    "25,32,37,44,53,54,60,61,63,65": 37,
    "25,32,37,44,60,61,65,66,68,72,73": 38,
    "25,37": 39,
    "25,37,101": 40,
    "25,37,49": 41,
    "25,37,49,53,56,61,65,73,77": 42,
    "25,37,49,56,61,65,73,77": 43,
    "25,37,49,57,61,66,73": 44,
    "25,37,49,61": 45,
    "25,37,53,56,61,65": 46,
    "25,37,53,61,65": 47,
    "25,37,54,61,66,70": 48,
    "25,37,61,65,73": 49,
    "25,37,65": 50,
    "25,37,65,70,77": 51,
    "25,37,79,82,87,91": 52,
    "25,37,81,88,93": 53,
    "25,66,68,73": 54,
    "25,85,89": 55,
    "25,85,89,92": 56,
    "26": 57,
    "26,27,38,39": 58,
    "26,28,38,40,93,98": 59,
    "26,29,38,41": 60,
    "26,30,38,42,54,62,66,74": 61,
    "26,31,38,43,48": 62,
    "26,38": 63,
    "26,38,47,50,55,59,62,67,74": 64,
    "26,38,48,54": 65,
    "26,38,50,54,57,62": 66,
    "26,38,50,62": 67,
    "26,38,54,57": 68,
    "26,38,54,57,62,74": 69,
    "26,38,57,62": 70,
    "26,38,60,62": 71,
    "26,38,60,62,66,71": 72,
    "26,38,60,66": 73,
    "26,38,62,67,70,74": 74,
    "26,38,62,74": 75,
    "26,38,66,69": 76,
    "26,38,69,74": 77,
    "26,38,70,74,82": 78,
    "26,38,72,74": 79,
    "26,38,72,78": 80,
    "26,38,78,81": 81,
    "26,38,81,86": 82,
    "26,38,82,86": 83,
    "26,38,84,86": 84,
    "26,38,84,90": 85,
    "26,38,90,93": 86,
    "26,38,93,98": 87,
    "27,28,39,40,51,63": 88,
    "27,29,39,41": 89,
    "27,29,41": 90,
    "27,30,39,42,51,63": 91,
    "27,30,39,42,51,63,82,94": 92,
    "27,32,39,44,51,54,55,60,61,63,65": 93,
    "27,32,39,44,70,73,77": 94,
    "27,32,39,44,73,77,82,85,89": 95,
    "27,34,39,46,51,58,63": 96,
    "27,34,39,46,70,74,75,77,78,82": 97,
    "27,34,39,46,80,84,92,96": 98,
    "27,39": 99,
    "27,39,49,51,55,60,63": 100,
    "27,39,51": 101,
    "27,39,51,55,61,63": 102,
    "27,39,51,55,61,63,70": 103,
    "27,39,51,55,61,63,73": 104,
    "27,39,51,63": 105,
    "27,39,55,61,70": 106,
    "27,39,58,63,68": 107,
    "27,39,61,63,67,70,75": 108,
    "27,39,63,66,72,75": 109,
    "27,39,63,68,73": 110,
    "27,39,68,70,72,73": 111,
    "27,39,68,72": 112,
    "27,39,70,75,78,82": 113,
    "27,39,72,73,80,82,84,85": 114,
    "27,39,72,80,84": 115,
    "27,39,75,87": 116,
    "27,39,84,85,90,91,93,94": 117,
    "27,39,84,87,91,96": 118,
    "27,39,85,91,94,96": 119,
    "27,39,87,99": 120,
    "27,39,89,97": 121,
    "27,51": 122,
    "28": 123,
    "28,29,31,40,41,43": 124,
    "28,29,40,41": 125,
    "28,29,40,41,47": 126,
    "28,29,40,41,83,84,95,96": 127,
    "28,30,40,42,83,86": 128,
    "28,32,40,44,60,64,72": 129,
    "28,35": 130,
    "28,35,40,47,59,63,64,68,71": 131,
    "28,35,40,52,56,59,64": 132,
    "28,35,40,56,59,64": 133,
    "28,40": 134,
    "28,40,44,51,56,59,63,64,68,71": 135,
    "28,40,47": 136,
    "28,40,47,52,56,59": 137,
    "28,40,47,56": 138,
    "28,40,49,56,61": 139,
    "28,40,50,52,56,59": 140,
    "28,40,50,52,56,60": 141,
    "28,40,51,63": 142,
    "28,40,52,55,59,64": 143,
    "28,40,52,56,59,64": 144,
    "28,40,52,57,59,62,66,71,78,90": 145,
    "28,40,52,58,66,78": 146,
    "28,40,52,60,67,72,84,96": 147,
    "28,40,55,58,61,67": 148,
    "28,40,56,59": 149,
    "28,40,56,59,64": 150,
    "28,40,58,60,63,70": 151,
    "28,40,59,64": 152,
    "28,40,59,64,68,71": 153,
    "28,40,59,64,70": 154,
    "28,40,59,68": 155,
    "28,40,60,64,72": 156,
    "28,40,62,64,68,71,76": 157,
    "28,40,64,68": 158,
    "28,40,68,71": 159,
    "28,40,68,76": 160,
    "28,40,69,71": 161,
    "28,40,71,74,76,80,83": 162,
    "28,40,71,76": 163,
    "28,40,71,80": 164,
    "28,40,76,80": 165,
    "28,40,78,90": 166,
    "28,40,80,83": 167,
    "28,40,80,88": 168,
    "28,40,83,86": 169,
    "28,40,83,88": 170,
    "28,40,83,91": 171,
    "28,40,83,92": 172,
    "28,40,84,96": 173,
    "28,40,88,92": 174,
    "28,40,91,93": 175,
    "28,40,92,100": 176,
    "28,40,92,95": 177,
    "28,40,95,100": 178,
    "28,47": 179,
    "29,30,41,42": 180,
    "29,30,41,42,96,100": 181,
    "29,31,41,43": 182,
    "29,32,41,44,62,65,70,74": 183,
    "29,32,41,44,62,65,71,74": 184,
    "29,33,41,45": 185,
    "29,33,41,45,53,61,65": 186,
    "29,34,41,46": 187,
    "29,34,41,46,72,73": 188,
    "29,34,41,46,75,78,84,87,90": 189,
    "29,36,41,48": 190,
    "29,36,80,84,89,92": 191,
    "29,41": 192,
    "29,41,47,57": 193,
    "29,41,48": 194,
    "29,41,48,51,57,60": 195,
    "29,41,48,53,56,60": 196,
    "29,41,48,53,57,60": 197,
    "29,41,48,57": 198,
    "29,41,49,51,57,61": 199,
    "29,41,51,57,60": 200,
    "29,41,51,63": 201,
    "29,41,52,58,60,67,68": 202,
    "29,41,52,58,60,67,68,70": 203,
    "29,41,53,56,60,67,70": 204,
    "29,41,53,57,60": 205,
    "29,41,53,58,61,65": 206,
    "29,41,53,58,61,65,70,73,76,79,85": 207,
    "29,41,53,58,61,67,70,76,79,85": 208,
    "29,41,53,60,63,65": 209,
    "29,41,53,61,65": 210,
    "29,41,53,65": 211,
    "29,41,55,57,60,63,69": 212,
    "29,41,56,59,62,68": 213,
    "29,41,56,60,63,68": 214,
    "29,41,56,60,65,67,79,80,82": 215,
    "29,41,56,60,65,68": 216,
    "29,41,57,59": 217,
    "29,41,57,60": 218,
    "29,41,57,65,69": 219,
    "29,41,58,60,63,70": 220,
    "29,41,58,60,64,67,68,79": 221,
    "29,41,58,60,65,70": 222,
    "29,41,59,63": 223,
    "29,41,59,69": 224,
    "29,41,60,63": 225,
    "29,41,60,64": 226,
    "29,41,60,65": 227,
    "29,41,60,69": 228,
    "29,41,61,65,70,73": 229,
    "29,41,62,65": 230,
    "29,41,62,65,70,74": 231,
    "29,41,62,65,71,74": 232,
    "29,41,63,65,69,72": 233,
    "29,41,63,69,78": 234,
    "29,41,65,74": 235,
    "29,41,68,70": 236,
    "29,41,68,80": 237,
    "29,41,68,80,82": 238,
    "29,41,69": 239,
    "29,41,69,71": 240,
    "29,41,69,72": 241,
    "29,41,69,72,77": 242,
    "29,41,70,76,79,85": 243,
    "29,41,71,74,77": 244,
    "29,41,71,75": 245,
    "29,41,72,75": 246,
    "29,41,72,76": 247,
    "29,41,72,77": 248,
    "29,41,72,81": 249,
    "29,41,73,75,82,84,85,87": 250,
    "29,41,73,82,85": 251,
    "29,41,81,84": 252,
    "29,41,82,84": 253,
    "29,41,83,87": 254,
    "29,41,83,92,95": 255,
    "29,41,83,95": 256,
    "29,41,84,87": 257,
    "29,41,84,88": 258,
    "29,41,84,89": 259,
    "29,41,84,93": 260,
    "29,41,93,96": 261,
    "29,41,96,99": 262,
    "29,53,60,65,69": 263,
    "29,53,65": 264,
    "29,53,65,80,81": 265,
    "29,63,69,74": 266,
    "29,72,77,79": 267,
    "30": 268,
    "30,31,42,43,48": 269,
    "30,31,42,43,50,57,60,62": 270,
    "30,31,42,43,54,66": 271,
    "30,31,42,43,71,74": 272,
    "30,32,42,44": 273,
    "30,32,42,44,51,53,59,63,65": 274,
    "30,32,42,44,54,56,66,68": 275,
    "30,33,42,45": 276,
    "30,33,42,45,54,57,66,69": 277,
    "30,33,42,45,54,61,66": 278,
    "30,33,42,45,60,62": 279,
    "30,34,42,46": 280,
    "30,34,42,46,70,82,94": 281,
    "30,38,42,50,54,58": 282,
    "30,38,42,58,62": 283,
    "30,42": 284,
    "30,42,46,53,54,56,62,66,78": 285,
    "30,42,48,57": 286,
    "30,42,49,54,61,65,70,77": 287,
    "30,42,51,58": 288,
    "30,42,51,63": 289,
    "30,42,54": 290,
    "30,42,54,58": 291,
    "30,42,54,59,61,64,68,73,80,92": 292,
    "30,42,54,61,66": 293,
    "30,42,54,61,66,70": 294,
    "30,42,54,62": 295,
    "30,42,54,63,66": 296,
    "30,42,54,66": 297,
    "30,42,57,60": 298,
    "30,42,58,62": 299,
    "30,42,58,62,66": 300,
    "30,42,60,62": 301,
    "30,42,60,63": 302,
    "30,42,60,64,72": 303,
    "30,42,60,69": 304,
    "30,42,61,73": 305,
    "30,42,62,66": 306,
    "30,42,66,70,74": 307,
    "30,42,66,74": 308,
    "30,42,69,72": 309,
    "30,42,70,74": 310,
    "30,42,71,74": 311,
    "30,42,71,79": 312,
    "30,42,72,74": 313,
    "30,42,72,74,81,84": 314,
    "30,42,72,75": 315,
    "30,42,72,76": 316,
    "30,42,72,81": 317,
    "30,42,79,83": 318,
    "30,42,80,92": 319,
    "30,42,81,84": 320,
    "30,42,82,94": 321,
    "30,42,84,86": 322,
    "30,42,84,87": 323,
    "30,42,84,88": 324,
    "30,42,84,93": 325,
    "30,42,87,99": 326,
    "30,42,93,96": 327,
    "30,42,96,100": 328,
    "30,54,61,66,70": 329,
    "30,61,66,70": 330,
    "30,69,73,78,81": 331,
    "31": 332,
    "31,32,43,44": 333,
    "31,32,43,44,55,63": 334,
    "31,32,43,44,56,63": 335,
    "31,32,43,44,62,65,70,71,74": 336,
    "31,33,43,45": 337,
    "31,33,55,60,63,67": 338,
    "31,34,43,46,55,63,67": 339,
    "31,35,43,47,65,67,75": 340,
    "31,35,67,77,79,86,89": 341,
    "31,36": 342,
    "31,36,43,47,48": 343,
    "31,36,43,51,55,60": 344,
    "31,36,67,68,75,77,79,80": 345,
    "31,36,67,79": 346,
    "31,36,68,75,77,80": 347,
    "31,38,43,47": 348,
    "31,38,43,50": 349,
    "31,38,47,53": 350,
    "31,38,48,55": 351,
    "31,43": 352,
    "31,43,47": 353,
    "31,43,47,53": 354,
    "31,43,47,55": 355,
    "31,43,48": 356,
    "31,43,48,53": 357,
    "31,43,48,55": 358,
    "31,43,50": 359,
    "31,43,50,51,57,60,62,63": 360,
    "31,43,50,53": 361,
    "31,43,50,53,59,62": 362,
    "31,43,50,55": 363,
    "31,43,50,55,58": 364,
    "31,43,50,55,58,60": 365,
    "31,43,50,55,58,62": 366,
    "31,43,50,55,59,62": 367,
    "31,43,50,58": 368,
    "31,43,51,57,60,63": 369,
    "31,43,52,55": 370,
    "31,43,52,58,61,64": 371,
    "31,43,53,55": 372,
    "31,43,53,55,59,62,63": 373,
    "31,43,53,55,59,63": 374,
    "31,43,53,56": 375,
    "31,43,53,59": 376,
    "31,43,54,66": 377,
    "31,43,55": 378,
    "31,43,55,58,63,67": 379,
    "31,43,55,59": 380,
    "31,43,55,59,62": 381,
    "31,43,55,59,62,67": 382,
    "31,43,55,59,63,67": 383,
    "31,43,55,60": 384,
    "31,43,55,62": 385,
    "31,43,55,63": 386,
    "31,43,55,67": 387,
    "31,43,56,61,64,68": 388,
    "31,43,56,62": 389,
    "31,43,57,60,63": 390,
    "31,43,57,63": 391,
    "31,43,58,60,65,70": 392,
    "31,43,58,62": 393,
    "31,43,59": 394,
    "31,43,59,62": 395,
    "31,43,59,62,67": 396,
    "31,43,59,63": 397,
    "31,43,59,64,70": 398,
    "31,43,59,65": 399,
    "31,43,59,67": 400,
    "31,43,60,62": 401,
    "31,43,60,63,70": 402,
    "31,43,60,64": 403,
    "31,43,60,65": 404,
    "31,43,60,67": 405,
    "31,43,61,63": 406,
    "31,43,61,67": 407,
    "31,43,62,65": 408,
    "31,43,62,65,70,74": 409,
    "31,43,62,67": 410,
    "31,43,63,66": 411,
    "31,43,63,66,71,75": 412,
    "31,43,63,67,74": 413,
    "31,43,63,70": 414,
    "31,43,64,72,76": 415,
    "31,43,65,67": 416,
    "31,43,65,67,75": 417,
    "31,43,65,68": 418,
    "31,43,65,72": 419,
    "31,43,65,73": 420,
    "31,43,67,71": 421,
    "31,43,67,72": 422,
    "31,43,67,74": 423,
    "31,43,67,79": 424,
    "31,43,68,74": 425,
    "31,43,69,75": 426,
    "31,43,70,74": 427,
    "31,43,70,74,79,82": 428,
    "31,43,71,74": 429,
    "31,43,71,77": 430,
    "31,43,71,79": 431,
    "31,43,72,74": 432,
    "31,43,72,77": 433,
    "31,43,72,79": 434,
    "31,43,74,77": 435,
    "31,43,74,79": 436,
    "31,43,77,79": 437,
    "31,43,77,80": 438,
    "31,43,77,84": 439,
    "31,43,79,83": 440,
    "31,43,79,84": 441,
    "31,43,79,86": 442,
    "31,43,80,86": 443,
    "31,43,81,87": 444,
    "31,43,83,86": 445,
    "31,43,83,89": 446,
    "31,43,83,91": 447,
    "31,43,84,86": 448,
    "31,43,84,89": 449,
    "31,43,84,91": 450,
    "31,43,86,89": 451,
    "31,43,86,91": 452,
    "31,43,89,91": 453,
    "31,43,89,92": 454,
    "31,43,89,96": 455,
    "31,43,91,95": 456,
    "31,43,91,96": 457,
    "31,43,91,98": 458,
    "31,43,92,98": 459,
    "31,43,95,101": 460,
    "31,43,95,98": 461,
    "31,43,96,98": 462,
    "31,46": 463,
    "31,47,50,55,59": 464,
    "31,48,55": 465,
    "31,50,55": 466,
    "31,50,60,62,64": 467,
    "31,55,58,60,62,67": 468,
    "31,55,58,62,67": 469,
    "31,55,60,67": 470,
    "32": 471,
    "32,33,44,45": 472,
    "32,33,44,45,52,54,55,60,61,63": 473,
    "32,33,44,45,56,57,68,69": 474,
    "32,33,44,45,56,63": 475,
    "32,33,44,45,57,63": 476,
    "32,34,41,44,46,58,60,65,66,68,70,72": 477,
    "32,34,44,46": 478,
    "32,34,44,46,59,63,68,71": 479,
    "32,35,44,47": 480,
    "32,37": 481,
    "32,37,44,49": 482,
    "32,37,44,49,56,61,68,73": 483,
    "32,37,44,49,61,63": 484,
    "32,37,44,49,61,63,68,73,75": 485,
    "32,37,44,56,60,61,63,64,68": 486,
    "32,37,44,56,60,61,63,64,68,70": 487,
    "32,37,44,56,61,64,70": 488,
    "32,37,49,56": 489,
    "32,37,68,77,80": 490,
    "32,38,44,50": 491,
    "32,39,44,51": 492,
    "32,39,44,51,59,63,67,68,71": 493,
    "32,39,44,60,63,68": 494,
    "32,39,44,60,63,68,70": 495,
    "32,39,46,51": 496,
    "32,39,46,51,58": 497,
    "32,39,48,51": 498,
    "32,39,48,51,60": 499,
    "32,39,51,56": 500,
    "32,39,51,58": 501,
    "32,39,51,63": 502,
    "32,39,60,68": 503,
    "32,39,60,70": 504,
    "32,40,44,49": 505,
    "32,42,44,54": 506,
    "32,44": 507,
    "32,44,48,51,56,60": 508,
    "32,44,49,51,56,58,60": 509,
    "32,44,49,56,58": 510,
    "32,44,49,56,61,65,68,77": 511,
    "32,44,51,53,59,63,65": 512,
    "32,44,51,53,59,63,65,71,75,77": 513,
    "32,44,51,56,60,63": 514,
    "32,44,51,56,63,68": 515,
    "32,44,51,60": 516,
    "32,44,51,60,63,75,84,87": 517,
    "32,44,51,60,63,75,84,87,89": 518,
    "32,44,51,60,68": 519,
    "32,44,51,63,72,75,77": 520,
    "32,44,52,56,61": 521,
    "32,44,52,57,61": 522,
    "32,44,53,59,63,65": 523,
    "32,44,53,60,65": 524,
    "32,44,54,56,60,63,64": 525,
    "32,44,54,60,65": 526,
    "32,44,54,61,63": 527,
    "32,44,54,61,66": 528,
    "32,44,54,65": 529,
    "32,44,54,66": 530,
    "32,44,54,68": 531,
    "32,44,55,56,60,61,68,70": 532,
    "32,44,56": 533,
    "32,44,56,60,61,63,64,68,70": 534,
    "32,44,56,60,63,68": 535,
    "32,44,56,60,64": 536,
    "32,44,56,60,68": 537,
    "32,44,56,61": 538,
    "32,44,56,61,64,70": 539,
    "32,44,56,63": 540,
    "32,44,56,63,66,68": 541,
    "32,44,56,64": 542,
    "32,44,56,68": 543,
    "32,44,59,62": 544,
    "32,44,59,63,67": 545,
    "32,44,59,63,68": 546,
    "32,44,59,63,68,71": 547,
    "32,44,59,64": 548,
    "32,44,60,63": 549,
    "32,44,60,64,72": 550,
    "32,44,60,66,68,72": 551,
    "32,44,60,68": 552,
    "32,44,61,63": 553,
    "32,44,61,68": 554,
    "32,44,61,73": 555,
    "32,44,62,64": 556,
    "32,44,62,65,70,74": 557,
    "32,44,62,65,71,74": 558,
    "32,44,63,65": 559,
    "32,44,63,66": 560,
    "32,44,63,66,72,77,80,84,89": 561,
    "32,44,63,68": 562,
    "32,44,63,68,72,75": 563,
    "32,44,63,68,73": 564,
    "32,44,63,68,73,75": 565,
    "32,44,63,70": 566,
    "32,44,65,71,75,77": 567,
    "32,44,65,73,77,80,84,85,89": 568,
    "32,44,66,68": 569,
    "32,44,68": 570,
    "32,44,68,75": 571,
    "32,44,72": 572,
    "32,44,72,73": 573,
    "32,44,72,73,75,77": 574,
    "32,44,73,77": 575,
    "32,44,73,77,82,85,89": 576,
    "32,44,74,76": 577,
    "32,44,75": 578,
    "32,44,75,77,84,85,87,89": 579,
    "32,44,77": 580,
    "32,44,77,80,84,89": 581,
    "32,44,77,85,89": 582,
    "32,44,78": 583,
    "32,44,78,80": 584,
    "32,44,83,95": 585,
    "32,44,86,88": 586,
    "32,45,65,72,77": 587,
    "32,51,52,56,60,61,63,64,68,72": 588,
    "32,51,56,60,63": 589,
    "32,51,56,60,63,68": 590,
    "32,51,68,75": 591,
    "32,52,56,61,64,68": 592,
    "32,52,56,61,64,68,70": 593,
    "32,52,56,61,64,68,72": 594,
    "32,52,56,61,64,72": 595,
    "32,53,55,56,58,61,63,65,67,68,70,73,75,77": 596,
    "32,53,56": 597,
    "32,53,56,61,65,68,73": 598,
    "32,53,56,61,65,68,73,77,80": 599,
    "32,53,56,61,65,68,73,79": 600,
    "32,53,56,61,65,68,73,79,82": 601,
    "32,53,56,61,65,68,73,80,82": 602,
    "32,55,56,58,60,61,63,66,67,68,70,72,73": 603,
    "32,55,58,61,63,67,70,73,77": 604,
    "32,55,58,61,63,67,70,75,79": 605,
    "32,55,58,61,63,67,70,77,79": 606,
    "32,55,58,61,63,67,70,79": 607,
    "32,55,58,63,67,70": 608,
    "32,55,58,63,67,70,75": 609,
    "32,56,61,65,68,73,77": 610,
    "32,56,68": 611,
    "32,60,72,73": 612,
    "32,60,78,80": 613,
    "32,61,72": 614,
    "32,66,68,75": 615,
    "32,66,72,78": 616,
    "32,72": 617,
    "32,73": 618,
    "32,75": 619,
    "32,78": 620,
    "32,80": 621,
    "32,84,92": 622,
    "32,84,92,94": 623,
    "33": 624,
    "33,34,36,45,46,48": 625,
    "33,34,41,45,46,52,53,55,58,61": 626,
    "33,34,45,46": 627,
    "33,34,45,46,55,63,67": 628,
    "33,34,45,46,61,65,70,72,73,75": 629,
    "33,34,53,55,58,62,65,67": 630,
    "33,35,45,47": 631,
    "33,35,45,47,54,56,62,66,68": 632,
    "33,35,45,47,57,69": 633,
    "33,36,45,48": 634,
    "33,36,45,48,66,69": 635,
    "33,37,45,49": 636,
    "33,38,40,45,57,60,62,64,65,69": 637,
    "33,38,45,52,54,61,64,66": 638,
    "33,38,45,52,61,64,66": 639,
    "33,38,45,57,62,65,69": 640,
    "33,40,41,45,57,59,60,62,64,69": 641,
    "33,40,41,52,53,64,65": 642,
    "33,40,41,52,53,65": 643,
    "33,40,45,57,60,64,69": 644,
    "33,40,48": 645,
    "33,40,48,52,57": 646,
    "33,40,48,57": 647,
    "33,40,48,64": 648,
    "33,40,48,67": 649,
    "33,40,48,71": 650,
    "33,40,52,59": 651,
    "33,40,52,60": 652,
    "33,40,52,64": 653,
    "33,41,45,53,65,73,77": 654,
    "33,41,45,57,59,62,69": 655,
    "33,41,45,57,65,72,75,77": 656,
    "33,41,53,65": 657,
    "33,41,53,69": 658,
    "33,41,53,81,93": 659,
    "33,45": 660,
    "33,45,46,53,61": 661,
    "33,45,47,72,76": 662,
    "33,45,48": 663,
    "33,45,48,52,57,60": 664,
    "33,45,48,53": 665,
    "33,45,49,56,57,59,65,69,81": 666,
    "33,45,52": 667,
    "33,45,52,55,61": 668,
    "33,45,52,57,60,64,65,69": 669,
    "33,45,52,57,61,64": 670,
    "33,45,52,60,62,63": 671,
    "33,45,52,60,69": 672,
    "33,45,52,61,64": 673,
    "33,45,53,60": 674,
    "33,45,53,61,65": 675,
    "33,45,54,55,63,66,67": 676,
    "33,45,54,60,63,66": 677,
    "33,45,54,61,66": 678,
    "33,45,54,66": 679,
    "33,45,55,57,61,63,64,69,75,76": 680,
    "33,45,55,57,61,64,66,69,76,78": 681,
    "33,45,55,58,63,67": 682,
    "33,45,55,63,67": 683,
    "33,45,57,60": 684,
    "33,45,57,60,62": 685,
    "33,45,57,61": 686,
    "33,45,57,69": 687,
    "33,45,60,63,66": 688,
    "33,45,60,63,67,72": 689,
    "33,45,60,64": 690,
    "33,45,60,64,69": 691,
    "33,45,60,65": 692,
    "33,45,60,66": 693,
    "33,45,61": 694,
    "33,45,61,63": 695,
    "33,45,61,64": 696,
    "33,45,61,65": 697,
    "33,45,61,69": 698,
    "33,45,62,65": 699,
    "33,45,63,64,69,75,76": 700,
    "33,45,63,67,72": 701,
    "33,45,64,65": 702,
    "33,45,64,67": 703,
    "33,45,64,67,72,76": 704,
    "33,45,64,69,76": 705,
    "33,45,64,72": 706,
    "33,45,65,67,75": 707,
    "33,45,65,72": 708,
    "33,45,65,72,75": 709,
    "33,45,66,72": 710,
    "33,45,69,72": 711,
    "33,45,72": 712,
    "33,45,72,75": 713,
    "33,45,72,76": 714,
    "33,45,72,77": 715,
    "33,45,72,78": 716,
    "33,45,73,77,81": 717,
    "33,45,76,77": 718,
    "33,45,76,79": 719,
    "33,45,76,81": 720,
    "33,45,77,84": 721,
    "33,45,78,84": 722,
    "33,45,78,90": 723,
    "33,45,81,84": 724,
    "33,45,81,85": 725,
    "33,45,84,88": 726,
    "33,45,84,89": 727,
    "33,45,84,90": 728,
    "33,45,85,91": 729,
    "33,45,88,89": 730,
    "33,45,89,96": 731,
    "33,45,90,96": 732,
    "33,45,96,100": 733,
    "33,45,97": 734,
    "33,46,67,72,73,79": 735,
    "33,48": 736,
    "33,48,57": 737,
    "33,48,64": 738,
    "33,48,67": 739,
    "33,52": 740,
    "33,52,57": 741,
    "33,52,57,60": 742,
    "33,52,57,64,69,73,81": 743,
    "33,52,59,62,64,66": 744,
    "33,52,59,62,64,69": 745,
    "33,52,60": 746,
    "33,52,60,64": 747,
    "33,52,64": 748,
    "33,52,67": 749,
    "33,52,71": 750,
    "33,55,62,63,67": 751,
    "33,55,62,67": 752,
    "33,55,63,67": 753,
    "33,57,61": 754,
    "33,57,62": 755,
    "33,57,64": 756,
    "33,62,68": 757,
    "33,62,71": 758,
    "33,64": 759,
    "33,64,69": 760,
    "33,69": 761,
    "33,69,71": 762,
    "33,69,73": 763,
    "33,69,76": 764,
    "33,81,85": 765,
    "33,81,88": 766,
    "33,88,93": 767,
    "33,93,97": 768,
    "33,93,99,100": 769,
    "33,96,100": 770,
    "33,96,101": 771,
    "34": 772,
    "34,35,46,47": 773,
    "34,35,46,47,56,61,62,66,70": 774,
    "34,35,46,47,58,59,70,71": 775,
    "34,35,46,47,58,70": 776,
    "34,35,46,47,58,70,82": 777,
    "34,35,46,47,59,63,68,71": 778,
    "34,36,37,46,48,49": 779,
    "34,36,46,48": 780,
    "34,36,46,48,60,67,69,72": 781,
    "34,36,46,48,61,64,65,68,70,72,73": 782,
    "34,36,46,48,65,68,70,77": 783,
    "34,36,46,48,67,70,75,79": 784,
    "34,37,41,42,46,49,53,54,58": 785,
    "34,37,41,42,46,49,53,54,58,61": 786,
    "34,37,41,42,46,49,53,54,58,61,65": 787,
    "34,37,41,42,46,49,53,54,60": 788,
    "34,37,41,42,46,49,53,54,60,61": 789,
    "34,37,41,42,46,49,53,54,60,63,65": 790,
    "34,37,41,42,46,49,53,58,61": 791,
    "34,37,41,42,46,49,54,58,61,70": 792,
    "34,37,41,42,46,49,54,58,70,73,82": 793,
    "34,37,41,42,46,49,58,61,65": 794,
    "34,37,41,42,46,49,58,61,65,66,70,73": 795,
    "34,37,41,42,46,49,58,61,65,70,73": 796,
    "34,37,41,42,46,49,58,61,66,68": 797,
    "34,37,41,42,46,49,58,61,70": 798,
    "34,37,41,42,46,49,58,65,66,70": 799,
    "34,37,41,42,46,49,60,65,66,72": 800,
    "34,37,41,42,46,49,61,65,70,73,77": 801,
    "34,37,41,42,46,49,61,70,73,82": 802,
    "34,37,41,42,46,49,65,66,73,77": 803,
    "34,37,41,42,46,49,66,68,73,78,80": 804,
    "34,37,41,42,46,49,66,73,78,80": 805,
    "34,37,41,46,49,53,58": 806,
    "34,37,46,49": 807,
    "34,37,46,49,58,70": 808,
    "34,37,46,49,61,73,78,87,90": 809,
    "34,39,41,46,49,54,70,72,73,75,77,78,82,84,85": 810,
    "34,39,46,51": 811,
    "34,39,46,51,63,67,75": 812,
    "34,39,46,51,67,70,75,79": 813,
    "34,39,46,51,67,70,75,79,82": 814,
    "34,39,46,51,70,79,82": 815,
    "34,40,53,58,62,65": 816,
    "34,41,46": 817,
    "34,41,46,50,53,58,62": 818,
    "34,41,46,53": 819,
    "34,41,46,53,58": 820,
    "34,41,46,53,58,60": 821,
    "34,41,46,53,58,60,61,63": 822,
    "34,41,46,53,58,61": 823,
    "34,41,46,53,60": 824,
    "34,41,46,53,60,63": 825,
    "34,41,46,58,60,65,70,72": 826,
    "34,41,46,58,61,65": 827,
    "34,41,46,58,61,68": 828,
    "34,41,46,58,61,68,70": 829,
    "34,41,46,58,61,70": 830,
    "34,41,46,58,65,70": 831,
    "34,41,46,60,65,72": 832,
    "34,41,46,65,73,77": 833,
    "34,41,46,68,70,73,80,82": 834,
    "34,41,46,68,73,80": 835,
    "34,41,46,70,73,82": 836,
    "34,41,49,53,58": 837,
    "34,41,49,70,77,82": 838,
    "34,41,53": 839,
    "34,41,58,62,67": 840,
    "34,42,46,54": 841,
    "34,43,53,58,62,65": 842,
    "34,44,46,56,58,70": 843,
    "34,46": 844,
    "34,46,48,52,55,60,61": 845,
    "34,46,48,53,58,60,61,65,72,84": 846,
    "34,46,50,53,58,62": 847,
    "34,46,51,53,58,61,63,65,75,87": 848,
    "34,46,51,58,61,65,67,77": 849,
    "34,46,53": 850,
    "34,46,53,55,58,61,65": 851,
    "34,46,53,55,61,63": 852,
    "34,46,53,56,65,73,75": 853,
    "34,46,53,58,61,65": 854,
    "34,46,53,58,61,65,70,72,73,75,77": 855,
    "34,46,53,58,62,65": 856,
    "34,46,53,58,62,65,70,82,94": 857,
    "34,46,53,58,65": 858,
    "34,46,53,61,65,77,85,89": 859,
    "34,46,55,58,61,64": 860,
    "34,46,55,63,67": 861,
    "34,46,56,61,66,70": 862,
    "34,46,57,60,63,65,66,72,75,77,78": 863,
    "34,46,58": 864,
    "34,46,58,62": 865,
    "34,46,58,67,70": 866,
    "34,46,58,70": 867,
    "34,46,59,63,68,71": 868,
    "34,46,61,63": 869,
    "34,46,61,65,70": 870,
    "34,46,61,65,70,73": 871,
    "34,46,61,73": 872,
    "34,46,62": 873,
    "34,46,62,67,70,74": 874,
    "34,46,62,67,74": 875,
    "34,46,65,68,73,77": 876,
    "34,46,65,72,75,77": 877,
    "34,46,66": 878,
    "34,46,67": 879,
    "34,46,67,70,74": 880,
    "34,46,67,73,79": 881,
    "34,46,67,75,79": 882,
    "34,46,70": 883,
    "34,46,70,74,77,82": 884,
    "34,46,70,78,82": 885,
    "34,46,70,79,82": 886,
    "34,46,70,79,85,91": 887,
    "34,46,70,82": 888,
    "34,46,72,73": 889,
    "34,46,73": 890,
    "34,46,73,75": 891,
    "34,46,73,85": 892,
    "34,46,75": 893,
    "34,46,75,78": 894,
    "34,46,77,78": 895,
    "34,46,77,78,85,87,89,90": 896,
    "34,46,78,87,90": 897,
    "34,46,78,90": 898,
    "34,46,79,80,85,91,92": 899,
    "34,46,82,94": 900,
    "34,46,88,100": 901,
    "34,46,92,98": 902,
    "34,47,67,74,79": 903,
    "34,52,62,70,77": 904,
    "34,53,58,59": 905,
    "34,53,58,62,65": 906,
    "34,53,58,62,65,70,77": 907,
    "34,53,58,62,65,70,82": 908,
    "34,53,58,65": 909,
    "34,56,62": 910,
    "34,60,65": 911,
    "34,60,67,68": 912,
    "34,61,73,75": 913,
    "34,61,75,77": 914,
    "34,61,77,78": 915,
    "34,62,70,77": 916,
    "34,67": 917,
    "34,72,73,75": 918,
    "34,73": 919,
    "34,75": 920,
    "34,77": 921,
    "34,78": 922,
    "34,82": 923,
    "35": 924,
    "35,36": 925,
    "35,36,47,48": 926,
    "35,36,47,48,54,56,57,63,66,68": 927,
    "35,36,47,48,55,60,62,63,65": 928,
    "35,36,47,48,56,62,63,66,68,70": 929,
    "35,37,47,49": 930,
    "35,37,47,49,55,56,59": 931,
    "35,37,47,49,56,59": 932,
    "35,37,47,49,56,59,64": 933,
    "35,37,47,49,56,59,68": 934,
    "35,37,47,49,57,59,66": 935,
    "35,37,47,49,57,63": 936,
    "35,37,47,49,59,64,68": 937,
    "35,37,47,49,59,64,68,71,76": 938,
    "35,37,47,49,59,68,71": 939,
    "35,37,47,49,59,69,71": 940,
    "35,37,47,49,61,63,68,73,75": 941,
    "35,37,47,49,68,71,80": 942,
    "35,37,51,54,59,63": 943,
    "35,37,69,80": 944,
    "35,40": 945,
    "35,40,47,51,52,54,56,59": 946,
    "35,40,47,52": 947,
    "35,40,47,52,56,57,59": 948,
    "35,40,47,52,56,57,59,66,68": 949,
    "35,40,47,52,56,57,63,64": 950,
    "35,40,47,52,56,59,64,68": 951,
    "35,40,47,52,56,59,68,71": 952,
    "35,40,47,52,57,59,64,66,68": 953,
    "35,40,47,52,57,59,66,68": 954,
    "35,40,47,52,59,61,68,71,73": 955,
    "35,40,47,52,59,66,68,69,71,80": 956,
    "35,40,47,52,59,66,69,71": 957,
    "35,40,47,52,59,68,71": 958,
    "35,40,47,64,68": 959,
    "35,40,51,52,54,56,59": 960,
    "35,40,66,68,76,78": 961,
    "35,41": 962,
    "35,41,47,53,55,56,60,62,67,68": 963,
    "35,42,47,51,54,59,63": 964,
    "35,42,47,51,57,59,63": 965,
    "35,42,47,54,78": 966,
    "35,42,47,62,70,71,73": 967,
    "35,42,47,63,70,71,73": 968,
    "35,42,54,59,66": 969,
    "35,42,54,61,66": 970,
    "35,42,59,66,71": 971,
    "35,42,61,66,73": 972,
    "35,42,63,66,75": 973,
    "35,43,55": 974,
    "35,46,47,58": 975,
    "35,47": 976,
    "35,47,48,54,56,62,66,68,74,78,80": 977,
    "35,47,50,54,59": 978,
    "35,47,51": 979,
    "35,47,51,54,59": 980,
    "35,47,51,54,59,63": 981,
    "35,47,52,54,59,64": 982,
    "35,47,52,61,78,80,85,90,92": 983,
    "35,47,54": 984,
    "35,47,54,59,62,66,67,71": 985,
    "35,47,54,59,63": 986,
    "35,47,54,59,78,85,90": 987,
    "35,47,54,63,66": 988,
    "35,47,55,59,64,79,81,83": 989,
    "35,47,55,62,65,67": 990,
    "35,47,55,62,67": 991,
    "35,47,56,58,59,63,68,70": 992,
    "35,47,56,59": 993,
    "35,47,56,62,66,68": 994,
    "35,47,56,62,66,70": 995,
    "35,47,56,63,68": 996,
    "35,47,56,64,68": 997,
    "35,47,57,59,63,65,66,71,77,78": 998,
    "35,47,57,59,63,66,68,71,78,80": 999,
    "35,47,57,59,66": 1000,
    "35,47,57,63": 1001,
    "35,47,57,69": 1002,
    "35,47,58,70": 1003,
    "35,47,59,63": 1004,
    "35,47,59,63,68,71": 1005,
    "35,47,59,69,71": 1006,
    "35,47,59,71": 1007,
    "35,47,62,66,71": 1008,
    "35,47,62,66,74": 1009,
    "35,47,62,68,73": 1010,
    "35,47,63,66": 1011,
    "35,47,63,68,71,75": 1012,
    "35,47,63,68,75": 1013,
    "35,47,64,68,76": 1014,
    "35,47,65,66,71,77,78": 1015,
    "35,47,65,67,74,77": 1016,
    "35,47,65,67,75": 1017,
    "35,47,65,77": 1018,
    "35,47,66,71,78": 1019,
    "35,47,67,74,79": 1020,
    "35,47,68,76,80": 1021,
    "35,47,68,77,80": 1022,
    "35,47,69,71,75,78": 1023,
    "35,47,69,71,80": 1024,
    "35,47,69,74": 1025,
    "35,47,69,78,81": 1026,
    "35,47,71,74": 1027,
    "35,47,71,75": 1028,
    "35,47,71,78": 1029,
    "35,47,74,81,86": 1030,
    "35,47,75": 1031,
    "35,47,75,76": 1032,
    "35,47,78": 1033,
    "35,47,78,83": 1034,
    "35,47,78,85,90": 1035,
    "35,47,79,83": 1036,
    "35,47,80,92": 1037,
    "35,47,83": 1038,
    "35,47,83,87": 1039,
    "35,47,86,89": 1040,
    "35,47,87,99": 1041,
    "35,47,92": 1042,
    "35,51,54,59": 1043,
    "35,51,54,59,63": 1044,
    "35,51,63,66,68,73": 1045,
    "35,52,54,59,64": 1046,
    "35,52,61,66,68,71": 1047,
    "35,54,59,64": 1048,
    "35,54,63,75": 1049,
    "35,56,62,64": 1050,
    "35,57,69": 1051,
    "35,59,66": 1052,
    "35,61,66": 1053,
    "35,62,66,69": 1054,
    "35,62,66,71": 1055,
    "35,62,66,74": 1056,
    "35,63,66,71": 1057,
    "35,66,71": 1058,
    "35,66,71,78": 1059,
    "35,66,73": 1060,
    "35,66,75": 1061,
    "35,66,78": 1062,
    "35,68": 1063,
    "35,68,71": 1064,
    "35,69,80": 1065,
    "35,70,73": 1066,
    "35,71,80": 1067,
    "36": 1068,
    "36,37,39,48,49,51": 1069,
    "36,37,48,49": 1070,
    "36,37,48,49,54,57,58,61,63,65,66": 1071,
    "36,37,48,49,57,65,69": 1072,
    "36,37,48,49,64,65,68,70,72": 1073,
    "36,38": 1074,
    "36,38,48,50": 1075,
    "36,38,48,50,60,67,69,72": 1076,
    "36,38,48,50,67,70,75,79": 1077,
    "36,38,48,50,70,79,82": 1078,
    "36,39,48,51": 1079,
    "36,41,48,53": 1080,
    "36,41,48,53,57": 1081,
    "36,41,48,56": 1082,
    "36,41,50,56": 1083,
    "36,41,51,56": 1084,
    "36,41,53,56": 1085,
    "36,41,53,57": 1086,
    "36,41,53,57,60": 1087,
    "36,41,53,60": 1088,
    "36,41,55,57,60,64": 1089,
    "36,41,60,65,68,71,74": 1090,
    "36,41,60,65,68,72": 1091,
    "36,41,60,67,68,72": 1092,
    "36,41,65,68,72": 1093,
    "36,41,65,68,74": 1094,
    "36,41,80,84,89,92": 1095,
    "36,42,69,72,75,81": 1096,
    "36,42,69,75,81": 1097,
    "36,43": 1098,
    "36,43,48": 1099,
    "36,43,48,51": 1100,
    "36,43,48,51,55,60,63": 1101,
    "36,43,48,52": 1102,
    "36,43,48,52,55": 1103,
    "36,43,48,52,55,60": 1104,
    "36,43,48,52,55,60,64": 1105,
    "36,43,48,55,60": 1106,
    "36,43,48,60,64,70,72": 1107,
    "36,43,48,75,87": 1108,
    "36,43,50,55": 1109,
    "36,43,50,55,60": 1110,
    "36,43,50,55,62": 1111,
    "36,43,51,55": 1112,
    "36,43,52,55": 1113,
    "36,43,52,55,64": 1114,
    "36,43,52,59": 1115,
    "36,43,55": 1116,
    "36,43,55,60": 1117,
    "36,43,55,60,62": 1118,
    "36,43,55,60,63": 1119,
    "36,43,55,62": 1120,
    "36,43,55,67": 1121,
    "36,43,60,72": 1122,
    "36,43,64,67,71": 1123,
    "36,43,64,67,72": 1124,
    "36,43,64,67,72,76": 1125,
    "36,43,67,68,72,75,79,80": 1126,
    "36,43,67,69,72,75,79,81": 1127,
    "36,43,67,71,72,75,79,83": 1128,
    "36,43,67,72,75,79": 1129,
    "36,43,68,72,75,80": 1130,
    "36,43,69,75,77,81": 1131,
    "36,43,75,87": 1132,
    "36,44,45,56,63,66,68": 1133,
    "36,44,48,53": 1134,
    "36,44,48,53,60": 1135,
    "36,44,51,60": 1136,
    "36,44,53,60": 1137,
    "36,45,57,65,69": 1138,
    "36,46,48,58": 1139,
    "36,48": 1140,
    "36,48,50": 1141,
    "36,48,51,56,65": 1142,
    "36,48,52,55,60": 1143,
    "36,48,52,55,60,64": 1144,
    "36,48,52,58,60,65,67,68": 1145,
    "36,48,52,58,60,65,68": 1146,
    "36,48,53,55,60,61": 1147,
    "36,48,53,56,63,66,68": 1148,
    "36,48,53,58,65,67": 1149,
    "36,48,53,58,65,67,68": 1150,
    "36,48,53,58,65,67,77": 1151,
    "36,48,54,57": 1152,
    "36,48,54,57,63,66": 1153,
    "36,48,55": 1154,
    "36,48,55,60": 1155,
    "36,48,55,60,63": 1156,
    "36,48,55,60,63,67": 1157,
    "36,48,55,60,64,72": 1158,
    "36,48,56,63,66,68": 1159,
    "36,48,57,60": 1160,
    "36,48,57,60,69": 1161,
    "36,48,57,65,69": 1162,
    "36,48,57,69": 1163,
    "36,48,58,60,64,65,77,79,80": 1164,
    "36,48,58,60,70": 1165,
    "36,48,58,66,70": 1166,
    "36,48,58,67,70,75,79": 1167,
    "36,48,58,70": 1168,
    "36,48,60": 1169,
    "36,48,60,63,67,68,75": 1170,
    "36,48,60,64": 1171,
    "36,48,60,67": 1172,
    "36,48,60,72": 1173,
    "36,48,62,64": 1174,
    "36,48,63,66,69,75": 1175,
    "36,48,63,67,69": 1176,
    "36,48,63,67,72,75": 1177,
    "36,48,63,67,75": 1178,
    "36,48,63,75": 1179,
    "36,48,64,66": 1180,
    "36,48,64,68,72": 1181,
    "36,48,66": 1182,
    "36,48,66,69,74,78": 1183,
    "36,48,67,68": 1184,
    "36,48,67,72": 1185,
    "36,48,67,72,75,79": 1186,
    "36,48,67,79": 1187,
    "36,48,67,79,80": 1188,
    "36,48,69": 1189,
    "36,48,70,76,82": 1190,
    "36,48,72,76": 1191,
    "36,48,72,79": 1192,
    "36,48,74,76": 1193,
    "36,48,77": 1194,
    "36,48,78,80": 1195,
    "36,48,79,84": 1196,
    "36,48,84,88": 1197,
    "36,48,84,91": 1198,
    "36,48,86,88": 1199,
    "36,48,86,98": 1200,
    "36,48,91,96": 1201,
    "36,48,96,100": 1202,
    "36,49,55,58,64,65": 1203,
    "36,49,55,58,65": 1204,
    "36,49,60,64,65": 1205,
    "36,51,55,60": 1206,
    "36,51,55,60,62": 1207,
    "36,52,55,58,64": 1208,
    "36,53,55,60": 1209,
    "36,54,64,66,67": 1210,
    "36,55": 1211,
    "36,55,60": 1212,
    "36,55,60,64": 1213,
    "36,56,68": 1214,
    "36,57,69": 1215,
    "36,60": 1216,
    "36,60,64": 1217,
    "36,60,67": 1218,
    "36,60,69": 1219,
    "36,61,69,70": 1220,
    "36,62,74": 1221,
    "36,63,77,78": 1222,
    "36,64,67,72": 1223,
    "36,64,72": 1224,
    "36,67,72": 1225,
    "36,69": 1226,
    "36,72": 1227,
    "36,72,76": 1228,
    "36,72,79": 1229,
    "36,77": 1230,
    "36,78,80": 1231,
    "36,79,84": 1232,
    "36,82": 1233,
    "36,82,84": 1234,
    "36,84,88": 1235,
    "36,84,91": 1236,
    "36,91,96": 1237,
    "36,96,100": 1238,
    "37": 1239,
    "37,38,49,50": 1240,
    "37,38,49,50,56,57,58,65,68,69,70": 1241,
    "37,38,49,50,57,59,65,69,71": 1242,
    "37,38,49,50,59,65,68,70": 1243,
    "37,38,49,50,61,62,73,74": 1244,
    "37,39,41,49,51,53": 1245,
    "37,39,44,56": 1246,
    "37,39,44,56,68": 1247,
    "37,39,49,51": 1248,
    "37,39,49,51,55,56,59": 1249,
    "37,39,49,51,56,59": 1250,
    "37,39,49,51,56,59,68": 1251,
    "37,39,49,51,56,64,68": 1252,
    "37,39,49,51,57,59,66": 1253,
    "37,39,49,51,57,61": 1254,
    "37,39,49,51,58,70": 1255,
    "37,39,49,51,58,70,82,94": 1256,
    "37,39,49,51,59,61,68,71,73": 1257,
    "37,39,49,51,59,64,68": 1258,
    "37,39,49,51,59,66,69,71": 1259,
    "37,39,49,51,59,68,71": 1260,
    "37,39,49,51,63,64,68,75,76": 1261,
    "37,39,49,51,63,68,72,75": 1262,
    "37,39,51,52,56": 1263,
    "37,39,64,65,66": 1264,
    "37,39,64,66": 1265,
    "37,39,68,76": 1266,
    "37,40,44,49,52,61,68,73": 1267,
    "37,40,49,52,64,66": 1268,
    "37,41,44,49,56": 1269,
    "37,41,49,53": 1270,
    "37,41,49,53,56,65,68": 1271,
    "37,41,49,53,58,70": 1272,
    "37,41,49,53,61,65,73,77": 1273,
    "37,41,49,53,70,82,94": 1274,
    "37,41,49,58": 1275,
    "37,42,49,54,58": 1276,
    "37,42,49,54,58,61": 1277,
    "37,42,49,54,60,61": 1278,
    "37,42,49,54,60,61,63,65": 1279,
    "37,42,49,54,61": 1280,
    "37,42,49,54,61,65": 1281,
    "37,42,49,57,61,66,73,78": 1282,
    "37,42,49,58,61": 1283,
    "37,42,49,58,61,65,66": 1284,
    "37,42,49,58,61,66": 1285,
    "37,42,49,58,66,70": 1286,
    "37,42,49,60,61,66,72,73": 1287,
    "37,42,49,61,66,73": 1288,
    "37,42,49,61,70,73": 1289,
    "37,42,49,65,66,73,77,78": 1290,
    "37,42,49,66,73,78": 1291,
    "37,43,49,99,101": 1292,
    "37,44": 1293,
    "37,44,45,56,57,65,68,69": 1294,
    "37,44,45,56,61,64,68": 1295,
    "37,44,45,56,61,68": 1296,
    "37,44,49,53,56,61,65": 1297,
    "37,44,49,56": 1298,
    "37,44,49,56,65,67,77,79": 1299,
    "37,44,49,61,68,73": 1300,
    "37,44,51,52,56": 1301,
    "37,44,51,53,54,59,61,63": 1302,
    "37,44,51,56,68": 1303,
    "37,44,52,59,61,63": 1304,
    "37,44,52,61,63,68": 1305,
    "37,44,53,54,60,61,63,68": 1306,
    "37,44,53,56": 1307,
    "37,44,53,56,61": 1308,
    "37,44,53,61": 1309,
    "37,44,53,68": 1310,
    "37,44,53,68,73": 1311,
    "37,44,54,56": 1312,
    "37,44,54,56,60": 1313,
    "37,44,54,56,60,63": 1314,
    "37,44,54,61,73": 1315,
    "37,44,56": 1316,
    "37,44,56,58,61,64,68": 1317,
    "37,44,56,58,61,68": 1318,
    "37,44,56,60,61,65,66,68": 1319,
    "37,44,56,61,64,68": 1320,
    "37,44,56,61,64,70": 1321,
    "37,44,56,63": 1322,
    "37,44,56,65,68": 1323,
    "37,44,56,68": 1324,
    "37,44,60,61,65,66,68": 1325,
    "37,44,61": 1326,
    "37,44,61,63": 1327,
    "37,44,61,64": 1328,
    "37,44,61,65,73": 1329,
    "37,44,61,66": 1330,
    "37,44,61,68": 1331,
    "37,44,63,64": 1332,
    "37,44,63,64,66,68": 1333,
    "37,44,63,65,66,68": 1334,
    "37,44,63,69": 1335,
    "37,44,64,66": 1336,
    "37,44,64,68,73,76": 1337,
    "37,44,64,68,75,76": 1338,
    "37,44,64,69": 1339,
    "37,44,65,68": 1340,
    "37,44,65,68,73,77": 1341,
    "37,44,65,73,80": 1342,
    "37,44,68": 1343,
    "37,44,68,76": 1344,
    "37,44,71,73,77": 1345,
    "37,44,71,77": 1346,
    "37,44,72,73": 1347,
    "37,44,73": 1348,
    "37,44,73,77": 1349,
    "37,44,75": 1350,
    "37,44,76": 1351,
    "37,44,76,77": 1352,
    "37,44,77": 1353,
    "37,44,77,78": 1354,
    "37,44,78,80": 1355,
    "37,44,80": 1356,
    "37,45": 1357,
    "37,45,53,69": 1358,
    "37,45,57,65,69": 1359,
    "37,45,60": 1360,
    "37,45,61": 1361,
    "37,45,64,72": 1362,
    "37,45,66,72": 1363,
    "37,45,66,73": 1364,
    "37,45,66,76": 1365,
    "37,45,66,78": 1366,
    "37,45,69,78": 1367,
    "37,45,71,78": 1368,
    "37,45,72": 1369,
    "37,45,73,74": 1370,
    "37,45,76": 1371,
    "37,45,77,78": 1372,
    "37,45,78": 1373,
    "37,46,49,55": 1374,
    "37,46,49,58": 1375,
    "37,46,53,62,64,65": 1376,
    "37,46,53,62,65": 1377,
    "37,48,51,59,65,68,77": 1378,
    "37,48,60,70,71": 1379,
    "37,49": 1380,
    "37,49,101": 1381,
    "37,49,50": 1382,
    "37,49,53,56,60,65,72,84": 1383,
    "37,49,53,56,61,65,68": 1384,
    "37,49,53,58": 1385,
    "37,49,53,58,61,65,70,72,77,82,84": 1386,
    "37,49,53,58,61,67,69,73,77,79,81": 1387,
    "37,49,53,58,65": 1388,
    "37,49,53,58,65,77": 1389,
    "37,49,53,59,69,71": 1390,
    "37,49,53,61,68": 1391,
    "37,49,54,58,61,66,73": 1392,
    "37,49,54,58,66,78": 1393,
    "37,49,54,59,63,66,73": 1394,
    "37,49,56,58,61,65,66": 1395,
    "37,49,56,59": 1396,
    "37,49,56,59,61,65,68,70": 1397,
    "37,49,56,61,64,70": 1398,
    "37,49,56,61,65": 1399,
    "37,49,56,61,66,68": 1400,
    "37,49,56,64,68": 1401,
    "37,49,56,65,68": 1402,
    "37,49,57,59,66": 1403,
    "37,49,57,64,69": 1404,
    "37,49,57,65,69": 1405,
    "37,49,57,69": 1406,
    "37,49,58": 1407,
    "37,49,58,61,65": 1408,
    "37,49,58,61,66,73": 1409,
    "37,49,58,64,70": 1410,
    "37,49,58,65,70": 1411,
    "37,49,58,66,70": 1412,
    "37,49,58,70": 1413,
    "37,49,59,61,65,67,68,73,79,80": 1414,
    "37,49,59,61,65,68,70,73,80,82": 1415,
    "37,49,59,65,68,70": 1416,
    "37,49,59,66,69,71": 1417,
    "37,49,59,68,71": 1418,
    "37,49,61": 1419,
    "37,49,61,64,68": 1420,
    "37,49,61,64,71": 1421,
    "37,49,61,66,68,69": 1422,
    "37,49,61,66,69,71": 1423,
    "37,49,61,66,70": 1424,
    "37,49,61,68,73,77": 1425,
    "37,49,61,73": 1426,
    "37,49,64,68,73": 1427,
    "37,49,64,68,76": 1428,
    "37,49,64,70,75": 1429,
    "37,49,64,73": 1430,
    "37,49,65": 1431,
    "37,49,65,70": 1432,
    "37,49,65,70,73,77": 1433,
    "37,49,65,77": 1434,
    "37,49,67,68,73,79,80": 1435,
    "37,49,68,73,80": 1436,
    "37,49,68,80": 1437,
    "37,49,69,70,73,77,81,82": 1438,
    "37,49,69,73,77,81": 1439,
    "37,49,69,81": 1440,
    "37,49,70": 1441,
    "37,49,70,77": 1442,
    "37,49,77": 1443,
    "37,49,77,78": 1444,
    "37,49,78,82": 1445,
    "37,49,82,94": 1446,
    "37,49,85,89": 1447,
    "37,49,85,97": 1448,
    "37,51,56,59,75,78": 1449,
    "37,51,73,75,77,78,85,87": 1450,
    "37,52,56": 1451,
    "37,52,56,59,63": 1452,
    "37,52,56,59,64": 1453,
    "37,52,56,73,76,80": 1454,
    "37,52,61": 1455,
    "37,52,61,68": 1456,
    "37,52,64,73": 1457,
    "37,53,55,61,64,68,70": 1458,
    "37,53,56,59,61,65,68": 1459,
    "37,53,59,61": 1460,
    "37,53,59,61,65,68": 1461,
    "37,53,61,68": 1462,
    "37,53,69": 1463,
    "37,53,70,77": 1464,
    "37,54,59,62,71,73": 1465,
    "37,54,61,65,66,68,70": 1466,
    "37,54,68,76": 1467,
    "37,55,65,73,80": 1468,
    "37,56": 1469,
    "37,56,61": 1470,
    "37,56,61,64,73,76": 1471,
    "37,56,61,65": 1472,
    "37,56,61,65,68": 1473,
    "37,56,61,65,73": 1474,
    "37,56,64,73": 1475,
    "37,56,65,68": 1476,
    "37,56,66,68,78,82": 1477,
    "37,56,68": 1478,
    "37,56,73": 1479,
    "37,57,61,73": 1480,
    "37,57,69": 1481,
    "37,57,69,81": 1482,
    "37,58,60": 1483,
    "37,58,60,61": 1484,
    "37,59,61,77": 1485,
    "37,59,65,68": 1486,
    "37,60": 1487,
    "37,60,61": 1488,
    "37,60,66,68,77": 1489,
    "37,60,72,73,80": 1490,
    "37,60,73,75": 1491,
    "37,61": 1492,
    "37,61,62,72": 1493,
    "37,61,63": 1494,
    "37,61,65": 1495,
    "37,61,65,68": 1496,
    "37,61,65,73": 1497,
    "37,61,66,73": 1498,
    "37,61,77,78": 1499,
    "37,61,77,80": 1500,
    "37,61,80,85": 1501,
    "37,62,64,72": 1502,
    "37,62,72": 1503,
    "37,63,64": 1504,
    "37,63,66": 1505,
    "37,63,66,70,73": 1506,
    "37,63,77": 1507,
    "37,64,65": 1508,
    "37,64,65,66": 1509,
    "37,64,66": 1510,
    "37,64,68": 1511,
    "37,64,73": 1512,
    "37,65,67,68,70": 1513,
    "37,65,68": 1514,
    "37,65,68,70": 1515,
    "37,65,68,70,73": 1516,
    "37,65,68,72,75": 1517,
    "37,65,73,80": 1518,
    "37,65,77": 1519,
    "37,65,77,78": 1520,
    "37,66,68,73": 1521,
    "37,66,68,78": 1522,
    "37,66,70": 1523,
    "37,66,70,72,75": 1524,
    "37,66,70,73,77": 1525,
    "37,66,72": 1526,
    "37,66,73": 1527,
    "37,66,73,74": 1528,
    "37,66,73,78": 1529,
    "37,66,74,76": 1530,
    "37,66,78": 1531,
    "37,68": 1532,
    "37,68,69": 1533,
    "37,68,69,78": 1534,
    "37,68,70": 1535,
    "37,68,71,76,77": 1536,
    "37,68,73": 1537,
    "37,68,76": 1538,
    "37,68,80": 1539,
    "37,71": 1540,
    "37,71,73": 1541,
    "37,71,77": 1542,
    "37,71,77,78": 1543,
    "37,71,78": 1544,
    "37,72": 1545,
    "37,73": 1546,
    "37,73,75": 1547,
    "37,73,77,85": 1548,
    "37,73,80": 1549,
    "37,74": 1550,
    "37,74,76": 1551,
    "37,75": 1552,
    "37,75,76": 1553,
    "37,76": 1554,
    "37,76,78": 1555,
    "37,77": 1556,
    "37,78": 1557,
    "37,78,80": 1558,
    "37,78,82": 1559,
    "37,80": 1560,
    "37,85,89": 1561,
    "37,85,89,92": 1562,
    "37,92,101": 1563,
    "38": 1564,
    "38,39": 1565,
    "38,39,50,51": 1566,
    "38,39,50,51,54,58,59,63,65,66,68": 1567,
    "38,39,50,51,56,58,65,68,70": 1568,
    "38,39,50,51,59,65,69,71": 1569,
    "38,39,50,51,67,68,70,71,75,76,79,80": 1570,
    "38,39,50,51,67,69,72": 1571,
    "38,39,50,51,67,70,75,79": 1572,
    "38,39,50,51,67,72,75,79": 1573,
    "38,39,50,51,67,75,79,87": 1574,
    "38,39,50,51,70,79,82": 1575,
    "38,39,51,52": 1576,
    "38,40,45,52,54,56,61,62,64": 1577,
    "38,40,62,65,68,71": 1578,
    "38,40,62,67,71": 1579,
    "38,41": 1580,
    "38,41,43": 1581,
    "38,41,50,53": 1582,
    "38,42,50,54": 1583,
    "38,43,46,55,62": 1584,
    "38,43,47,52,62": 1585,
    "38,43,47,55": 1586,
    "38,43,47,55,62": 1587,
    "38,43,52,55,62": 1588,
    "38,43,52,58": 1589,
    "38,43,52,62": 1590,
    "38,43,53,59": 1591,
    "38,43,55,62": 1592,
    "38,43,62,67,71": 1593,
    "38,44,45,54,62": 1594,
    "38,44,45,55,62": 1595,
    "38,44,53,60": 1596,
    "38,44,53,71,74,76,77,79": 1597,
    "38,44,53,89,101": 1598,
    "38,44,59,65,71": 1599,
    "38,44,79,83,86,88,89,91": 1600,
    "38,44,89,101": 1601,
    "38,45": 1602,
    "38,45,46,54,55,62": 1603,
    "38,45,48,57,62": 1604,
    "38,45,50": 1605,
    "38,45,50,53": 1606,
    "38,45,50,54,60,62": 1607,
    "38,45,50,54,60,62,66": 1608,
    "38,45,50,54,62": 1609,
    "38,45,50,57": 1610,
    "38,45,50,62": 1611,
    "38,45,52,57,61,73,74": 1612,
    "38,45,53": 1613,
    "38,45,53,57,65,69": 1614,
    "38,45,53,62": 1615,
    "38,45,53,62,74": 1616,
    "38,45,53,69": 1617,
    "38,45,53,72": 1618,
    "38,45,53,76": 1619,
    "38,45,54,57,62": 1620,
    "38,45,54,59,61,66": 1621,
    "38,45,54,59,66": 1622,
    "38,45,54,61,62,66": 1623,
    "38,45,54,61,64,66": 1624,
    "38,45,54,61,66": 1625,
    "38,45,54,61,66,69": 1626,
    "38,45,54,61,68": 1627,
    "38,45,54,61,69": 1628,
    "38,45,54,61,71": 1629,
    "38,45,54,62": 1630,
    "38,45,54,62,64,66": 1631,
    "38,45,54,62,66": 1632,
    "38,45,54,64,66": 1633,
    "38,45,54,66": 1634,
    "38,45,54,69": 1635,
    "38,45,57": 1636,
    "38,45,57,62": 1637,
    "38,45,57,62,65": 1638,
    "38,45,57,62,69": 1639,
    "38,45,57,65,69": 1640,
    "38,45,57,69": 1641,
    "38,45,57,72": 1642,
    "38,45,57,76": 1643,
    "38,45,59,61,66": 1644,
    "38,45,59,66": 1645,
    "38,45,61,62,66": 1646,
    "38,45,61,64,66": 1647,
    "38,45,61,66": 1648,
    "38,45,62": 1649,
    "38,45,62,64,66": 1650,
    "38,45,62,66": 1651,
    "38,45,62,74": 1652,
    "38,45,64,66": 1653,
    "38,45,67,74": 1654,
    "38,45,69": 1655,
    "38,45,70,74": 1656,
    "38,45,72": 1657,
    "38,45,76": 1658,
    "38,46,47,55,62": 1659,
    "38,46,50,58": 1660,
    "38,46,55,57,62": 1661,
    "38,46,55,62": 1662,
    "38,47,48,56,57,62": 1663,
    "38,47,50,55": 1664,
    "38,47,50,59": 1665,
    "38,47,52,56,62": 1666,
    "38,47,52,62": 1667,
    "38,47,56,62": 1668,
    "38,47,62": 1669,
    "38,48,50,60,68,74,77": 1670,
    "38,48,57,59,62": 1671,
    "38,50": 1672,
    "38,50,51,63": 1673,
    "38,50,52,53,55,56,59": 1674,
    "38,50,55,58,62": 1675,
    "38,50,55,58,64": 1676,
    "38,50,56,58,65,68,70": 1677,
    "38,50,57": 1678,
    "38,50,57,60": 1679,
    "38,50,58": 1680,
    "38,50,58,62,67": 1681,
    "38,50,58,65,70": 1682,
    "38,50,59,65,68": 1683,
    "38,50,59,65,69,71": 1684,
    "38,50,59,68": 1685,
    "38,50,60,63,67,72": 1686,
    "38,50,60,66": 1687,
    "38,50,60,66,68": 1688,
    "38,50,60,66,68,69": 1689,
    "38,50,60,66,69": 1690,
    "38,50,60,66,69,70": 1691,
    "38,50,60,66,70": 1692,
    "38,50,60,66,72": 1693,
    "38,50,62,66,69": 1694,
    "38,50,62,66,71": 1695,
    "38,50,62,67,74": 1696,
    "38,50,62,74": 1697,
    "38,50,65,66,71,74": 1698,
    "38,50,65,71": 1699,
    "38,50,66,70": 1700,
    "38,50,71,83": 1701,
    "38,50,77": 1702,
    "38,50,77,78": 1703,
    "38,50,78,82": 1704,
    "38,50,84,96": 1705,
    "38,52,57,61,67,69,71": 1706,
    "38,54,57,62": 1707,
    "38,54,57,62,66": 1708,
    "38,55,57,61,64": 1709,
    "38,56,59,62,64,65,67,71": 1710,
    "38,56,89,101": 1711,
    "38,56,91,95,98,100,101": 1712,
    "38,57": 1713,
    "38,57,59,65,71": 1714,
    "38,57,60": 1715,
    "38,57,62,65,74,77": 1716,
    "38,57,62,66": 1717,
    "38,57,62,74": 1718,
    "38,57,64,67,69,74": 1719,
    "38,57,65,69,77,81": 1720,
    "38,57,66,74": 1721,
    "38,57,89,101": 1722,
    "38,58,61": 1723,
    "38,58,61,64": 1724,
    "38,58,61,64,67": 1725,
    "38,58,61,67": 1726,
    "38,58,62": 1727,
    "38,58,62,67": 1728,
    "38,58,62,67,74": 1729,
    "38,60,62": 1730,
    "38,60,62,66": 1731,
    "38,60,62,66,70": 1732,
    "38,60,62,67,69": 1733,
    "38,60,62,69": 1734,
    "38,60,62,69,70": 1735,
    "38,60,62,70": 1736,
    "38,60,72": 1737,
    "38,62": 1738,
    "38,62,69": 1739,
    "38,64,69,76": 1740,
    "38,65,71": 1741,
    "38,66": 1742,
    "38,67,74": 1743,
    "38,69": 1744,
    "38,69,72": 1745,
    "38,69,74": 1746,
    "38,70": 1747,
    "38,70,74": 1748,
    "38,73": 1749,
    "38,74": 1750,
    "38,80,89": 1751,
    "38,81,84": 1752,
    "38,90": 1753,
    "39": 1754,
    "39,40,44,49,56": 1755,
    "39,40,44,49,56,61,68": 1756,
    "39,40,44,56": 1757,
    "39,40,44,56,68": 1758,
    "39,40,47,54,57,61": 1759,
    "39,40,48,49,56": 1760,
    "39,40,48,49,56,60,61,68": 1761,
    "39,40,49,51,56": 1762,
    "39,40,51,52": 1763,
    "39,40,51,52,56,59": 1764,
    "39,40,51,52,56,59,68": 1765,
    "39,40,51,52,56,64,68": 1766,
    "39,40,51,52,57,59": 1767,
    "39,40,51,52,57,59,66": 1768,
    "39,40,51,52,57,59,66,68": 1769,
    "39,40,51,52,59,64,68,76": 1770,
    "39,40,51,52,59,66,69,71": 1771,
    "39,40,51,52,59,68,71": 1772,
    "39,40,51,52,60,68,72": 1773,
    "39,40,51,52,61,63,68,73,75": 1774,
    "39,40,51,52,88,93": 1775,
    "39,40,51,55,58,63": 1776,
    "39,40,52,57": 1777,
    "39,40,92,100": 1778,
    "39,41": 1779,
    "39,41,43,51,53,55": 1780,
    "39,41,44,51": 1781,
    "39,41,51,53": 1782,
    "39,41,51,53,54,56,58,61,63,65,66": 1783,
    "39,41,51,53,56,60,67,68,72": 1784,
    "39,41,51,53,59,60,62,67,72": 1785,
    "39,41,51,53,63,68,72,75": 1786,
    "39,41,51,53,67,72,75,79": 1787,
    "39,41,63,72": 1788,
    "39,42,51,54": 1789,
    "39,42,51,54,58,70": 1790,
    "39,42,59,63,66,71": 1791,
    "39,43,46,51": 1792,
    "39,43,46,51,60": 1793,
    "39,43,48,56": 1794,
    "39,43,51,55,67,70,74,79": 1795,
    "39,43,51,58": 1796,
    "39,44,45,56,60,68": 1797,
    "39,44,48,56": 1798,
    "39,44,48,56,60,68": 1799,
    "39,44,51,52,56,59,64": 1800,
    "39,44,51,56": 1801,
    "39,44,51,56,58,59,61,63": 1802,
    "39,44,51,56,60,63,68": 1803,
    "39,44,51,58,60,63,70": 1804,
    "39,44,51,59": 1805,
    "39,44,51,60": 1806,
    "39,44,51,60,63,68,72": 1807,
    "39,44,51,63,68,72,73": 1808,
    "39,44,52,54": 1809,
    "39,44,52,54,59": 1810,
    "39,44,54,59": 1811,
    "39,44,56": 1812,
    "39,44,56,68": 1813,
    "39,44,63,72": 1814,
    "39,44,63,73": 1815,
    "39,44,72": 1816,
    "39,44,80": 1817,
    "39,45,51,53,57,60,65": 1818,
    "39,45,51,57": 1819,
