{
  "token_to_id": {
    "100": 1,
    "24,36,37,72,79,81": 2,
    "24,36,37,75,77,82": 3,
    "24,36,63,78": 4,
    "24,36,76,79": 5,
    "25,37,65,73": 6,
    "25,37,65,78": 7,
    "25,37,66,75": 8,
    "25,37,68,77": 9,
    "25,37,70,78": 10,
    "26,38,57,62,66,69": 11,
    "26,38,71,80": 12,
    "27,29,45,48": 13,
    "27,29,45,66": 14,
    "27,29,48,51": 15,
    "27,29,51,54": 16,
    "27,29,54": 17,
    "27,29,57,60": 18,
    "27,29,60,63": 19,
    "27,29,63,66": 20,
    "27,29,69,72": 21,
    "27,29,72,75,78": 22,
    "27,39,66,78": 23,
    "27,39,68,75": 24,
    "27,39,80,83": 25,
    "28,36,40,55,60,68": 26,
    "29": 27,
    "29,30": 28,
    "29,30,51,54,58,60": 29,
    "29,30,65,70": 30,
    "29,30,70,74,77,82": 31,
    "29,30,74,77,82,86": 32,
    "29,30,77,82": 33,
    "29,30,77,82,86,89": 34,
    "29,31,32,36,41,48,52,53,56,58,60": 35,
    "29,31,41,43,51,58,61,63": 36,
    "29,31,41,43,53,55,65,67": 37,
    "29,31,53,63": 38,
    "29,31,57,60": 39,
    "29,32,36,40,41,65,68,76,77": 40,
    "29,32,36,41,44,48,53": 41,
    "29,32,36,41,48,53,56,60,72": 42,
    "29,32,36,41,48,55,56,58,60,67,68": 43,
    "29,32,36,41,53,56,60,65": 44,
    "29,32,36,41,56,60,65": 45,
    "29,32,36,41,56,60,65,68": 46,
    "29,32,36,41,56,60,68": 47,
    "29,32,36,41,60,65": 48,
    "29,32,36,41,60,65,68,77": 49,
    "29,32,36,41,65,68,72,77": 50,
    "29,32,36,41,72,77": 51,
    "29,32,36,41,77,80,84,89": 52,
    "29,32,50,56,59,62": 53,
    "29,32,53,56": 54,
    "29,32,68,72": 55,
    "29,32,84,89": 56,
    "29,33,34,70,74,77": 57,
    "29,33,36": 58,
    "29,33,36,41": 59,
    "29,33,36,41,45,57": 60,
    "29,33,36,41,53,65": 61,
    "29,33,36,41,57,69": 62,
    "29,33,36,41,60,65,69,72": 63,
    "29,33,36,41,69,72,77,81": 64,
    "29,33,36,41,77,81,84,89": 65,
    "29,34,36,42,45,51": 66,
    "29,34,36,50,51,57,58": 67,
    "29,34,36,50,51,60": 68,
    "29,34,36,50,58": 69,
    "29,34,36,51,60": 70,
    "29,34,36,51,66": 71,
    "29,34,36,53,60": 72,
    "29,34,36,53,68": 73,
    "29,34,36,54,59,60": 74,
    "29,34,36,54,60,61": 75,
    "29,34,36,54,61,63": 76,
    "29,34,36,56,71": 77,
    "29,34,36,57,63,65": 78,
    "29,34,36,67,68": 79,
    "29,34,36,68": 80,
    "29,34,36,68,70": 81,
    "29,34,41": 82,
    "29,34,41,46,65,70": 83,
    "29,34,41,46,65,73": 84,
    "29,34,41,46,70,73": 85,
    "29,34,41,50,53,58": 86,
    "29,34,41,50,53,58,62": 87,
    "29,34,42,74,77": 88,
    "29,34,53,58": 89,
    "29,36": 90,
    "29,36,41": 91,
    "29,36,41,44,48,53": 92,
    "29,36,41,45": 93,
    "29,36,41,48,52,53": 94,
    "29,36,41,49,56,61": 95,
    "29,36,41,53,55": 96,
    "29,36,41,55,56,58,60,64,65": 97,
    "29,36,41,56,60,67": 98,
    "29,36,48,53": 99,
    "29,36,48,55": 100,
    "29,36,48,56": 101,
    "29,36,53,63": 102,
    "29,36,53,64,65": 103,
    "29,36,65,67,69,70,76,77": 104,
    "29,37,44,61,73": 105,
    "29,37,56,61": 106,
    "29,37,56,63": 107,
    "29,37,56,65": 108,
    "29,38,43,47": 109,
    "29,40,41,69,75,81": 110,
    "29,41": 111,
    "29,41,48": 112,
    "29,41,48,51,57": 113,
    "29,41,48,53": 114,
    "29,41,48,57": 115,
    "29,41,49,56,61": 116,
    "29,41,51,63": 117,
    "29,41,52,53": 118,
    "29,41,52,53,57,58,60": 119,
    "29,41,52,54,58,60": 120,
    "29,41,52,58,60": 121,
    "29,41,53": 122,
    "29,41,53,54,58,60": 123,
    "29,41,53,55": 124,
    "29,41,53,56": 125,
    "29,41,53,57,58,60,61": 126,
    "29,41,53,57,60": 127,
    "29,41,53,58,60": 128,
    "29,41,53,58,61,64,65": 129,
    "29,41,53,65": 130,
    "29,41,54,56,58,60,61": 131,
    "29,41,54,58,60": 132,
    "29,41,55": 133,
    "29,41,55,56": 134,
    "29,41,55,67": 135,
    "29,41,56,58,61": 136,
    "29,41,56,60": 137,
    "29,41,56,60,65": 138,
    "29,41,57": 139,
    "29,41,57,58,60,61,64,65": 140,
    "29,41,57,58,60,61,65,70": 141,
    "29,41,57,60": 142,
    "29,41,57,60,65": 143,
    "29,41,57,60,65,69": 144,
    "29,41,57,60,69": 145,
    "29,41,57,69": 146,
    "29,41,58,61": 147,
    "29,41,58,61,64": 148,
    "29,41,58,61,64,66": 149,
    "29,41,58,61,64,67": 150,
    "29,41,58,61,65": 151,
    "29,41,58,61,65,66": 152,
    "29,41,58,61,65,67": 153,
    "29,41,58,61,66": 154,
    "29,41,58,61,66,68": 155,
    "29,41,58,61,67": 156,
    "29,41,58,61,68": 157,
    "29,41,58,61,68,70": 158,
    "29,41,58,61,70": 159,
    "29,41,59,61,71": 160,
    "29,41,59,71": 161,
    "29,41,60": 162,
    "29,41,60,63,69": 163,
    "29,41,61,68,71": 164,
    "29,41,62,68,71,74": 165,
    "29,41,63": 166,
    "29,41,65": 167,
    "29,41,65,70": 168,
    "29,41,65,77": 169,
    "29,41,68,71,74": 170,
    "29,41,68,73,80": 171,
    "29,41,69,72": 172,
    "29,41,69,72,73,77": 173,
    "29,41,69,72,75,81": 174,
    "29,41,69,72,81": 175,
    "29,41,69,81": 176,
    "29,41,70": 177,
    "29,41,70,73": 178,
    "29,41,70,74": 179,
    "29,41,72,81": 180,
    "29,41,73,85": 181,
    "29,41,74,77": 182,
    "29,41,77,80": 183,
    "29,41,77,86": 184,
    "29,41,77,89": 185,
    "29,41,79": 186,
    "29,41,81,82": 187,
    "29,41,81,84,89,93": 188,
    "29,41,84,86": 189,
    "29,41,87,93,96,99": 190,
    "29,41,89": 191,
    "29,41,89,91": 192,
    "29,44,77,86": 193,
    "29,45": 194,
    "29,48": 195,
    "29,48,53": 196,
    "29,48,53,57": 197,
    "29,51,53,57,58": 198,
    "29,51,60,62": 199,
    "29,53": 200,
    "29,53,56": 201,
    "29,53,57": 202,
    "29,53,58": 203,
    "29,53,63": 204,
    "29,54,57": 205,
    "29,54,63": 206,
    "29,56,60": 207,
    "29,57": 208,
    "29,57,60": 209,
    "29,58,67,68": 210,
    "29,60,63": 211,
    "29,60,63,65": 212,
    "29,60,63,69": 213,
    "29,60,63,72": 214,
    "29,63,66": 215,
    "29,65": 216,
    "29,65,69,77": 217,
    "29,65,72": 218,
    "29,65,77": 219,
    "29,65,81": 220,
    "29,65,84": 221,
    "29,65,89": 222,
    "29,68,72": 223,
    "29,73,80,83,85": 224,
    "29,73,85": 225,
    "29,80,84": 226,
    "29,80,84,89": 227,
    "29,84,89": 228,
    "29,86": 229,
    "30": 230,
    "30,31,42,43,60,63": 231,
    "30,31,42,43,72,75,81,84,86": 232,
    "30,31,43,83,84,86,87": 233,
    "30,31,82,84,86,87,93,96": 234,
    "30,32,49,51,56,58": 235,
    "30,32,49,53,56": 236,
    "30,33": 237,
    "30,33,36,39,42,45,48,51,54,57": 238,
    "30,33,36,39,42,57,60,63,66,69": 239,
    "30,33,38,42,50,54,57,62": 240,
    "30,34,42,72,75,81,82": 241,
    "30,34,54,58": 242,
    "30,35,42,47,56,66,68,69": 243,
    "30,35,42,47,62,65,68,71,74": 244,
    "30,36,43,84,86,87,89": 245,
    "30,36,84,87,92": 246,
    "30,37,42,45,49": 247,
    "30,37,42,49,53,54,56,58,61": 248,
    "30,37,42,49,54": 249,
    "30,37,42,49,57,64,68,69": 250,
    "30,37,42,54,57": 251,
    "30,37,42,57,61": 252,
    "30,37,42,61": 253,
    "30,37,42,61,66": 254,
    "30,37,42,66,69": 255,
    "30,37,42,69,73": 256,
    "30,37,42,73,78": 257,
    "30,37,42,78,81": 258,
    "30,37,42,82,85,94": 259,
    "30,37,46,58,66,73": 260,
    "30,37,46,70,78,85": 261,
    "30,37,49,51,53,56,58": 262,
    "30,37,49,53,54,56,58": 263,
    "30,37,49,54,58": 264,
    "30,37,82,85,94": 265,
    "30,38,42,45,50": 266,
    "30,38,42,50,54": 267,
    "30,38,42,54,57": 268,
    "30,38,42,57,62": 269,
    "30,38,42,62,66": 270,
    "30,38,42,66,69": 271,
    "30,38,42,69": 272,
    "30,38,42,69,74": 273,
    "30,38,42,74,78": 274,
    "30,38,42,78,81": 275,
    "30,39": 276,
    "30,42": 277,
    "30,42,48,50": 278,
    "30,42,48,51,56": 279,
    "30,42,50,51,63": 280,
    "30,42,51": 281,
    "30,42,51,57": 282,
    "30,42,51,58,63": 283,
    "30,42,51,63": 284,
    "30,42,54,58,61": 285,
    "30,42,54,58,66": 286,
    "30,42,54,60,63": 287,
    "30,42,54,60,63,72,75": 288,
    "30,42,54,66": 289,
    "30,42,57,60": 290,
    "30,42,57,60,62": 291,
    "30,42,57,60,63": 292,
    "30,42,57,61": 293,
    "30,42,57,61,63,69": 294,
    "30,42,57,61,69": 295,
    "30,42,57,62": 296,
    "30,42,57,62,66,69": 297,
    "30,42,57,66,69": 298,
    "30,42,57,69": 299,
    "30,42,58": 300,
    "30,42,58,61,66": 301,
    "30,42,58,66": 302,
    "30,42,60,63": 303,
    "30,42,61,64,67": 304,
    "30,42,61,64,70": 305,
    "30,42,61,66": 306,
    "30,42,61,66,69": 307,
    "30,42,61,66,70,73": 308,
    "30,42,61,66,73": 309,
    "30,42,61,69": 310,
    "30,42,61,69,73": 311,
    "30,42,61,70,73": 312,
    "30,42,62,66": 313,
    "30,42,62,66,74": 314,
    "30,42,64,67,71": 315,
    "30,42,64,70,73,76": 316,
    "30,42,66,69,73": 317,
    "30,42,66,69,74": 318,
    "30,42,66,74": 319,
    "30,42,69,73": 320,
    "30,42,70": 321,
    "30,42,70,73": 322,
    "30,42,70,78": 323,
    "30,42,73,78,81,85": 324,
    "30,42,75,81,84,87": 325,
    "30,42,78,82,85,90": 326,
    "30,42,78,90": 327,
    "30,42,80,83,86,89,92": 328,
    "30,42,81,84,86": 329,
    "30,42,82,85,88,94": 330,
    "30,42,82,85,90,94": 331,
    "30,42,83,86,90,95": 332,
    "30,43,84,86,87": 333,
    "30,43,84,87,89": 334,
    "30,45,48,51,54,57": 335,
    "30,49,51,58": 336,
    "30,49,53,56": 337,
    "30,49,54,58": 338,
    "30,50,78,86": 339,
    "30,54": 340,
    "30,58": 341,
    "30,64,66": 342,
    "30,66": 343,
    "30,70,74": 344,
    "30,73,75": 345,
    "30,74,77,82,86": 346,
    "30,78": 347,
    "30,82,86": 348,
    "30,84,87,92": 349,
    "30,84,87,92,93": 350,
    "30,84,87,93": 351,
    "30,87,93,96,99": 352,
    "31": 353,
    "31,32": 354,
    "31,32,39,87": 355,
    "31,32,39,94,96": 356,
    "31,32,41,83,84": 357,
    "31,32,41,87,89": 358,
    "31,32,41,88,89": 359,
    "31,32,43,44": 360,
    "31,32,43,44,59,62,65": 361,
    "31,32,43,58,60,61,63": 362,
    "31,32,44,72,75,84,87": 363,
    "31,32,48,52,58,60": 364,
    "31,32,49,51,56": 365,
    "31,32,49,51,58": 366,
    "31,32,84,85": 367,
    "31,33": 368,
    "31,33,43,45,55,60,64,67": 369,
    "31,33,47,50,55": 370,
    "31,33,55": 371,
    "31,33,57,60": 372,
    "31,33,66,67": 373,
    "31,33,69,71": 374,
    "31,33,72,74": 375,
    "31,33,76,78,79": 376,
    "31,33,77,79,86,89": 377,
    "31,33,81,83": 378,
    "31,33,88,89": 379,
    "31,34": 380,
    "31,34,37,40,43,49,52,55,58,61": 381,
    "31,34,37,40,43,61,64,67,70,73": 382,
    "31,34,38,43,55,58,62,67": 383,
    "31,34,40,43,52,55,64,67": 384,
    "31,34,40,43,52,64": 385,
    "31,34,41": 386,
    "31,34,43,70,73,82": 387,
    "31,34,43,72,75,79,81": 388,
    "31,34,43,72,75,81,82": 389,
    "31,35": 390,
    "31,35,38,43,50,53,55,59": 391,
    "31,35,38,43,55,59,60,62,67": 392,
    "31,35,38,43,55,59,62,67": 393,
    "31,35,38,43,67,71,74,79": 394,
    "31,35,43,50,59,62": 395,
    "31,35,43,86,89": 396,
    "31,36": 397,
    "31,36,40,48,52,55": 398,
    "31,36,43,46,48,52": 399,
    "31,36,43,48,55,64": 400,
    "31,36,43,48,72,74,75": 401,
    "31,36,43,58,60,65": 402,
    "31,36,47,50,55": 403,
    "31,36,47,54": 404,
    "31,36,52,65": 405,
    "31,36,55": 406,
    "31,36,67": 407,
    "31,36,71": 408,
    "31,36,74": 409,
    "31,36,79": 410,
    "31,36,83": 411,
    "31,37,43,49,52": 412,
    "31,37,43,52,55": 413,
    "31,37,43,58,61": 414,
    "31,37,43,61,64": 415,
    "31,37,43,70,73": 416,
    "31,37,43,73": 417,
    "31,37,43,73,76": 418,
    "31,37,43,79,82": 419,
    "31,37,43,82,85": 420,
    "31,38,41,50,53,55": 421,
    "31,38,41,50,53,57": 422,
    "31,38,41,50,53,59": 423,
    "31,38,50,53,59": 424,
    "31,38,89": 425,
    "31,39": 426,
    "31,39,43,49": 427,
    "31,39,82,86,87,93,94": 428,
    "31,39,84,96": 429,
    "31,39,94": 430,
    "31,39,94,96": 431,
    "31,39,96": 432,
    "31,41,43,55,87,89": 433,
    "31,41,43,77": 434,
    "31,41,83,84": 435,
    "31,41,84,86": 436,
    "31,41,86,87": 437,
    "31,41,89": 438,
    "31,43": 439,
    "31,43,44,54,55": 440,
    "31,43,45,79,91,93": 441,
    "31,43,47": 442,
    "31,43,47,48": 443,
    "31,43,47,48,50,55": 444,
    "31,43,47,49": 445,
    "31,43,47,50": 446,
    "31,43,47,50,53": 447,
    "31,43,47,50,55": 448,
    "31,43,47,50,55,64": 449,
    "31,43,47,55": 450,
    "31,43,47,59": 451,
    "31,43,48,50": 452,
    "31,43,48,51": 453,
    "31,43,48,56": 454,
    "31,43,49": 455,
    "31,43,49,50": 456,
    "31,43,49,52": 457,
    "31,43,49,56": 458,
    "31,43,50": 459,
    "31,43,50,53": 460,
    "31,43,50,53,55,59": 461,
    "31,43,50,53,59": 462,
    "31,43,50,53,59,60": 463,
    "31,43,50,55": 464,
    "31,43,50,56": 465,
    "31,43,50,59": 466,
    "31,43,51,56": 467,
    "31,43,51,58,61": 468,
    "31,43,51,58,61,63": 469,
    "31,43,52,56": 470,
    "31,43,53,56": 471,
    "31,43,53,56,59,61": 472,
    "31,43,53,56,59,62": 473,
    "31,43,53,59,62": 474,
    "31,43,55": 475,
    "31,43,55,57": 476,
    "31,43,55,59,62": 477,
    "31,43,55,59,62,67,69": 478,
    "31,43,55,60": 479,
    "31,43,55,60,63": 480,
    "31,43,55,66": 481,
    "31,43,55,67": 482,
    "31,43,56,59,62,64": 483,
    "31,43,56,59,62,65": 484,
    "31,43,57,60": 485,
    "31,43,58,60,62,63": 486,
    "31,43,58,61,63": 487,
    "31,43,58,61,63,70": 488,
    "31,43,58,62": 489,
    "31,43,59,60": 490,
    "31,43,59,62": 491,
    "31,43,59,62,65": 492,
    "31,43,59,62,71": 493,
    "31,43,59,67": 494,
    "31,43,60": 495,
    "31,43,60,63": 496,
    "31,43,60,63,72": 497,
    "31,43,62,63": 498,
    "31,43,62,65": 499,
    "31,43,62,67": 500,
    "31,43,64,67,73": 501,
    "31,43,64,73": 502,
    "31,43,65": 503,
    "31,43,65,68,71": 504,
    "31,43,65,74": 505,
    "31,43,66,69,75": 506,
    "31,43,66,72": 507,
    "31,43,67": 508,
    "31,43,67,68": 509,
    "31,43,67,71": 510,
    "31,43,67,79": 511,
    "31,43,68,71": 512,
    "31,43,71,72": 513,
    "31,43,71,79": 514,
    "31,43,72,74": 515,
    "31,43,72,75": 516,
    "31,43,72,75,84": 517,
    "31,43,72,78": 518,
    "31,43,73,76": 519,
    "31,43,74,75": 520,
    "31,43,74,75,77": 521,
    "31,43,74,77": 522,
    "31,43,75": 523,
    "31,43,75,77": 524,
    "31,43,75,77,79": 525,
    "31,43,75,79": 526,
    "31,43,75,83": 527,
    "31,43,75,88": 528,
    "31,43,76,82": 529,
    "31,43,76,85": 530,
    "31,43,76,88": 531,
    "31,43,77,79": 532,
    "31,43,77,79,80": 533,
    "31,43,77,86": 534,
    "31,43,78,79": 535,
    "31,43,78,84": 536,
    "31,43,79,80": 537,
    "31,43,79,83": 538,
    "31,43,79,91": 539,
    "31,43,80,83": 540,
    "31,43,83,84": 541,
    "31,43,83,86": 542,
    "31,43,83,86,89,95": 543,
    "31,43,84,86": 544,
    "31,43,84,86,89,95,96,98": 545,
    "31,43,84,86,89,96": 546,
    "31,43,85,88": 547,
    "31,43,86": 548,
    "31,43,86,87": 549,
    "31,43,86,89,95,98": 550,
    "31,43,86,89,98": 551,
    "31,43,87,89": 552,
    "31,43,89": 553,
    "31,44,74,87": 554,
    "31,45,86,89,95,98": 555,
    "31,47": 556,
    "31,47,50": 557,
    "31,47,50,55": 558,
    "31,48": 559,
    "31,48,67,84": 560,
    "31,49": 561,
    "31,49,51,56": 562,
    "31,49,52,55,58,61": 563,
    "31,50": 564,
    "31,50,52": 565,
    "31,50,55": 566,
    "31,51": 567,
    "31,52": 568,
    "31,52,54": 569,
    "31,53": 570,
    "31,53,57": 571,
    "31,53,65": 572,
    "31,53,67": 573,
    "31,54,55": 574,
    "31,54,57": 575,
    "31,54,59": 576,
    "31,55": 577,
    "31,55,57": 578,
    "31,55,59": 579,
    "31,55,59,62": 580,
    "31,55,59,67": 581,
    "31,55,60,67": 582,
    "31,55,67": 583,
    "31,55,69": 584,
    "31,57,59": 585,
    "31,57,69": 586,
    "31,57,70": 587,
    "31,58,61,63": 588,
    "31,58,69": 589,
    "31,58,70": 590,
    "31,58,72": 591,
    "31,59,62": 592,
    "31,59,62,65": 593,
    "31,60,63,72": 594,
    "31,60,70": 595,
    "31,60,72": 596,
    "31,60,74": 597,
    "31,62,72": 598,
    "31,62,74": 599,
    "31,64": 600,
    "31,64,73": 601,
    "31,65": 602,
    "31,65,74": 603,
    "31,66": 604,
    "31,66,72": 605,
    "31,67": 606,
    "31,67,71": 607,
    "31,71,79": 608,
    "31,72,75": 609,
    "31,72,75,84": 610,
    "31,72,78": 611,
    "31,73,75": 612,
    "31,74,77": 613,
    "31,76,77": 614,
    "31,76,85": 615,
    "31,77": 616,
    "31,77,79,86,89": 617,
    "31,77,86": 618,
    "31,78,84": 619,
    "31,79,83": 620,
    "31,82": 621,
    "31,82,86,94": 622,
    "31,82,86,94,96": 623,
    "31,82,86,96": 624,
    "31,83": 625,
    "31,83,86": 626,
    "31,83,86,89,95": 627,
    "31,84,86,89,96": 628,
    "31,86,89,95,98": 629,
    "31,86,89,98": 630,
    "31,87": 631,
    "31,88": 632,
    "32": 633,
    "32,33,44,45,51,52,54,55,61": 634,
    "32,33,44,60,63,66": 635,
    "32,34": 636,
    "32,34,44,46": 637,
    "32,34,46,67,75,84,87": 638,
    "32,34,48,52,58,60": 639,
    "32,34,82,84": 640,
    "32,35,38,50,56,59,62": 641,
    "32,36,39,44": 642,
    "32,36,39,44,48,51,54,60": 643,
    "32,36,39,44,48,60": 644,
    "32,36,39,44,51,58,60,61,63,70,72": 645,
    "32,36,39,44,56,68": 646,
    "32,36,39,44,60,63,68": 647,
    "32,36,39,44,60,63,68,72": 648,
    "32,36,39,44,60,63,72": 649,
    "32,36,39,44,60,72": 650,
    "32,36,39,75,87": 651,
    "32,36,41,44,60,65,68,72": 652,
    "32,36,41,44,72,77,80,84": 653,
    "32,36,44,51,56,60,63": 654,
    "32,36,44,56,60,67": 655,
    "32,36,56,60": 656,
    "32,37,44,49": 657,
    "32,37,44,49,52": 658,
    "32,37,44,52,54,60,61": 659,
    "32,37,44,52,56": 660,
    "32,37,44,53,54,61": 661,
    "32,37,44,56": 662,
    "32,37,44,56,61": 663,
    "32,37,44,61,64": 664,
    "32,37,44,63,75": 665,
    "32,37,44,64,68": 666,
    "32,37,44,68": 667,
    "32,37,44,68,73": 668,
    "32,37,44,72,73": 669,
    "32,37,44,73,76": 670,
    "32,37,49,53,61": 671,
    "32,39": 672,
    "32,39,44,47,51,56": 673,
    "32,39,44,51,53,55,58,60,65": 674,
    "32,39,44,66,78": 675,
    "32,39,49,55,58": 676,
    "32,39,51,56": 677,
    "32,39,51,58": 678,
    "32,39,51,59": 679,
    "32,39,84": 680,
    "32,39,86": 681,
    "32,39,86,87": 682,
    "32,39,87": 683,
    "32,39,87,89": 684,
    "32,39,89": 685,
    "32,39,89,91": 686,
    "32,39,91,92": 687,
    "32,39,92": 688,
    "32,39,92,94": 689,
    "32,39,94": 690,
    "32,40,59,64": 691,
    "32,40,59,66": 692,
    "32,40,59,68": 693,
    "32,41": 694,
    "32,41,77": 695,
    "32,41,77,79": 696,
    "32,41,77,89": 697,
    "32,41,79,80": 698,
    "32,41,80,82": 699,
    "32,41,80,92": 700,
    "32,41,82,84": 701,
    "32,41,83,84": 702,
    "32,41,84": 703,
    "32,41,84,86": 704,
    "32,41,84,86,87": 705,
    "32,41,86,87": 706,
    "32,41,87,89": 707,
    "32,41,89": 708,
    "32,42,48,51,56": 709,
    "32,43,44,71": 710,
    "32,43,44,76": 711,
    "32,43,44,88": 712,
    "32,43,83,86,88,95": 713,
    "32,44": 714,
    "32,44,47,50,53": 715,
    "32,44,48": 716,
    "32,44,48,49,51,56": 717,
    "32,44,48,49,57": 718,
    "32,44,48,51,55,56,58": 719,
    "32,44,48,51,56": 720,
    "32,44,48,51,60": 721,
    "32,44,48,54": 722,
    "32,44,48,54,56": 723,
    "32,44,48,56": 724,
    "32,44,48,56,57": 725,
    "32,44,48,60": 726,
    "32,44,49,51,55,58": 727,
    "32,44,49,51,55,58,60": 728,
    "32,44,49,52,61": 729,
    "32,44,49,53,65": 730,
    "32,44,49,54": 731,
    "32,44,49,54,57": 732,
    "32,44,49,57": 733,
    "32,44,51": 734,
    "32,44,51,54": 735,
    "32,44,51,54,60": 736,
    "32,44,51,54,60,61": 737,
    "32,44,51,54,61": 738,
    "32,44,51,56,60": 739,
    "32,44,51,56,60,63": 740,
    "32,44,51,57": 741,
    "32,44,51,60": 742,
    "32,44,51,68,71,75,83": 743,
    "32,44,51,71,75,80,83": 744,
    "32,44,52,56,61": 745,
    "32,44,52,56,61,63": 746,
    "32,44,52,59,62": 747,
    "32,44,52,61": 748,
    "32,44,52,64": 749,
    "32,44,53": 750,
    "32,44,53,54,65,66": 751,
    "32,44,53,56": 752,
    "32,44,53,58,62": 753,
    "32,44,53,59,62": 754,
    "32,44,53,60,65": 755,
    "32,44,53,65": 756,
    "32,44,54": 757,
    "32,44,54,56": 758,
    "32,44,54,56,60": 759,
    "32,44,54,57": 760,
    "32,44,54,57,63": 761,
    "32,44,54,60": 762,
    "32,44,54,60,63": 763,
    "32,44,54,60,68": 764,
    "32,44,54,61": 765,
    "32,44,54,61,63": 766,
    "32,44,54,63": 767,
    "32,44,54,66": 768,
    "32,44,55": 769,
    "32,44,55,59,62": 770,
    "32,44,56": 771,
    "32,44,56,57,60": 772,
    "32,44,56,59,64": 773,
    "32,44,56,59,64,66": 774,
    "32,44,56,60": 775,
    "32,44,56,60,63,68": 776,
    "32,44,56,60,68,72,80,84": 777,
    "32,44,56,61": 778,
    "32,44,56,61,64": 779,
    "32,44,56,61,68": 780,
    "32,44,56,63": 781,
    "32,44,56,64": 782,
    "32,44,56,66": 783,
    "32,44,56,68": 784,
    "32,44,57": 785,
    "32,44,57,60": 786,
    "32,44,57,61,66": 787,
    "32,44,57,61,66,68": 788,
    "32,44,57,63": 789,
    "32,44,57,66": 790,
    "32,44,58,63,67,68,70,71": 791,
    "32,44,59,62,65": 792,
    "32,44,59,62,65,71": 793,
    "32,44,59,62,65,77": 794,
    "32,44,59,62,71": 795,
    "32,44,60": 796,
    "32,44,60,63": 797,
    "32,44,60,63,68": 798,
    "32,44,60,63,73": 799,
    "32,44,60,66": 800,
    "32,44,60,66,72": 801,
    "32,44,60,66,75": 802,
    "32,44,60,72": 803,
    "32,44,61": 804,
    "32,44,61,63,64,66,72,73": 805,
    "32,44,61,64": 806,
    "32,44,61,64,68": 807,
    "32,44,61,64,73": 808,
    "32,44,61,68": 809,
    "32,44,62,65": 810,
    "32,44,62,65,71": 811,
    "32,44,62,65,71,74": 812,
    "32,44,62,71": 813,
    "32,44,63": 814,
    "32,44,63,66": 815,
    "32,44,63,66,72": 816,
    "32,44,63,68": 817,
    "32,44,63,69": 818,
    "32,44,63,72": 819,
    "32,44,63,72,75": 820,
    "32,44,64": 821,
    "32,44,64,68": 822,
    "32,44,64,68,73": 823,
    "32,44,64,73": 824,
    "32,44,65": 825,
    "32,44,65,68": 826,
    "32,44,65,74": 827,
    "32,44,66": 828,
    "32,44,66,68,72": 829,
    "32,44,66,69": 830,
    "32,44,66,69,75": 831,
    "32,44,66,70": 832,
    "32,44,66,70,78,82": 833,
    "32,44,66,72": 834,
    "32,44,66,75": 835,
    "32,44,66,78": 836,
    "32,44,68": 837,
    "32,44,68,69": 838,
    "32,44,68,71": 839,
    "32,44,68,71,76": 840,
    "32,44,68,72": 841,
    "32,44,68,73": 842,
    "32,44,68,73,76": 843,
    "32,44,68,76": 844,
    "32,44,69": 845,
    "32,44,69,72": 846,
    "32,44,69,73,78": 847,
    "32,44,69,75": 848,
    "32,44,70,82": 849,
    "32,44,71,75,80": 850,
    "32,44,71,80,83": 851,
    "32,44,72": 852,
    "32,44,72,75": 853,
    "32,44,72,75,84": 854,
    "32,44,72,78": 855,
    "32,44,72,80": 856,
    "32,44,72,80,84": 857,
    "32,44,72,82": 858,
    "32,44,73": 859,
    "32,44,73,76": 860,
    "32,44,73,76,80,85": 861,
    "32,44,73,79": 862,
    "32,44,74,86": 863,
    "32,44,75": 864,
    "32,44,75,78": 865,
    "32,44,75,80,83,87": 866,
    "32,44,75,81": 867,
    "32,44,75,84": 868,
    "32,44,75,85": 869,
    "32,44,76,88": 870,
    "32,44,77": 871,
    "32,44,77,80": 872,
    "32,44,78": 873,
    "32,44,78,81": 874,
    "32,44,78,84": 875,
    "32,44,78,87": 876,
    "32,44,79,85": 877,
    "32,44,80": 878,
    "32,44,80,84": 879,
    "32,44,81": 880,
    "32,44,83,86,88,95": 881,
    "32,44,84,87": 882,
    "32,44,88,89": 883,
    "32,44,89": 884,
    "32,45,83,86,88,95": 885,
    "32,46,73,86": 886,
    "32,46,76,89": 887,
    "32,48,51": 888,
    "32,48,51,56": 889,
    "32,49,51,55,58": 890,
    "32,49,51,56": 891,
    "32,49,51,58": 892,
    "32,49,53,61": 893,
    "32,49,73,77,85,89": 894,
    "32,49,77,80,89,92": 895,
    "32,51,56,60,63": 896,
    "32,54": 897,
    "32,54,55": 898,
    "32,56": 899,
    "32,56,60": 900,
    "32,60,63": 901,
    "32,72": 902,
    "32,72,75,84": 903,
    "32,72,80": 904,
    "32,73": 905,
    "32,73,79": 906,
    "32,79,85": 907,
    "32,80,84": 908,
    "32,83,86,88,95": 909,
    "32,84,87": 910,
    "32,84,89": 911,
    "32,86": 912,
    "32,87,92": 913,
    "32,89": 914,
    "32,92": 915,
    "33": 916,
    "33,34": 917,
    "33,34,45,46": 918,
    "33,34,45,46,57,58,69,70": 919,
    "33,34,53,58,62": 920,
    "33,34,53,63": 921,
    "33,34,54,57,60,63": 922,
    "33,34,54,63": 923,
    "33,34,57,60": 924,
    "33,34,70,74,79": 925,
    "33,34,74,77,82,86": 926,
    "33,34,77,82,86,89": 927,
    "33,35": 928,
    "33,35,36,79,81": 929,
    "33,35,38,86,88": 930,
    "33,35,39,42,45,47,51,54,57,60,63,65": 931,
    "33,35,47,50,55": 932,
    "33,35,55": 933,
    "33,35,67,69": 934,
    "33,35,71,72": 935,
    "33,35,74,76": 936,
    "33,35,86,88": 937,
    "33,36": 938,
    "33,36,41,45,48,60": 939,
    "33,36,41,45,53,65": 940,
    "33,36,90": 941,
    "33,37,40,45,69,73,76,81": 942,
    "33,37,40,45,69,73,81": 943,
    "33,37,40,45,81,85,88,93": 944,
    "33,37,45,49,52,53,55,56,61": 945,
    "33,37,64,76": 946,
    "33,38,40,47,50,52": 947,
    "33,38,40,47,51,52": 948,
    "33,38,40,47,52,54": 949,
    "33,38,40,47,62": 950,
    "33,38,40,47,71": 951,
    "33,38,40,47,71,83": 952,
    "33,38,40,47,74,86": 953,
    "33,38,40,47,75,87": 954,
    "33,38,40,47,76": 955,
    "33,38,40,47,76,88": 956,
    "33,38,40,47,80,92": 957,
    "33,38,40,47,81,93": 958,
    "33,38,74,77,86": 959,
    "33,41": 960,
    "33,41,48,53": 961,
    "33,41,48,53,57": 962,
    "33,41,53": 963,
    "33,41,53,55": 964,
    "33,41,55,57": 965,
    "33,41,83": 966,
    "33,42,81,90": 967,
    "33,44,84,88,96": 968,
    "33,45": 969,
    "33,45,48,52": 970,
    "33,45,48,52,76": 971,
    "33,45,48,53": 972,
    "33,45,48,60": 973,
    "33,45,49": 974,
    "33,45,49,52": 975,
    "33,45,52,55,61": 976,
    "33,45,52,57,60": 977,
    "33,45,52,61": 978,
    "33,45,53,60,63": 979,
    "33,45,54,61,66": 980,
    "33,45,55,58": 981,
    "33,45,57": 982,
    "33,45,57,60": 983,
    "33,45,57,61": 984,
    "33,45,57,61,63,69": 985,
    "33,45,57,61,64,69": 986,
    "33,45,57,69": 987,
    "33,45,60,63,65": 988,
    "33,45,60,63,66": 989,
    "33,45,60,64,66": 990,
    "33,45,61,63,66": 991,
    "33,45,61,64": 992,
    "33,45,61,64,73": 993,
    "33,45,61,66,69,73": 994,
    "33,45,61,66,73": 995,
    "33,45,69": 996,
    "33,45,69,81": 997,
    "33,45,72,77,84": 998,
    "33,45,73": 999,
    "33,45,73,76": 1000,
    "33,45,73,78,81,85": 1001,
    "33,45,76,85,88": 1002,
    "33,45,79,85,88,91": 1003,
    "33,45,81,93": 1004,
    "33,45,84,88,96": 1005,
    "33,46,72,77,84": 1006,
    "33,49": 1007,
    "33,50,54,57,59": 1008,
    "33,50,69,86": 1009,
    "33,54,57": 1010,
    "33,54,63": 1011,
    "33,55,61": 1012,
    "33,57": 1013,
    "33,57,60": 1014,
    "33,57,61": 1015,
    "33,57,67": 1016,
    "33,57,69": 1017,
    "33,60,63": 1018,
    "33,60,63,66": 1019,
    "33,61": 1020,
    "33,61,64": 1021,
    "33,65,69": 1022,
    "33,67,73": 1023,
    "33,69": 1024,
    "33,69,73": 1025,
    "33,73": 1026,
    "33,73,76": 1027,
    "33,73,76,81,85": 1028,
    "33,73,78,81,85": 1029,
    "33,73,78,85": 1030,
    "33,73,79,85": 1031,
    "33,77,79,86,89": 1032,
    "33,81": 1033,
    "33,84,87,93,96": 1034,
    "33,84,88,96": 1035,
    "34": 1036,
    "34,35": 1037,
    "34,35,46,47,50,53,56": 1038,
    "34,35,80,82": 1039,
    "34,36": 1040,
    "34,36,44,85,87": 1041,
    "34,36,46": 1042,
    "34,36,46,48": 1043,
    "34,36,48,52,58,60": 1044,
    "34,36,48,62": 1045,
    "34,36,48,67,75,79,87": 1046,
    "34,36,54,63": 1047,
    "34,36,57,60": 1048,
    "34,36,73,75,82": 1049,
    "34,36,84,86": 1050,
    "34,37": 1051,
    "34,37,39,46,55,67": 1052,
    "34,37,39,46,58,70": 1053,
    "34,37,42,46,49": 1054,
    "34,37,42,46,49,54": 1055,
    "34,37,42,46,84,96": 1056,
    "34,37,46,49,61,65": 1057,
    "34,37,46,49,65,77": 1058,
    "34,37,53,54,58,61,63": 1059,
    "34,37,58,61": 1060,
    "34,38,41,46": 1061,
    "34,38,41,46,53,56,58,62": 1062,
    "34,38,41,46,58,62,65,70": 1063,
    "34,38,41,46,70,74,77,82": 1064,
    "34,38,55,69": 1065,
    "34,38,70,77": 1066,
    "34,39,43,44,50,51,53": 1067,
    "34,39,43,44,51,53": 1068,
    "34,39,46,53,55,56,58,62,63": 1069,
    "34,39,49,60,61": 1070,
    "34,39,67,70,75,77": 1071,
    "34,40,43,46,60,64,67,72": 1072,
    "34,41": 1073,
    "34,41,42": 1074,
    "34,41,42,54,57,60,63": 1075,
    "34,41,42,57,63": 1076,
    "34,41,43,46,48,50,52": 1077,
    "34,41,43,46,61,65,67,73": 1078,
    "34,41,43,49,53,55,61": 1079,
    "34,41,45,46,48,53,58,60": 1080,
    "34,41,45,60,61,72,73": 1081,
    "34,41,46": 1082,
    "34,41,46,50": 1083,
    "34,41,48,53,57,61": 1084,
    "34,41,50,53": 1085,
    "34,41,50,53,58,62": 1086,
    "34,41,50,62": 1087,
    "34,41,53,56,62": 1088,
    "34,41,57,63": 1089,
    "34,41,65,68,74": 1090,
    "34,41,65,77": 1091,
    "34,41,70,82": 1092,
    "34,41,73,85": 1093,
    "34,41,77,89": 1094,
    "34,42,46,50,54,58": 1095,
    "34,42,53,58": 1096,
    "34,42,57,63": 1097,
    "34,42,58,62": 1098,
    "34,42,62,65": 1099,
    "34,42,62,65,70,74": 1100,
    "34,42,65,70": 1101,
    "34,42,70,74": 1102,
    "34,43,48,52": 1103,
    "34,44,46,51,53,56": 1104,
    "34,45,60,62,63,65,66": 1105,
    "34,46": 1106,
    "34,46,48": 1107,
    "34,46,49": 1108,
    "34,46,49,54": 1109,
    "34,46,50,53,58": 1110,
    "34,46,50,54,58": 1111,
    "34,46,51,53,55,56": 1112,
    "34,46,51,55,56": 1113,
    "34,46,52,55": 1114,
    "34,46,53": 1115,
    "34,46,53,56": 1116,
    "34,46,53,56,58,62": 1117,
    "34,46,53,56,60": 1118,
    "34,46,53,56,62": 1119,
    "34,46,53,56,63": 1120,
    "34,46,53,57": 1121,
    "34,46,53,58,62,82,86,89,94": 1122,
    "34,46,53,62,65": 1123,
    "34,46,54,58": 1124,
    "34,46,54,63": 1125,
    "34,46,55,58": 1126,
    "34,46,55,58,63,75,79,87": 1127,
    "34,46,55,60,64": 1128,
    "34,46,56,58": 1129,
    "34,46,56,58,65,77,80,89": 1130,
    "34,46,56,62,65": 1131,
    "34,46,56,62,68": 1132,
    "34,46,56,65": 1133,
    "34,46,57,58": 1134,
    "34,46,57,58,62": 1135,
    "34,46,57,58,62,63": 1136,
    "34,46,57,63": 1137,
    "34,46,58": 1138,
    "34,46,58,59,63,66": 1139,
    "34,46,58,61": 1140,
    "34,46,58,62": 1141,
    "34,46,58,62,65": 1142,
    "34,46,58,62,67": 1143,
    "34,46,58,63,67": 1144,
    "34,46,58,63,67,79,82,91": 1145,
    "34,46,58,66": 1146,
    "34,46,58,70": 1147,
    "34,46,59,62,71,74": 1148,
    "34,46,59,63,66": 1149,
    "34,46,59,71": 1150,
    "34,46,60,63,72": 1151,
    "34,46,61,63,66": 1152,
    "34,46,61,64,66": 1153,
    "34,46,61,65": 1154,
    "34,46,61,65,70": 1155,
    "34,46,61,73": 1156,
    "34,46,62": 1157,
    "34,46,62,63,65,66,69,70": 1158,
    "34,46,62,63,69,70": 1159,
    "34,46,62,65": 1160,
    "34,46,62,65,69,75": 1161,
    "34,46,62,65,70": 1162,
    "34,46,62,65,74": 1163,
    "34,46,62,70": 1164,
    "34,46,63,66": 1165,
    "34,46,63,66,69": 1166,
    "34,46,63,66,69,71": 1167,
    "34,46,63,66,70": 1168,
    "34,46,63,66,70,71": 1169,
    "34,46,63,66,70,72": 1170,
    "34,46,63,66,71": 1171,
    "34,46,63,66,72": 1172,
    "34,46,63,66,75": 1173,
    "34,46,63,69": 1174,
    "34,46,65": 1175,
    "34,46,65,68": 1176,
    "34,46,65,70": 1177,
    "34,46,65,73": 1178,
    "34,46,66,73": 1179,
    "34,46,67,68": 1180,
    "34,46,67,75": 1181,
    "34,46,68": 1182,
    "34,46,68,74,80": 1183,
    "34,46,69,70,74,75": 1184,
    "34,46,69,75": 1185,
    "34,46,70": 1186,
    "34,46,70,71,74": 1187,
    "34,46,70,71,82": 1188,
    "34,46,70,72": 1189,
    "34,46,70,73": 1190,
    "34,46,70,74": 1191,
    "34,46,70,74,77,82": 1192,
    "34,46,70,74,82": 1193,
    "34,46,70,82": 1194,
    "34,46,71,74": 1195,
    "34,46,71,82": 1196,
    "34,46,72": 1197,
    "34,46,72,75,84": 1198,
    "34,46,73": 1199,
    "34,46,73,77": 1200,
    "34,46,73,77,82,85": 1201,
    "34,46,73,85": 1202,
    "34,46,74": 1203,
    "34,46,74,75,81,82": 1204,
    "34,46,74,77": 1205,
    "34,46,74,82": 1206,
    "34,46,75": 1207,
    "34,46,75,79,87": 1208,
    "34,46,75,81": 1209,
    "34,46,76,85,88": 1210,
    "34,46,76,88": 1211,
    "34,46,77": 1212,
    "34,46,77,80": 1213,
    "34,46,77,80,89": 1214,
    "34,46,79": 1215,
    "34,46,79,80": 1216,
    "34,46,79,82,91": 1217,
    "34,46,80": 1218,
    "34,46,80,82": 1219,
    "34,46,81,87": 1220,
    "34,46,82": 1221,
    "34,46,82,86": 1222,
    "34,46,82,86,89,94": 1223,
    "34,46,82,94": 1224,
    "34,46,86": 1225,
    "34,46,86,89,92,98": 1226,
    "34,46,87,89,92,99": 1227,
    "34,46,89,92,101": 1228,
    "34,46,89,92,98,101": 1229,
    "34,47,74,88": 1230,
    "34,48": 1231,
    "34,48,72,85": 1232,
    "34,49,53,61": 1233,
    "34,49,65,70,77,82": 1234,
    "34,49,70,73,82,85": 1235,
    "34,49,70,82": 1236,
    "34,49,73,77,85,89": 1237,
    "34,49,73,85": 1238,
    "34,50": 1239,
    "34,50,53,58": 1240,
    "34,50,53,58,62": 1241,
    "34,50,58": 1242,
    "34,50,62": 1243,
    "34,50,64": 1244,
    "34,51,70,87": 1245,
    "34,52": 1246,
    "34,52,64": 1247,
    "34,52,65": 1248,
    "34,53,57": 1249,
    "34,53,58,62": 1250,
    "34,53,58,62,65": 1251,
    "34,53,65": 1252,
    "34,53,67": 1253,
    "34,54,57": 1254,
    "34,54,58": 1255,
    "34,54,61,64": 1256,
    "34,55,66": 1257,
    "34,55,67": 1258,
    "34,57,63": 1259,
    "34,58": 1260,
    "34,58,63": 1261,
    "34,58,70": 1262,
    "34,59,71": 1263,
    "34,60,63,72": 1264,
    "34,62,65": 1265,
    "34,62,65,70": 1266,
    "34,62,70": 1267,
    "34,63,69": 1268,
    "34,63,72,73": 1269,
    "34,64,72,73": 1270,
    "34,66,67": 1271,
    "34,67,75": 1272,
    "34,68,77": 1273,
    "34,69,75": 1274,
    "34,70": 1275,
    "34,70,74": 1276,
    "34,70,74,82": 1277,
    "34,70,77": 1278,
    "34,70,78": 1279,
    "34,70,82": 1280,
    "34,72,75,84": 1281,
    "34,72,80": 1282,
    "34,74,82": 1283,
    "34,75,78": 1284,
    "34,75,81": 1285,
    "34,81,87": 1286,
    "34,82,86": 1287,
    "34,85": 1288,
    "34,87,89,92,99": 1289,
    "34,88": 1290,
    "34,89,92,98,101": 1291,
    "35": 1292,
    "35,36": 1293,
    "35,36,41,42,79": 1294,
    "35,36,43,50,52,66,78": 1295,
    "35,36,43,86,89": 1296,
    "35,36,47,48": 1297,
    "35,36,47,48,50,52,53,55,56": 1298,
    "35,36,47,48,51,52,59": 1299,
    "35,36,47,50,55": 1300,
    "35,36,55": 1301,
    "35,36,59": 1302,
    "35,36,67": 1303,
    "35,36,67,70,76": 1304,
    "35,36,71": 1305,
    "35,36,74": 1306,
    "35,36,78,80": 1307,
    "35,36,79": 1308,
    "35,36,84,86": 1309,
    "35,36,86": 1310,
    "35,37": 1311,
    "35,37,47,49,59,61,71": 1312,
    "35,38": 1313,
    "35,38,86": 1314,
    "35,39": 1315,
    "35,39,42,47,51,54,57,63": 1316,
    "35,39,44,68,80": 1317,
    "35,39,47,51,59,63,66,71": 1318,
    "35,39,59,63,66,71": 1319,
    "35,40,47,52,54,56,57,63,64": 1320,
    "35,40,47,52,54,56,63,64": 1321,
    "35,40,47,52,55,57,63,64,66": 1322,
    "35,40,47,52,56,63,64,71": 1323,
    "35,40,47,52,59,64,66,68": 1324,
    "35,40,47,52,59,67,70,71": 1325,
    "35,40,47,52,59,67,72": 1326,
    "35,40,47,52,71,72,79,81": 1327,
    "35,40,59,64": 1328,
    "35,40,59,64,66,68": 1329,
    "35,41": 1330,
    "35,41,44,80": 1331,
    "35,42,44,80": 1332,
    "35,42,67,74,79": 1333,
    "35,42,79": 1334,
    "35,43": 1335,
    "35,43,50,55": 1336,
    "35,43,50,55,59": 1337,
    "35,43,50,55,62,67,74": 1338,
    "35,43,50,62": 1339,
    "35,43,50,66,67,78,79": 1340,
    "35,43,55": 1341,
    "35,43,55,57": 1342,
    "35,43,57,59": 1343,
    "35,43,79": 1344,
    "35,43,79,81": 1345,
    "35,43,81,83": 1346,
    "35,43,83,84": 1347,
    "35,43,84,86": 1348,
    "35,43,85,86": 1349,
    "35,43,86": 1350,
    "35,43,86,89": 1351,
    "35,44,47,56": 1352,
    "35,44,68,74,80": 1353,
    "35,44,68,80": 1354,
    "35,44,80": 1355,
    "35,45,47,49,52,56,57,59,61": 1356,
    "35,45,47,49,52,61": 1357,
    "35,45,47,76,79,88": 1358,
    "35,46,47,52,57,61,63,64,66": 1359,
    "35,47": 1360,
    "35,47,48,52": 1361,
    "35,47,49,53,61": 1362,
    "35,47,50,53,56": 1363,
    "35,47,50,59,67,74": 1364,
    "35,47,51,54,57,59": 1365,
    "35,47,51,54,57,60": 1366,
    "35,47,51,59": 1367,
    "35,47,52": 1368,
    "35,47,52,54,56,57,59": 1369,
    "35,47,52,54,59": 1370,
    "35,47,52,56": 1371,
    "35,47,52,56,59": 1372,
    "35,47,52,59": 1373,
    "35,47,53,56,62": 1374,
    "35,47,53,56,62,65": 1375,
    "35,47,53,56,63": 1376,
    "35,47,53,57": 1377,
    "35,47,54": 1378,
    "35,47,54,57": 1379,
    "35,47,54,57,59": 1380,
    "35,47,54,57,59,61": 1381,
    "35,47,54,57,60": 1382,
    "35,47,54,57,61": 1383,
    "35,47,54,57,61,63": 1384,
    "35,47,54,57,63": 1385,
    "35,47,54,57,64": 1386,
    "35,47,54,59": 1387,
    "35,47,54,59,66": 1388,
    "35,47,54,61": 1389,
    "35,47,54,63": 1390,
    "35,47,54,66": 1391,
    "35,47,55,59,67": 1392,
    "35,47,55,62,65": 1393,
    "35,47,55,67": 1394,
    "35,47,56,59,68": 1395,
    "35,47,56,61": 1396,
    "35,47,56,64": 1397,
    "35,47,56,64,68": 1398,
    "35,47,56,68": 1399,
    "35,47,57,59,66": 1400,
    "35,47,57,59,71": 1401,
    "35,47,57,63,66": 1402,
    "35,47,57,63,66,67": 1403,
    "35,47,57,63,66,69": 1404,
    "35,47,57,63,66,71": 1405,
    "35,47,57,63,67": 1406,
    "35,47,57,63,67,69": 1407,
    "35,47,57,63,69": 1408,
    "35,47,57,64,66,68": 1409,
    "35,47,59": 1410,
    "35,47,59,62": 1411,
    "35,47,59,62,66": 1412,
    "35,47,59,62,66,71": 1413,
    "35,47,59,62,67": 1414,
    "35,47,59,62,71": 1415,
    "35,47,59,63,66": 1416,
    "35,47,59,63,66,68": 1417,
    "35,47,59,63,71": 1418,
    "35,47,59,64,68": 1419,
    "35,47,59,64,68,69": 1420,
    "35,47,59,64,72": 1421,
    "35,47,59,66": 1422,
    "35,47,59,66,71": 1423,
    "35,47,59,66,71,72": 1424,
    "35,47,59,71": 1425,
    "35,47,61,64": 1426,
    "35,47,62,65,67": 1427,
    "35,47,62,66": 1428,
    "35,47,62,66,74": 1429,
    "35,47,63,66": 1430,
    "35,47,63,66,71": 1431,
    "35,47,64,67,72": 1432,
    "35,47,64,68": 1433,
    "35,47,66,70": 1434,
    "35,47,66,71": 1435,
    "35,47,71,74,79": 1436,
    "35,47,71,74,79,83": 1437,
    "35,47,71,79": 1438,
    "35,47,71,83": 1439,
    "35,47,72,74,81,83": 1440,
    "35,47,72,81": 1441,
    "35,47,73,77,80,85": 1442,
    "35,47,74": 1443,
    "35,47,74,83": 1444,
    "35,47,74,86": 1445,
    "35,47,75,78,87": 1446,
    "35,47,78,79": 1447,
    "35,47,83,95": 1448,
    "35,47,86,89": 1449,
    "35,47,86,89,91,98": 1450,
    "35,48,72,86": 1451,
    "35,49": 1452,
    "35,53,56,61": 1453,
    "35,53,61": 1454,
    "35,54,57,63": 1455,
    "35,56,61": 1456,
    "35,56,61,65": 1457,
    "35,56,65": 1458,
    "35,57,60,63,66": 1459,
    "35,59,63,66": 1460,
    "35,59,63,66,68": 1461,
    "35,59,64,68": 1462,
    "35,59,64,68,69": 1463,
    "35,61,65": 1464,
    "35,61,68": 1465,
    "35,65,68": 1466,
    "35,65,73": 1467,
    "35,68,73": 1468,
    "35,68,73,77": 1469,
    "35,68,77": 1470,
    "35,71": 1471,
    "35,73,77": 1472,
    "35,73,77,80": 1473,
    "35,73,80": 1474,
    "35,74,77": 1475,
    "35,77,79,86,89": 1476,
    "35,77,80": 1477,
    "35,80": 1478,
    "35,86": 1479,
    "35,86,89,91,98": 1480,
    "35,87,92": 1481,
    "36": 1482,
    "36,37": 1483,
    "36,37,43,46,52": 1484,
    "36,37,44,48,49,56,64,68": 1485,
    "36,37,44,48,49,56,66,68": 1486,
    "36,37,44,48,49,64,68,75,76": 1487,
    "36,37,44,53,54,56,61,63": 1488,
    "36,37,44,53,54,56,65": 1489,
    "36,37,44,87,89": 1490,
    "36,37,46,49": 1491,
    "36,37,48,49": 1492,
    "36,37,48,49,56,61,65,68": 1493,
    "36,37,49": 1494,
    "36,37,53,56,61": 1495,
    "36,37,67,70,76": 1496,
    "36,37,82,87,88,91": 1497,
    "36,38": 1498,
    "36,38,43,59,60,62,63,65,67,68": 1499,
    "36,38,46": 1500,
    "36,38,48,50": 1501,
    "36,38,48,50,60,62,72,74": 1502,
    "36,38,48,52,58,60": 1503,
    "36,38,48,67,71,72,75,77,79,84": 1504,
    "36,38,48,79,81": 1505,
    "36,38,50,67,75,79,87": 1506,
    "36,38,83,84": 1507,
    "36,39": 1508,
    "36,39,41,45": 1509,
    "36,39,41,45,81": 1510,
    "36,39,41,45,87": 1511,
    "36,39,42,90": 1512,
    "36,39,43,48,51,55,59,60": 1513,
    "36,39,43,48,51,55,60": 1514,
    "36,39,43,48,60,63,67,72": 1515,
    "36,39,43,48,72": 1516,
    "36,39,43,48,72,75,79,84": 1517,
    "36,39,44": 1518,
    "36,39,44,48,51,63": 1519,
    "36,39,44,48,56,68": 1520,
    "36,39,44,56": 1521,
    "36,39,54,60": 1522,
    "36,39,60,63,67,68": 1523,
    "36,39,62,63": 1524,
    "36,39,63": 1525,
    "36,39,63,65": 1526,
    "36,39,65": 1527,
    "36,39,66,78": 1528,
    "36,39,90": 1529,
    "36,40": 1530,
    "36,40,41,43,44,46,48,77,79": 1531,
    "36,40,41,77": 1532,
    "36,40,43,46,48,67,68": 1533,
    "36,40,43,46,48,68,70": 1534,
    "36,40,43,46,48,70,72": 1535,
    "36,40,43,46,48,72,73": 1536,
    "36,40,43,46,48,73,76": 1537,
    "36,40,43,46,48,76,77": 1538,
    "36,40,43,46,48,77,79": 1539,
    "36,40,43,46,48,78,79": 1540,
    "36,40,43,48,52,55,60": 1541,
    "36,40,43,48,72,76,79,84": 1542,
    "36,40,43,48,76,79,84,88": 1543,
    "36,40,43,48,79,84,88,91": 1544,
    "36,40,43,55": 1545,
    "36,40,52,55,60": 1546,
    "36,40,55,58,61,67": 1547,
    "36,40,64,67,76": 1548,
    "36,40,67,72": 1549,
    "36,40,72": 1550,
    "36,40,76": 1551,
    "36,41": 1552,
    "36,41,44,48": 1553,
    "36,41,44,48,53,56,60": 1554,
    "36,41,44,48,60,65,68,72": 1555,
    "36,41,44,48,65,67": 1556,
    "36,41,44,48,72,77,80,84": 1557,
    "36,41,44,48,74,76": 1558,
    "36,41,44,48,76,77": 1559,
    "36,41,44,53,56": 1560,
    "36,41,45,57": 1561,
    "36,41,48,60": 1562,
    "36,41,51,77": 1563,
    "36,41,53": 1564,
    "36,41,60,65": 1565,
    "36,41,65,68,77": 1566,
    "36,41,74,76": 1567,
    "36,41,77": 1568,
    "36,41,77,80": 1569,
    "36,43": 1570,
    "36,43,46,48": 1571,
    "36,43,46,48,52": 1572,
    "36,43,46,48,52,55": 1573,
    "36,43,46,52": 1574,
    "36,43,46,58": 1575,
    "36,43,48,52": 1576,
    "36,43,48,55,59": 1577,
    "36,43,51,55,60": 1578,
    "36,43,52,64,66,76,78": 1579,
    "36,43,55": 1580,
    "36,43,55,60,62,63,65,71,72": 1581,
    "36,43,57": 1582,
    "36,43,67": 1583,
    "36,43,72": 1584,
    "36,43,76": 1585,
    "36,43,86,89": 1586,
    "36,44": 1587,
    "36,44,48,51,56": 1588,
    "36,44,48,56,63,68": 1589,
    "36,44,48,56,66,68": 1590,
    "36,44,48,56,68": 1591,
    "36,44,48,63,66,68": 1592,
    "36,44,48,63,66,75": 1593,
    "36,44,48,63,68": 1594,
    "36,44,48,63,68,75": 1595,
    "36,44,48,66,68": 1596,
    "36,44,48,66,68,75": 1597,
    "36,44,48,68,75": 1598,
    "36,44,51,56,60": 1599,
    "36,44,51,56,60,63": 1600,
    "36,44,54,56,63,65": 1601,
    "36,44,56": 1602,
    "36,44,56,63": 1603,
    "36,44,56,66": 1604,
    "36,44,63,66": 1605,
    "36,44,66": 1606,
    "36,44,77,79": 1607,
    "36,44,77,80": 1608,
    "36,45": 1609,
    "36,45,48,53": 1610,
    "36,45,48,60": 1611,
    "36,45,48,69,81": 1612,
    "36,45,50,54": 1613,
    "36,45,51": 1614,
    "36,45,57": 1615,
    "36,45,57,69": 1616,
    "36,45,58": 1617,
    "36,45,72,81": 1618,
    "36,45,81,84,88,93": 1619,
    "36,46": 1620,
    "36,46,48,52,55": 1621,
    "36,46,53,56,58": 1622,
    "36,46,53,56,58,60": 1623,
    "36,46,58": 1624,
    "36,46,60": 1625,
    "36,46,76,79": 1626,
    "36,47,56": 1627,
    "36,47,87,91,99": 1628,
    "36,48": 1629,
    "36,48,49": 1630,
    "36,48,50,52,53,79,81": 1631,
    "36,48,50,53": 1632,
    "36,48,50,63,75,77": 1633,
    "36,48,50,79,81": 1634,
    "36,48,51": 1635,
    "36,48,51,52,55,60": 1636,
    "36,48,51,54": 1637,
    "36,48,51,55,60": 1638,
    "36,48,52": 1639,
    "36,48,52,53": 1640,
    "36,48,52,55": 1641,
    "36,48,52,55,60": 1642,
    "36,48,52,72,76": 1643,
    "36,48,52,76,79": 1644,
    "36,48,53,55": 1645,
    "36,48,53,55,70,72": 1646,
    "36,48,53,56,60,65": 1647,
    "36,48,53,57": 1648,
    "36,48,53,59": 1649,
    "36,48,53,60": 1650,
    "36,48,54,57,66": 1651,
    "36,48,54,60": 1652,
    "36,48,55": 1653,
    "36,48,55,58,64": 1654,
    "36,48,55,58,67": 1655,
    "36,48,55,59": 1656,
    "36,48,55,60": 1657,
    "36,48,55,60,64": 1658,
    "36,48,55,63": 1659,
    "36,48,55,64": 1660,
    "36,48,55,67": 1661,
    "36,48,56": 1662,
    "36,48,56,63,66,68": 1663,
    "36,48,56,65": 1664,
    "36,48,57,60": 1665,
    "36,48,57,63,66": 1666,
    "36,48,57,63,66,69": 1667,
    "36,48,58,60,64": 1668,
    "36,48,58,64": 1669,
    "36,48,60": 1670,
    "36,48,60,63,72": 1671,
    "36,48,60,64": 1672,
    "36,48,60,64,67,71": 1673,
    "36,48,60,64,67,72": 1674,
    "36,48,60,72": 1675,
    "36,48,60,72,76,79,84,88": 1676,
    "36,48,62": 1677,
    "36,48,62,67,71,75": 1678,
    "36,48,62,71": 1679,
    "36,48,63,66": 1680,
    "36,48,63,67": 1681,
    "36,48,63,67,72,75": 1682,
    "36,48,63,67,75": 1683,
    "36,48,63,72": 1684,
    "36,48,63,75": 1685,
    "36,48,64": 1686,
    "36,48,64,67": 1687,
    "36,48,64,67,72": 1688,
    "36,48,64,67,76": 1689,
    "36,48,64,70": 1690,
    "36,48,64,70,72,76": 1691,
    "36,48,64,72": 1692,
    "36,48,65,68": 1693,
    "36,48,66,68": 1694,
    "36,48,67,72": 1695,
    "36,48,67,75": 1696,
    "36,48,68,72,75,80": 1697,
    "36,48,68,75,80": 1698,
    "36,48,68,77": 1699,
    "36,48,70": 1700,
    "36,48,70,76": 1701,
    "36,48,70,76,79,82": 1702,
    "36,48,70,82": 1703,
    "36,48,71,72": 1704,
    "36,48,71,72,74": 1705,
    "36,48,72,75,79,84": 1706,
    "36,48,72,75,84": 1707,
    "36,48,72,76": 1708,
    "36,48,72,84": 1709,
    "36,48,74,83": 1710,
    "36,48,75,84": 1711,
    "36,48,76,77": 1712,
    "36,48,76,79": 1713,
    "36,48,76,79,82,84,88": 1714,
    "36,48,76,79,83,84,86,88": 1715,
    "36,48,76,79,84,88": 1716,
    "36,48,77": 1717,
    "36,48,77,80": 1718,
    "36,48,79,87": 1719,
    "36,48,81,84,88,93": 1720,
    "36,48,84": 1721,
    "36,48,84,96": 1722,
    "36,48,87,91,99": 1723,
    "36,49": 1724,
    "36,49,55,58,61,65": 1725,
    "36,50,62": 1726,
    "36,50,64": 1727,
    "36,50,70,84": 1728,
    "36,50,71,84": 1729,
    "36,50,72,86": 1730,
    "36,51": 1731,
    "36,51,54": 1732,
    "36,51,55,60": 1733,
    "36,51,55,62": 1734,
    "36,51,56": 1735,
    "36,51,57": 1736,
    "36,51,60": 1737,
    "36,51,63": 1738,
    "36,51,75,79,84,87": 1739,
    "36,52": 1740,
    "36,52,53": 1741,
    "36,52,55": 1742,
    "36,52,55,60": 1743,
    "36,52,60": 1744,
    "36,52,64": 1745,
    "36,53,55": 1746,
    "36,53,56,61": 1747,
    "36,53,65": 1748,
    "36,54": 1749,
    "36,54,65": 1750,
    "36,54,66": 1751,
    "36,55,58": 1752,
    "36,55,58,60": 1753,
    "36,55,58,60,64": 1754,
    "36,55,58,64": 1755,
    "36,55,64": 1756,
    "36,56,60": 1757,
    "36,56,63": 1758,
    "36,56,65": 1759,
    "36,56,68": 1760,
    "36,57": 1761,
    "36,58,61": 1762,
    "36,58,64": 1763,
    "36,60": 1764,
    "36,60,63": 1765,
    "36,60,63,67": 1766,
    "36,60,63,68": 1767,
    "36,60,63,72": 1768,
    "36,60,64": 1769,
    "36,60,64,67": 1770,
    "36,60,64,72": 1771,
    "36,60,65,72": 1772,
    "36,60,68": 1773,
    "36,60,72": 1774,
    "36,61,64": 1775,
    "36,62,71": 1776,
    "36,63,67": 1777,
    "36,63,67,72": 1778,
    "36,63,67,72,75": 1779,
    "36,63,67,74": 1780,
    "36,63,68": 1781,
    "36,63,68,72": 1782,
    "36,63,72": 1783,
    "36,63,75": 1784,
    "36,64": 1785,
    "36,64,67": 1786,
    "36,64,67,72": 1787,
    "36,64,72": 1788,
    "36,65,68": 1789,
    "36,65,68,71,74": 1790,
    "36,65,71,74,76": 1791,
    "36,65,72": 1792,
    "36,65,77": 1793,
    "36,66,78": 1794,
    "36,67,70,72,76": 1795,
    "36,67,70,76": 1796,
    "36,67,72": 1797,
    "36,68,72": 1798,
    "36,68,72,75": 1799,
    "36,68,75": 1800,
    "36,68,75,78": 1801,
    "36,68,75,80": 1802,
    "36,68,77": 1803,
    "36,70,76": 1804,
    "36,72": 1805,
    "36,72,74": 1806,
    "36,72,75": 1807,
    "36,72,75,79,84": 1808,
    "36,72,75,84": 1809,
    "36,72,84": 1810,
    "36,74,83": 1811,
    "36,75,79": 1812,
    "36,75,84": 1813,
    "36,76": 1814,
    "36,76,79": 1815,
    "36,76,79,82": 1816,
    "36,77,80": 1817,
    "36,77,80,89": 1818,
    "36,79": 1819,
    "36,79,82": 1820,
    "36,79,82,84,88": 1821,
    "36,79,82,88": 1822,
    "36,79,84": 1823,
    "36,79,87": 1824,
    "36,80": 1825,
    "36,80,84": 1826,
    "36,81,84,87,93": 1827,
    "36,81,84,88,93": 1828,
    "36,82,88,91": 1829,
    "36,84": 1830,
    "36,84,89": 1831,
    "36,84,96": 1832,
    "36,87,91": 1833,
    "36,87,91,92": 1834,
    "36,87,91,99": 1835,
    "36,87,92": 1836,
    "36,88,91": 1837,
    "37": 1838,
    "37,38,49,50,69,70,79": 1839,
    "37,38,77,82,88,89": 1840,
    "37,38,78,79,82": 1841,
    "37,38,78,82": 1842,
    "37,38,78,82,84": 1843,
    "37,38,78,84": 1844,
    "37,39": 1845,
    "37,39,41,49,53,61": 1846,
    "37,39,44,53,54,56,60,61": 1847,
    "37,39,44,54,66": 1848,
    "37,39,44,77,78": 1849,
    "37,39,49,51": 1850,
    "37,39,49,51,60,61,63,65,68": 1851,
    "37,39,49,53,56,61": 1852,
    "37,39,51": 1853,
    "37,39,55,58,64,65": 1854,
    "37,39,75,87": 1855,
    "37,40": 1856,
    "37,40,44,49,61,64,68,73": 1857,
    "37,40,44,49,73,76,80,85": 1858,
    "37,40,45,49,57,61,64,69": 1859,
    "37,40,45,49,64,66": 1860,
    "37,40,45,49,66,68": 1861,
    "37,40,45,49,68,69": 1862,
    "37,40,45,49,69,73,76,81": 1863,
    "37,40,45,49,76,78": 1864,
    "37,40,45,49,78,80": 1865,
    "37,40,45,49,80,81": 1866,
    "37,40,49,52,70,71,79": 1867,
    "37,41": 1868,
    "37,41,44,49": 1869,
    "37,41,44,49,53,56,61": 1870,
    "37,41,44,49,53,56,65": 1871,
    "37,41,44,49,53,65": 1872,
    "37,41,44,49,61,65,68,73": 1873,
    "37,41,44,49,61,65,73,77": 1874,
    "37,41,44,49,61,73": 1875,
    "37,41,44,49,77": 1876,
    "37,41,44,53,65": 1877,
    "37,41,46": 1878,
    "37,41,46,58": 1879,
    "37,41,49,53,56,61,65,68": 1880,
    "37,41,49,53,56,65,68": 1881,
    "37,41,49,53,58,61,70": 1882,
    "37,41,49,53,68,77,80": 1883,
    "37,41,53,56": 1884,
    "37,41,62,68,71": 1885,
    "37,41,73,85": 1886,
    "37,41,77,89": 1887,
    "37,41,80,92": 1888,
    "37,42,44,48,51,53,56,61": 1889,
    "37,42,46,54,58": 1890,
    "37,42,48,49,53,56,63": 1891,
    "37,42,49,54,61,69,72,73": 1892,
    "37,42,49,54,61,69,74": 1893,
    "37,42,49,69,81": 1894,
    "37,42,49,69,81,83": 1895,
    "37,42,49,78,82,90": 1896,
    "37,42,54": 1897,
    "37,42,54,58,61": 1898,
    "37,42,78,82,90": 1899,
    "37,43,46,52": 1900,
    "37,44": 1901,
    "37,44,48,49,53,54,56,61": 1902,
    "37,44,48,54,56": 1903,
    "37,44,48,54,56,63": 1904,
    "37,44,48,54,63": 1905,
    "37,44,49": 1906,
    "37,44,49,52": 1907,
    "37,44,49,52,56": 1908,
    "37,44,49,52,56,61": 1909,
    "37,44,49,53": 1910,
    "37,44,49,53,56": 1911,
    "37,44,49,53,61": 1912,
    "37,44,49,53,65": 1913,
    "37,44,49,56": 1914,
    "37,44,49,56,61": 1915,
    "37,44,49,56,61,68": 1916,
    "37,44,49,56,64": 1917,
    "37,44,49,56,64,68": 1918,
    "37,44,49,56,68": 1919,
    "37,44,49,61": 1920,
    "37,44,49,61,64": 1921,
    "37,44,49,61,64,68": 1922,
