{
  "token_to_id": {
    "101": 1,
    "26,101": 2,
    "26,29,98,101": 3,
    "27,39,60,67,72": 4,
    "27,39,63,67,70,75": 5,
    "27,39,63,67,75": 6,
    "28,31,40,43,52,55,64,67": 7,
    "28,40,52,64": 8,
    "28,40,68,75,80": 9,
    "29": 10,
    "29,30": 11,
    "29,30,32": 12,
    "29,30,32,60,65,69,72": 13,
    "29,30,41,42,73,80,85": 14,
    "29,30,54,57": 15,
    "29,30,54,57,62": 16,
    "29,30,57,62,66,69": 17,
    "29,30,60,65,69,72": 18,
    "29,33,36,41,65,69,72,77": 19,
    "29,33,36,41,77,81,84,89": 20,
    "29,33,36,41,81,84,89,93": 21,
    "29,33,41,45": 22,
    "29,34,41,48,49,53,57,58": 23,
    "29,34,41,49,53,57,58": 24,
    "29,34,41,53,57,58,60,61": 25,
    "29,34,41,53,57,58,61": 26,
    "29,34,41,57,58,60,61,65": 27,
    "29,34,41,58,61,65,66": 28,
    "29,34,94,98": 29,
    "29,39,41,44,56,57,60,65,66": 30,
    "29,41": 31,
    "29,41,42,46,49,58,60,70,72": 32,
    "29,41,45,57": 33,
    "29,41,48,51,53,65": 34,
    "29,41,48,53,57": 35,
    "29,41,49,53,56,61,65,73": 36,
    "29,41,50,56,59": 37,
    "29,41,51,57,59": 38,
    "29,41,51,57,59,60": 39,
    "29,41,51,57,60": 40,
    "29,41,51,57,60,62": 41,
    "29,41,51,57,62": 42,
    "29,41,53,57": 43,
    "29,41,53,57,60": 44,
    "29,41,53,58,62": 45,
    "29,41,53,65": 46,
    "29,41,57,60,65": 47,
    "29,41,57,60,66": 48,
    "29,41,59,61,71": 49,
    "29,41,59,71": 50,
    "29,41,60,65,68,72": 51,
    "29,41,60,72": 52,
    "29,41,61,65,70,73": 53,
    "29,41,61,68,71": 54,
    "29,41,61,68,73": 55,
    "29,41,65,68,72": 56,
    "29,41,65,70,73": 57,
    "29,41,67,68,72": 58,
    "29,41,68,71,73,80": 59,
    "29,41,68,72": 60,
    "29,41,69,76,81": 61,
    "29,41,73,80,85": 62,
    "29,41,77,81,84,89": 63,
    "29,41,77,81,86,89": 64,
    "29,41,77,81,89": 65,
    "29,41,77,82,86,89": 66,
    "29,41,89,101": 67,
    "29,54,56,57,60,61,63,65": 68,
    "29,56,61,65": 69,
    "29,60,65,69,72": 70,
    "29,65,69,72": 71,
    "29,77,80,84,89": 72,
    "30,31,70": 73,
    "30,32": 74,
    "30,32,42,44": 75,
    "30,32,42,44,54,57,60,61": 76,
    "30,32,49,54": 77,
    "30,32,49,57": 78,
    "30,32,54,57": 79,
    "30,32,56,59,68": 80,
    "30,32,56,68": 81,
    "30,32,57,61": 82,
    "30,32,59,62,68": 83,
    "30,32,60,65,69,72": 84,
    "30,32,69,73,78": 85,
    "30,37,42,49,54,56,57,61,63,64": 86,
    "30,37,42,54,58,66": 87,
    "30,37,44,78,88": 88,
    "30,39,42,59,71": 89,
    "30,40,42,80,93": 90,
    "30,41,42,84": 91,
    "30,42": 92,
    "30,42,45,49,54,66": 93,
    "30,42,48,51,54,66": 94,
    "30,42,48,60,72": 95,
    "30,42,51,54,63": 96,
    "30,42,51,63": 97,
    "30,42,54,57,61,63": 98,
    "30,42,54,59,63": 99,
    "30,42,57,61,66,73": 100,
    "30,42,57,61,69": 101,
    "30,42,58,61,66,70": 102,
    "30,42,58,66": 103,
    "30,42,59,63,71": 104,
    "30,42,60,61,68,70": 105,
    "30,42,60,61,69,70": 106,
    "30,42,60,61,70": 107,
    "30,42,60,68": 108,
    "30,42,60,68,70": 109,
    "30,42,60,69": 110,
    "30,42,60,69,70": 111,
    "30,42,60,70": 112,
    "30,42,60,72": 113,
    "30,42,61,63,70,71": 114,
    "30,42,61,66,69": 115,
    "30,42,61,66,71": 116,
    "30,42,61,70": 117,
    "30,42,62,65,68,71": 118,
    "30,42,62,70": 119,
    "30,42,63,71": 120,
    "30,42,63,73": 121,
    "30,42,64,73": 122,
    "30,42,66,69,73,78": 123,
    "30,42,66,69,75": 124,
    "30,42,66,73": 125,
    "30,42,67,73": 126,
    "30,42,68,71,73,80": 127,
    "30,42,70,71,73,78,80,82,83": 128,
    "30,42,70,73,78,82": 129,
    "30,42,75,80,84": 130,
    "30,42,75,84,87": 131,
    "30,42,80,83": 132,
    "30,42,80,90": 133,
    "30,42,81,85": 134,
    "30,42,81,92": 135,
    "30,42,83,92": 136,
    "30,42,85,93": 137,
    "30,45,49,54,66": 138,
    "30,47,50,53,54,66": 139,
    "30,49,56,65,66": 140,
    "30,49,70": 141,
    "30,61,66,69": 142,
    "30,65,77": 143,
    "30,66": 144,
    "30,69,73,78": 145,
    "30,78,81": 146,
    "30,81,90": 147,
    "31,32,43,44": 148,
    "31,32,43,44,74,78,86": 149,
    "31,32,43,44,76,82,88": 150,
    "31,32,44,52,58,59,61,62": 151,
    "31,32,70": 152,
    "31,32,72,75,78,80,84": 153,
    "31,32,72,75,80": 154,
    "31,34,43,46,55,58,67,70": 155,
    "31,36,43,48,79,83,86,91": 156,
    "31,36,43,48,79,84,88,91": 157,
    "31,36,43,52,58": 158,
    "31,36,43,58,60": 159,
    "31,36,43,60,64": 160,
    "31,36,43,63,65,67,72,74": 161,
    "31,36,72,76": 162,
    "31,38,43,45,46,48,50,54,55,57,58": 163,
    "31,38,43,46,50,55,58": 164,
    "31,39,43,51": 165,
    "31,39,43,51,58": 166,
    "31,39,43,51,58,61,63": 167,
    "31,39,43,58,61": 168,
    "31,39,43,60,65,67,71,72,75": 169,
    "31,39,43,61,63": 170,
    "31,41,43,44,67,68,72,75,79,80": 171,
    "31,43": 172,
    "31,43,47,54,59,74,77,78,79,83,86,91": 173,
    "31,43,48,51,55,67": 174,
    "31,43,52,58,61": 175,
    "31,43,52,61,64": 176,
    "31,43,53,55,59,62": 177,
    "31,43,55,58,62,67": 178,
    "31,43,55,59": 179,
    "31,43,55,59,62": 180,
    "31,43,55,59,62,67": 181,
    "31,43,55,60,63,67": 182,
    "31,43,55,60,64,67": 183,
    "31,43,55,62,65": 184,
    "31,43,55,67": 185,
    "31,43,55,74,76,82,86,88": 186,
    "31,43,55,76,82,88": 187,
    "31,43,55,77,83,86,89": 188,
    "31,43,55,78,81,84,87,90": 189,
    "31,43,57,60,66": 190,
    "31,43,57,62": 191,
    "31,43,58,61,64": 192,
    "31,43,58,63,70": 193,
    "31,43,58,70": 194,
    "31,43,59": 195,
    "31,43,59,60,62,67,69": 196,
    "31,43,59,62": 197,
    "31,43,59,62,65": 198,
    "31,43,59,62,67": 199,
    "31,43,59,64,67": 200,
    "31,43,59,65,69": 201,
    "31,43,59,67": 202,
    "31,43,60,62,69": 203,
    "31,43,62,67": 204,
    "31,43,62,67,71": 205,
    "31,43,62,71": 206,
    "31,43,63,67,70": 207,
    "31,43,63,70": 208,
    "31,43,63,70,75": 209,
    "31,43,64,76": 210,
    "31,43,65,67,71,73": 211,
    "31,43,65,67,74": 212,
    "31,43,65,71,75": 213,
    "31,43,67,71": 214,
    "31,43,67,71,72,74,75,79": 215,
    "31,43,67,71,74,77,79": 216,
    "31,43,67,71,74,79": 217,
    "31,43,67,72,75,79": 218,
    "31,43,67,75": 219,
    "31,43,67,79": 220,
    "31,43,70,74,79,82": 221,
    "31,43,71,74": 222,
    "31,43,71,74,79,83": 223,
    "31,43,71,79,83": 224,
    "31,43,74,78,83,86": 225,
    "31,43,74,78,86": 226,
    "31,43,74,79": 227,
    "31,43,74,79,83,86": 228,
    "31,43,76,79,84,88": 229,
    "31,43,76,82,85,88": 230,
    "31,43,76,82,88": 231,
    "31,43,77,79,83,86,91": 232,
    "31,43,77,83,86,91": 233,
    "31,43,79": 234,
    "31,43,79,81": 235,
    "31,43,79,83": 236,
    "31,43,79,83,86,91": 237,
    "31,43,79,83,89,91": 238,
    "31,43,79,84,88,91": 239,
    "31,43,79,91": 240,
    "31,43,82,86,94": 241,
    "31,47,52,59": 242,
    "31,47,59": 243,
    "31,52,55,59": 244,
    "31,52,59": 245,
    "31,55": 246,
    "31,57,60,66": 247,
    "31,59,62,67": 248,
    "31,59,65,69": 249,
    "31,61,63": 250,
    "31,64,70,72": 251,
    "31,70,72": 252,
    "31,70,74,79,82": 253,
    "32": 254,
    "32,33": 255,
    "32,33,40,45,67,73,79,81": 256,
    "32,33,44,45": 257,
    "32,33,52,57,61": 258,
    "32,33,52,57,61,64": 259,
    "32,33,57,62,66,69": 260,
    "32,33,67,73,75,79": 261,
    "32,33,70": 262,
    "32,34,44,46": 263,
    "32,34,44,46,53,55,65,67": 264,
    "32,34,44,62,63": 265,
    "32,34,44,72,78": 266,
    "32,35": 267,
    "32,35,44,47,51,63,68": 268,
    "32,35,44,47,59,63": 269,
    "32,36": 270,
    "32,36,39,44,56,60,63,68": 271,
    "32,36,44,48": 272,
    "32,36,44,60,69": 273,
    "32,36,44,63,68": 274,
    "32,36,44,72,81": 275,
    "32,37,44,49,56,66,68": 276,
    "32,37,44,49,63,64,68,72": 277,
    "32,37,44,51,52,56,60,61": 278,
    "32,37,44,52,56,60,61": 279,
    "32,37,44,53,54,61,63": 280,
    "32,37,44,56,60,61,63,64": 281,
    "32,37,44,56,60,61,64": 282,
    "32,37,44,60,61,63,64,68": 283,
    "32,37,44,61,64,68,69": 284,
    "32,37,44,64,66": 285,
    "32,37,44,65,66": 286,
    "32,37,44,73,84": 287,
    "32,37,44,80,85,88,92": 288,
    "32,37,53,56": 289,
    "32,39,44,51,55,56,58": 290,
    "32,39,51,70,71": 291,
    "32,40,44,75,76": 292,
    "32,40,71,78": 293,
    "32,40,74,76": 294,
    "32,40,76,78": 295,
    "32,42,44,47,59,60,63,68,69": 296,
    "32,44": 297,
    "32,44,48": 298,
    "32,44,48,51,56,60,63,68": 299,
    "32,44,48,51,56,68": 300,
    "32,44,48,51,60,63,68": 301,
    "32,44,49,52,56,61,64": 302,
    "32,44,49,52,68,73,80,81": 303,
    "32,44,49,52,69,73,81": 304,
    "32,44,49,52,73,76,80,85": 305,
    "32,44,49,56,61,65,73": 306,
    "32,44,51,54,60,63,64,66": 307,
    "32,44,51,54,60,63,68": 308,
    "32,44,51,56": 309,
    "32,44,51,56,60": 310,
    "32,44,51,63": 311,
    "32,44,52,59,62": 312,
    "32,44,52,59,62,64": 313,
    "32,44,52,59,64": 314,
    "32,44,54,60,63": 315,
    "32,44,54,60,63,68": 316,
    "32,44,56": 317,
    "32,44,56,59": 318,
    "32,44,56,59,68": 319,
    "32,44,56,60": 320,
    "32,44,56,60,63": 321,
    "32,44,56,60,63,66,68": 322,
    "32,44,56,61,64": 323,
    "32,44,56,68": 324,
    "32,44,57,61,66": 325,
    "32,44,59,62,71": 326,
    "32,44,59,63": 327,
    "32,44,59,63,68": 328,
    "32,44,59,71": 329,
    "32,44,60": 330,
    "32,44,60,63": 331,
    "32,44,60,63,66,72": 332,
    "32,44,60,63,68": 333,
    "32,44,60,63,69": 334,
    "32,44,60,64": 335,
    "32,44,60,65": 336,
    "32,44,60,65,68": 337,
    "32,44,60,66": 338,
    "32,44,60,66,72": 339,
    "32,44,60,68": 340,
    "32,44,60,69": 341,
    "32,44,60,70": 342,
    "32,44,60,72": 343,
    "32,44,62,65,71": 344,
    "32,44,62,65,71,74": 345,
    "32,44,63,65": 346,
    "32,44,63,66": 347,
    "32,44,63,68": 348,
    "32,44,63,68,72": 349,
    "32,44,63,75": 350,
    "32,44,64,68": 351,
    "32,44,64,68,73": 352,
    "32,44,64,69,73": 353,
    "32,44,65": 354,
    "32,44,65,66": 355,
    "32,44,65,68": 356,
    "32,44,65,71,76,77": 357,
    "32,44,65,71,77": 358,
    "32,44,65,72,77": 359,
    "32,44,65,77": 360,
    "32,44,66": 361,
    "32,44,66,68": 362,
    "32,44,66,69": 363,
    "32,44,66,70": 364,
    "32,44,66,72,78": 365,
    "32,44,67,73,76": 366,
    "32,44,68,70": 367,
    "32,44,68,72,75,80": 368,
    "32,44,68,76,80": 369,
    "32,44,70,71": 370,
    "32,44,71": 371,
    "32,44,71,73": 372,
    "32,44,72": 373,
    "32,44,72,74,78,84,86": 374,
    "32,44,72,75": 375,
    "32,44,72,75,80": 376,
    "32,44,72,75,80,84": 377,
    "32,44,72,75,84": 378,
    "32,44,72,77": 379,
    "32,44,72,78": 380,
    "32,44,72,78,84": 381,
    "32,44,72,79,84": 382,
    "32,44,72,80": 383,
    "32,44,72,82": 384,
    "32,44,73,76,81": 385,
    "32,44,74,78,84,86": 386,
    "32,44,74,78,86": 387,
    "32,44,75": 388,
    "32,44,75,78": 389,
    "32,44,75,78,84,87": 390,
    "32,44,75,80": 391,
    "32,44,75,80,85": 392,
    "32,44,75,82": 393,
    "32,44,77,80": 394,
    "32,44,77,83,89": 395,
    "32,44,77,86,89": 396,
    "32,44,78,80": 397,
    "32,44,78,82": 398,
    "32,44,78,84": 399,
    "32,45,49,52,73,79,85": 400,
    "32,45,51,73,79,85": 401,
    "32,47,52,59": 402,
    "32,47,56,71": 403,
    "32,47,59": 404,
    "32,48,60": 405,
    "32,49,53": 406,
    "32,50,53": 407,
    "32,51,54": 408,
    "32,51,56": 409,
    "32,51,56,63": 410,
    "32,52,56,59": 411,
    "32,52,56,61": 412,
    "32,53,56": 413,
    "32,53,58": 414,
    "32,54,56": 415,
    "32,54,60,61,63": 416,
    "32,54,60,63": 417,
    "32,56": 418,
    "32,56,59,63": 419,
    "32,56,60": 420,
    "32,56,61": 421,
    "32,56,61,65": 422,
    "32,56,68": 423,
    "32,59,64,71": 424,
    "32,60,63": 425,
    "32,60,63,68": 426,
    "32,63,68,72": 427,
    "32,63,73,80": 428,
    "32,64": 429,
    "32,66,72,80": 430,
    "32,68": 431,
    "32,68,72,75": 432,
    "32,69,75,78": 433,
    "32,71,75": 434,
    "32,72,75,78,80,84": 435,
    "32,72,75,80": 436,
    "32,72,79": 437,
    "32,73,75": 438,
    "32,75": 439,
    "32,75,84": 440,
    "32,80": 441,
    "32,81": 442,
    "32,85": 443,
    "33": 444,
    "33,34,36,62,65,70": 445,
    "33,34,45,46": 446,
    "33,34,45,46,75,77,87": 447,
    "33,34,45,69,73,74,76,81": 448,
    "33,34,51,54": 449,
    "33,34,51,54,63": 450,
    "33,34,51,62": 451,
    "33,34,57,58": 452,
    "33,34,70": 453,
    "33,34,74,77,80,82,86": 454,
    "33,35": 455,
    "33,35,45,47,55,57,61,62": 456,
    "33,35,45,47,57,61,63,66": 457,
    "33,35,45,47,64,71,73,74,76": 458,
    "33,35,45,47,68,69,73,74,80,81": 459,
    "33,35,57,64,66,67,69": 460,
    "33,35,62,66,67,71,72": 461,
    "33,35,68,71,73,77": 462,
    "33,36,40,45": 463,
    "33,36,40,45,57,60,64,69": 464,
    "33,36,40,45,57,64": 465,
    "33,36,40,45,69,72,76,81": 466,
    "33,36,41,45,77,81,84,89": 467,
    "33,36,41,45,81,84,89,93": 468,
    "33,36,45,48": 469,
    "33,36,45,48,57,60": 470,
    "33,36,45,48,57,60,69,72": 471,
    "33,36,57,60": 472,
    "33,36,57,62,66,69": 473,
    "33,36,57,62,66,72": 474,
    "33,36,93,96": 475,
    "33,37": 476,
    "33,37,40,42,44,45,49,52,54,56,57,61,64,66": 477,
    "33,37,40,45,49,52,57": 478,
    "33,37,42,45,54,57,61,66": 479,
    "33,37,45,49,56,57,61,64,66": 480,
    "33,37,45,49,64,67,69,73": 481,
    "33,37,45,49,65,66,68,73,77,78": 482,
    "33,37,57,62,66,67,71": 483,
    "33,37,57,64,66,67,69": 484,
    "33,37,57,64,67": 485,
    "33,37,57,64,67,69,76": 486,
    "33,37,57,66,67,69,71": 487,
    "33,37,57,66,69": 488,
    "33,37,57,67,71": 489,
    "33,37,69,74,76,78": 490,
    "33,37,69,76": 491,
    "33,38,41,45": 492,
    "33,38,41,45,57,65": 493,
    "33,38,41,45,62,64": 494,
    "33,38,42,45,50,74,78,81,86": 495,
    "33,38,45,50,66,74,78": 496,
    "33,38,54,57,62,64": 497,
    "33,38,54,57,62,66,69": 498,
    "33,38,54,62": 499,
    "33,38,57,62,64,66,67": 500,
    "33,38,57,62,66": 501,
    "33,38,57,62,66,74": 502,
    "33,38,57,64,66,67,69": 503,
    "33,38,57,64,67": 504,
    "33,38,57,66": 505,
    "33,38,57,66,67,69,71": 506,
    "33,38,57,66,69": 507,
    "33,38,62,66,72": 508,
    "33,38,66,67,74,76": 509,
    "33,38,66,69,73,74": 510,
    "33,38,66,69,74,76": 511,
    "33,38,66,74": 512,
    "33,38,67,71": 513,
    "33,38,74,78": 514,
    "33,40": 515,
    "33,40,45,47,52,72,74,76,80,81,83,84": 516,
    "33,40,45,49,52": 517,
    "33,40,45,49,52,57,61": 518,
    "33,40,45,49,57": 519,
    "33,40,45,49,61": 520,
    "33,40,45,52,57": 521,
    "33,40,45,52,57,64,69,76": 522,
    "33,40,45,52,61,67,68,73": 523,
    "33,40,45,52,85,95": 524,
    "33,40,45,55,57,61,69,73,81": 525,
    "33,40,45,57,61": 526,
    "33,40,45,61,64": 527,
    "33,40,45,61,69": 528,
    "33,40,45,64": 529,
    "33,40,45,64,69": 530,
    "33,40,45,66,73,78": 531,
    "33,40,45,66,73,78,79": 532,
    "33,40,45,67,73,79": 533,
    "33,40,45,69,73": 534,
    "33,40,45,69,73,81": 535,
    "33,40,45,69,76": 536,
    "33,40,45,72,76,81,84": 537,
    "33,40,45,73": 538,
    "33,40,45,73,76": 539,
    "33,40,45,73,76,81,85": 540,
    "33,40,45,73,81": 541,
    "33,40,45,76,81": 542,
    "33,40,45,81": 543,
    "33,40,45,81,85": 544,
    "33,40,45,85,88": 545,
    "33,40,45,88": 546,
    "33,40,45,88,93": 547,
    "33,40,45,93,97": 548,
    "33,40,61,64,67,69": 549,
    "33,40,61,64,67,69,70": 550,
    "33,40,64,69,73,76": 551,
    "33,40,73,74": 552,
    "33,41,45,53,60,63": 553,
    "33,41,45,65,72,75,77": 554,
    "33,41,45,77,84,87,89": 555,
    "33,42,45,54,60,63": 556,
    "33,44,45,57,69": 557,
    "33,44,49,52,76,80,85,87": 558,
    "33,45": 559,
    "33,45,47,68,69,73,76,81": 560,
    "33,45,48,52": 561,
    "33,45,48,52,57": 562,
    "33,45,48,53,65,72,75,77": 563,
    "33,45,49": 564,
    "33,45,49,50,57,59": 565,
    "33,45,49,52": 566,
    "33,45,49,52,57": 567,
    "33,45,49,52,75,79,87": 568,
    "33,45,49,55,57": 569,
    "33,45,49,55,57,66,70,78": 570,
    "33,45,49,55,59": 571,
    "33,45,49,55,59,61": 572,
    "33,45,49,57": 573,
    "33,45,50,52,57,59,61": 574,
    "33,45,50,57,59": 575,
    "33,45,52": 576,
    "33,45,52,54,57,61,62": 577,
    "33,45,52,57": 578,
    "33,45,52,57,61": 579,
    "33,45,52,57,61,69,73,81": 580,
    "33,45,54,60,64,66": 581,
    "33,45,54,61,64": 582,
    "33,45,54,61,66": 583,
    "33,45,55,57,61": 584,
    "33,45,55,57,61,64": 585,
    "33,45,55,61,64": 586,
    "33,45,57": 587,
    "33,45,57,60": 588,
    "33,45,57,60,66": 589,
    "33,45,57,61": 590,
    "33,45,57,61,66": 591,
    "33,45,57,62,66": 592,
    "33,45,57,66,69,72,73,75,76,81": 593,
    "33,45,57,69": 594,
    "33,45,60,63,65": 595,
    "33,45,60,63,66,72": 596,
    "33,45,60,64,69,72": 597,
    "33,45,60,72": 598,
    "33,45,61": 599,
    "33,45,61,64": 600,
    "33,45,61,64,67,69": 601,
    "33,45,61,64,67,73": 602,
    "33,45,61,66,69": 603,
    "33,45,61,67": 604,
    "33,45,61,67,68": 605,
    "33,45,63,66": 606,
    "33,45,63,67,73,75": 607,
    "33,45,64": 608,
    "33,45,64,67,69,73": 609,
    "33,45,64,67,69,73,76": 610,
    "33,45,64,69": 611,
    "33,45,64,69,75": 612,
    "33,45,64,72": 613,
    "33,45,64,73": 614,
    "33,45,64,73,76": 615,
    "33,45,66,67,73,76,78": 616,
    "33,45,66,69": 617,
    "33,45,66,69,73": 618,
    "33,45,66,69,73,78": 619,
    "33,45,66,73,78": 620,
    "33,45,67,69,73,76": 621,
    "33,45,67,69,73,76,81": 622,
    "33,45,67,72,79": 623,
    "33,45,67,73": 624,
    "33,45,67,73,75": 625,
    "33,45,67,73,75,76": 626,
    "33,45,67,73,76": 627,
    "33,45,69": 628,
    "33,45,69,72": 629,
    "33,45,69,72,76,81": 630,
    "33,45,69,73": 631,
    "33,45,69,73,76,79,81": 632,
    "33,45,69,73,76,79,81,85": 633,
    "33,45,69,73,76,81": 634,
    "33,45,69,73,81": 635,
    "33,45,69,74,77,81": 636,
    "33,45,69,77,81": 637,
    "33,45,69,81": 638,
    "33,45,72": 639,
    "33,45,72,75": 640,
    "33,45,72,75,77,84,87": 641,
    "33,45,72,77,84": 642,
    "33,45,73,76,79,85": 643,
    "33,45,75,77,87": 644,
    "33,45,75,78": 645,
    "33,45,75,78,84,87": 646,
    "33,45,76,79,81,85": 647,
    "33,45,78,81": 648,
    "33,45,78,87,90": 649,
    "33,45,79,81": 650,
    "33,45,79,85,91": 651,
    "33,45,81,84": 652,
    "33,45,81,84,89,93": 653,
    "33,45,81,85,88,93": 654,
    "33,45,81,93": 655,
    "33,45,84,87": 656,
    "33,48,51,54,65,66,72,75,77,78": 657,
    "33,49": 658,
    "33,49,52": 659,
    "33,49,54,57,61": 660,
    "33,50,52,57,59,61": 661,
    "33,51": 662,
    "33,52": 663,
    "33,52,53,57,61,62": 664,
    "33,52,57": 665,
    "33,52,57,61,64": 666,
    "33,54,61,63": 667,
    "33,54,61,64": 668,
    "33,54,62": 669,
    "33,55,61,64": 670,
    "33,56,59,62,65": 671,
    "33,57": 672,
    "33,57,59": 673,
    "33,57,60,64": 674,
    "33,57,61": 675,
    "33,57,61,64": 676,
    "33,57,61,64,69": 677,
    "33,57,62,66": 678,
    "33,57,64,67": 679,
    "33,57,66,69": 680,
    "33,58,61,64,67": 681,
    "33,61,69": 682,
    "33,64": 683,
    "33,64,69,72": 684,
    "33,64,69,73,76": 685,
    "33,65,69,72": 686,
    "33,65,72,75,77": 687,
    "33,66": 688,
    "33,73,74": 689,
    "33,74,76": 690,
    "33,74,77,80,82,86": 691,
    "33,78": 692,
    "33,79": 693,
    "33,84": 694,
    "33,87": 695,
    "33,96": 696,
    "34": 697,
    "34,35": 698,
    "34,35,46,47,53,63,65": 699,
    "34,35,46,47,58,63": 700,
    "34,35,46,47,76,78,88": 701,
    "34,35,51,55": 702,
    "34,35,51,55,63": 703,
    "34,35,54,58": 704,
    "34,35,54,58,63": 705,
    "34,35,70": 706,
    "34,35,71,74,78,83": 707,
    "34,36,46,48": 708,
    "34,36,46,48,55,67": 709,
    "34,36,58,60": 710,
    "34,36,62,65,70": 711,
    "34,37,46,49,66,68,73,78,80": 712,
    "34,37,55,61,63": 713,
    "34,37,61,64": 714,
    "34,37,61,65": 715,
    "34,38,46,50": 716,
    "34,38,89,94": 717,
    "34,39,46,51,53": 718,
    "34,39,46,51,54,65,66": 719,
    "34,39,46,51,55,67": 720,
    "34,39,46,51,75,78,82": 721,
    "34,39,46,54,56": 722,
    "34,39,46,68,77": 723,
    "34,39,61,63": 724,
    "34,41,46": 725,
    "34,41,46,50,53,57": 726,
    "34,41,46,50,53,58": 727,
    "34,41,46,50,53,62": 728,
    "34,41,46,50,58": 729,
    "34,41,46,53,58,62": 730,
    "34,41,46,65,70": 731,
    "34,41,46,70,73": 732,
    "34,41,46,73,77": 733,
    "34,41,46,77,82": 734,
    "34,41,46,85,89": 735,
    "34,41,49,53,58": 736,
    "34,41,53,58,61": 737,
    "34,41,53,62,63,68": 738,
    "34,41,57,65": 739,
    "34,41,58,61,65": 740,
    "34,41,63,67": 741,
    "34,41,69,80": 742,
    "34,41,74,80": 743,
    "34,42,46": 744,
    "34,42,46,78,82": 745,
    "34,42,46,85,90": 746,
    "34,45,48,53,63,75": 747,
    "34,46": 748,
    "34,46,49,53,61,65,73": 749,
    "34,46,49,53,63,75": 750,
    "34,46,49,55,64,70": 751,
    "34,46,50,53,58": 752,
    "34,46,51,54,58,63": 753,
    "34,46,51,54,58,70": 754,
    "34,46,52,55,57,58,61,69": 755,
    "34,46,52,55,58,61": 756,
    "34,46,52,58": 757,
    "34,46,53,54": 758,
    "34,46,53,56,65": 759,
    "34,46,53,58,62,70,74,82": 760,
    "34,46,53,65": 761,
    "34,46,54,56": 762,
    "34,46,54,58": 763,
    "34,46,55,58": 764,
    "34,46,55,62,67": 765,
    "34,46,55,67": 766,
    "34,46,56": 767,
    "34,46,56,58": 768,
    "34,46,56,62,65": 769,
    "34,46,56,64": 770,
    "34,46,57,63,65": 771,
    "34,46,57,63,65,67": 772,
    "34,46,58": 773,
    "34,46,58,59": 774,
    "34,46,58,61": 775,
    "34,46,58,61,66": 776,
    "34,46,58,62,65,70": 777,
    "34,46,58,63": 778,
    "34,46,58,70": 779,
    "34,46,59,62": 780,
    "34,46,60,63,66": 781,
    "34,46,60,63,66,68": 782,
    "34,46,60,63,68": 783,
    "34,46,61,64": 784,
    "34,46,61,65": 785,
    "34,46,61,65,73": 786,
    "34,46,61,66,70": 787,
    "34,46,61,73": 788,
    "34,46,62": 789,
    "34,46,62,63": 790,
    "34,46,62,64,65,67,70,73": 791,
    "34,46,62,65": 792,
    "34,46,62,65,70": 793,
    "34,46,62,65,70,74": 794,
    "34,46,63": 795,
    "34,46,63,65": 796,
    "34,46,63,66": 797,
    "34,46,63,82": 798,
    "34,46,64,65,67,70,73,74": 799,
    "34,46,64,67,70,73": 800,
    "34,46,64,76": 801,
    "34,46,65,66": 802,
    "34,46,65,67": 803,
    "34,46,65,68": 804,
    "34,46,65,70": 805,
    "34,46,65,70,74": 806,
    "34,46,65,74,77": 807,
    "34,46,66,70": 808,
    "34,46,66,73,78": 809,
    "34,46,67,70,75": 810,
    "34,46,68,70,77": 811,
    "34,46,68,72": 812,
    "34,46,68,74": 813,
    "34,46,68,74,76": 814,
    "34,46,68,74,78": 815,
    "34,46,68,74,80": 816,
    "34,46,68,77": 817,
    "34,46,70": 818,
    "34,46,70,73": 819,
    "34,46,70,73,77": 820,
    "34,46,70,73,77,82": 821,
    "34,46,70,73,78": 822,
    "34,46,70,74": 823,
    "34,46,70,74,79": 824,
    "34,46,70,74,82": 825,
    "34,46,70,75": 826,
    "34,46,70,77": 827,
    "34,46,72,77": 828,
    "34,46,72,77,84": 829,
    "34,46,73,76": 830,
    "34,46,73,76,78,85,88": 831,
    "34,46,73,77": 832,
    "34,46,73,78,82": 833,
    "34,46,73,78,85": 834,
    "34,46,74,77": 835,
    "34,46,74,77,82,86": 836,
    "34,46,75": 837,
    "34,46,75,76": 838,
    "34,46,75,77,86,87": 839,
    "34,46,75,77,87": 840,
    "34,46,75,78": 841,
    "34,46,75,78,82": 842,
    "34,46,76": 843,
    "34,46,76,78,88": 844,
    "34,46,77,82": 845,
    "34,46,78,82": 846,
    "34,46,80,86,89": 847,
    "34,46,82,86": 848,
    "34,46,82,87": 849,
    "34,46,87,90": 850,
    "34,50,53,62": 851,
    "34,50,62": 852,
    "34,51,54,63": 853,
    "34,51,55,63": 854,
    "34,51,63": 855,
    "34,53,58,61": 856,
    "34,53,58,62": 857,
    "34,54,58,63": 858,
    "34,54,63": 859,
    "34,55,58,67": 860,
    "34,55,61,63": 861,
    "34,55,62,65,67": 862,
    "34,55,67": 863,
    "34,57,60,62,65,67,69": 864,
    "34,58": 865,
    "34,58,62,65": 866,
    "34,58,62,67": 867,
    "34,58,67": 868,
    "34,60,63,69": 869,
    "34,62,65": 870,
    "34,62,65,67": 871,
    "34,62,65,70": 872,
    "34,62,68": 873,
    "34,63,65": 874,
    "34,63,66": 875,
    "34,63,75": 876,
    "34,64,67,72": 877,
    "34,65": 878,
    "34,66,68": 879,
    "34,66,70": 880,
    "34,68": 881,
    "34,70": 882,
    "34,70,73,77,82": 883,
    "34,70,74,77": 884,
    "34,72,75": 885,
    "34,73,77,82": 886,
    "34,74,77,80,82,86": 887,
    "34,74,77,82": 888,
    "34,75,77": 889,
    "34,77": 890,
    "34,85": 891,
    "34,86,89,94": 892,
    "34,94": 893,
    "35": 894,
    "35,36,47,48": 895,
    "35,36,47,48,52,56,57": 896,
    "35,36,47,48,55,67": 897,
    "35,36,47,48,60,65": 898,
    "35,36,47,48,62,63,66,69,71": 899,
    "35,36,47,48,67,74,76,79": 900,
    "35,36,74,75": 901,
    "35,36,76,79,82,84,88": 902,
    "35,37,42,47,49,62,64,66,71,73,74": 903,
    "35,37,47,49": 904,
    "35,37,47,49,55,57,62,64": 905,
    "35,37,47,49,56,59,61,63,64,68": 906,
    "35,37,47,49,56,66,68": 907,
    "35,37,47,49,59,61,71,73": 908,
    "35,37,47,49,64,69,71,73,74": 909,
    "35,37,47,49,68,74,78,80": 910,
    "35,37,51,54,59": 911,
    "35,37,62,66,71": 912,
    "35,37,64,66,73": 913,
    "35,37,64,73,76": 914,
    "35,37,68,71,73,77": 915,
    "35,37,71,74,78,83": 916,
    "35,37,75,78,83": 917,
    "35,38,40,47,62,68,74,77": 918,
    "35,38,43,47,48,50,54,57,62,66,69,74,79,83,86": 919,
    "35,38,43,47,74,79,83,86": 920,
    "35,38,55,62": 921,
    "35,38,57,64,67": 922,
    "35,38,62,67": 923,
    "35,38,62,67,71": 924,
    "35,38,71,74,78,83": 925,
    "35,39,42,47,66,71": 926,
    "35,39,47,51,54,66,68": 927,
    "35,39,47,59,71": 928,
    "35,40,42,47,52,62,66,68,71,74": 929,
    "35,40,45,52,61,69,73": 930,
    "35,40,47,52,59,63,64,66,68": 931,
    "35,40,47,52,59,63,64,66,69": 932,
    "35,40,47,52,59,64,71,76": 933,
    "35,40,47,56,57,63,64,71": 934,
    "35,40,47,56,57,64,66": 935,
    "35,40,47,61,68,73": 936,
    "35,40,47,62,68,74": 937,
    "35,40,55,64": 938,
    "35,40,59,67": 939,
    "35,40,59,68": 940,
    "35,40,64,67": 941,
    "35,40,64,68,74,76": 942,
    "35,40,64,74": 943,
    "35,40,71,73": 944,
    "35,40,73,74": 945,
    "35,41,47,53": 946,
    "35,41,47,56,58": 947,
    "35,41,69,74": 948,
    "35,42,47,62,66,71,74": 949,
    "35,42,47,66,74,78": 950,
    "35,42,47,71,75": 951,
    "35,42,47,74,78,86": 952,
    "35,42,47,75,78": 953,
    "35,42,47,75,87": 954,
    "35,42,47,78,83": 955,
    "35,42,47,83,87": 956,
    "35,42,49,58,59": 957,
    "35,42,54,63,65,70": 958,
    "35,44,47,64,76": 959,
    "35,44,59,68": 960,
    "35,46,63,76": 961,
    "35,47": 962,
    "35,47,50,53": 963,
    "35,47,50,53,54,66": 964,
    "35,47,50,54,59,62": 965,
    "35,47,50,54,59,71": 966,
    "35,47,50,54,62": 967,
    "35,47,50,54,71,83": 968,
    "35,47,51": 969,
    "35,47,51,54,63": 970,
    "35,47,51,56,63,68": 971,
    "35,47,51,59": 972,
    "35,47,51,63": 973,
    "35,47,53,56": 974,
    "35,47,54,57": 975,
    "35,47,54,59,63": 976,
    "35,47,54,62": 977,
    "35,47,54,62,64": 978,
    "35,47,54,62,66": 979,
    "35,47,54,63": 980,
    "35,47,54,63,66": 981,
    "35,47,54,63,75": 982,
    "35,47,54,64,66": 983,
    "35,47,54,66": 984,
    "35,47,55,57,62": 985,
    "35,47,55,62": 986,
    "35,47,55,62,65": 987,
    "35,47,55,67": 988,
    "35,47,56,57,63,64,68,71": 989,
    "35,47,56,59": 990,
    "35,47,56,59,64,68,83": 991,
    "35,47,56,59,68": 992,
    "35,47,56,62": 993,
    "35,47,56,62,68": 994,
    "35,47,56,64,68": 995,
    "35,47,56,64,71": 996,
    "35,47,56,68": 997,
    "35,47,57,59,63,71": 998,
    "35,47,57,63": 999,
    "35,47,57,63,66": 1000,
    "35,47,57,63,71": 1001,
    "35,47,57,69": 1002,
    "35,47,58": 1003,
    "35,47,58,59": 1004,
    "35,47,59": 1005,
    "35,47,59,61": 1006,
    "35,47,59,62": 1007,
    "35,47,59,62,67": 1008,
    "35,47,59,63,66": 1009,
    "35,47,59,63,66,68": 1010,
    "35,47,59,63,68": 1011,
    "35,47,59,63,71": 1012,
    "35,47,59,67,74,79": 1013,
    "35,47,59,68": 1014,
    "35,47,59,71": 1015,
    "35,47,61,63": 1016,
    "35,47,61,64,66": 1017,
    "35,47,62,65": 1018,
    "35,47,62,65,68": 1019,
    "35,47,62,66": 1020,
    "35,47,62,67": 1021,
    "35,47,62,67,71,74": 1022,
    "35,47,62,67,74": 1023,
    "35,47,62,71,81,83": 1024,
    "35,47,62,74": 1025,
    "35,47,63": 1026,
    "35,47,63,65": 1027,
    "35,47,63,66": 1028,
    "35,47,63,66,71": 1029,
    "35,47,63,68": 1030,
    "35,47,63,69": 1031,
    "35,47,63,75": 1032,
    "35,47,64,66,73": 1033,
    "35,47,64,68,74,76": 1034,
    "35,47,64,71,74": 1035,
    "35,47,65": 1036,
    "35,47,65,66": 1037,
    "35,47,65,68": 1038,
    "35,47,65,68,73": 1039,
    "35,47,65,68,73,75": 1040,
    "35,47,65,68,74,77": 1041,
    "35,47,65,71,74,76": 1042,
    "35,47,65,77": 1043,
    "35,47,66": 1044,
    "35,47,66,68": 1045,
    "35,47,66,68,74": 1046,
    "35,47,66,71": 1047,
    "35,47,67,74,79": 1048,
    "35,47,67,76,79": 1049,
    "35,47,67,79": 1050,
    "35,47,68": 1051,
    "35,47,68,69": 1052,
    "35,47,68,71": 1053,
    "35,47,68,71,76": 1054,
    "35,47,71": 1055,
    "35,47,71,74": 1056,
    "35,47,71,75": 1057,
    "35,47,71,76,80": 1058,
    "35,47,72,74": 1059,
    "35,47,73,78,85": 1060,
    "35,47,74": 1061,
    "35,47,74,75": 1062,
    "35,47,74,76": 1063,
    "35,47,74,77": 1064,
    "35,47,74,78,83,86": 1065,
    "35,47,75": 1066,
    "35,47,75,78": 1067,
    "35,47,75,78,83": 1068,
    "35,47,75,81": 1069,
    "35,47,76,78,87,88": 1070,
    "35,47,76,78,88": 1071,
    "35,47,76,80,85": 1072,
    "35,47,77": 1073,
    "35,47,77,79,83,86,91": 1074,
    "35,47,78,83": 1075,
    "35,47,83,87": 1076,
    "35,47,83,95": 1077,
    "35,50,52,56": 1078,
    "35,50,54,59,71": 1079,
    "35,51,54": 1080,
    "35,51,54,59": 1081,
    "35,51,56,63": 1082,
    "35,51,59": 1083,
    "35,51,63": 1084,
    "35,52,55,58,59,71": 1085,
    "35,54": 1086,
    "35,54,59": 1087,
    "35,54,59,63": 1088,
    "35,54,59,66": 1089,
    "35,54,61,70,71": 1090,
    "35,54,66": 1091,
    "35,55,59": 1092,
    "35,56,59,63": 1093,
    "35,59": 1094,
    "35,59,62,66": 1095,
    "35,59,63": 1096,
    "35,59,63,66": 1097,
    "35,59,66": 1098,
    "35,62,66": 1099,
    "35,62,71": 1100,
    "35,63": 1101,
    "35,63,66": 1102,
    "35,63,66,71": 1103,
    "35,63,66,75": 1104,
    "35,63,70": 1105,
    "35,63,71": 1106,
    "35,63,75": 1107,
    "35,64,66,76": 1108,
    "35,64,68": 1109,
    "35,64,76": 1110,
    "35,66": 1111,
    "35,66,71": 1112,
    "35,66,71,75": 1113,
    "35,66,71,75,76": 1114,
    "35,66,73,76": 1115,
    "35,66,75": 1116,
    "35,66,76": 1117,
    "35,67": 1118,
    "35,68,70": 1119,
    "35,68,71,76": 1120,
    "35,68,74,76": 1121,
    "35,71": 1122,
    "35,71,74,78,83": 1123,
    "35,71,75": 1124,
    "35,73": 1125,
    "35,74": 1126,
    "35,75,78,83": 1127,
    "35,76,79,82,84,88": 1128,
    "35,80": 1129,
    "35,83": 1130,
    "35,95": 1131,
    "36": 1132,
    "36,37": 1133,
    "36,37,39,40,44,48,49,52,56,61,63,64,66,68": 1134,
    "36,37,39,40,44,48,49,56,61,63,64,66,68": 1135,
    "36,37,44,48,49,66,68": 1136,
    "36,37,44,48,49,85,89": 1137,
    "36,37,45,48,49,57": 1138,
    "36,37,48,49": 1139,
    "36,37,48,49,57,82": 1140,
    "36,37,48,49,62,64,66,67,69,73,74": 1141,
    "36,37,48,49,67,71,72,77": 1142,
    "36,37,52,56,61": 1143,
    "36,37,52,56,61,64": 1144,
    "36,37,53,56,60,61": 1145,
    "36,37,64,68,73,76": 1146,
    "36,37,65,66,68,69": 1147,
    "36,37,72,73": 1148,
    "36,37,73,76,80,85": 1149,
    "36,38,45,48,50,53,57,58,64,65,67": 1150,
    "36,38,48,50": 1151,
    "36,38,48,50,55,67": 1152,
    "36,38,48,50,56,68": 1153,
    "36,38,48,50,67,71,72,75,79": 1154,
    "36,38,54,57,66": 1155,
    "36,38,54,66": 1156,
    "36,38,55": 1157,
    "36,38,57,62,64,66,67": 1158,
    "36,38,57,62,66": 1159,
    "36,38,57,66": 1160,
    "36,38,59,60,62,64": 1161,
    "36,38,62,66,67,69,71": 1162,
    "36,38,62,66,69": 1163,
    "36,38,62,66,69,72,76": 1164,
    "36,39,44,48,56,57,63,66,68,69": 1165,
    "36,39,44,48,56,63,66,68": 1166,
    "36,39,44,48,57,63,66,69": 1167,
    "36,39,44,48,68,80": 1168,
    "36,39,48,51": 1169,
    "36,39,48,51,60,63,72,75": 1170,
    "36,39,48,51,75,78,81,83,87,90": 1171,
    "36,39,55": 1172,
    "36,39,60,63": 1173,
    "36,40,43,48,52,55,60": 1174,
    "36,40,44,62,64": 1175,
    "36,40,45": 1176,
    "36,40,45,64": 1177,
    "36,40,45,64,65": 1178,
    "36,40,48,52": 1179,
    "36,40,48,52,56,59,60,64": 1180,
    "36,40,57,59,64": 1181,
    "36,40,59,64": 1182,
    "36,40,60,64": 1183,
    "36,40,64,72,76": 1184,
    "36,40,76,79": 1185,
    "36,41,44,62,65": 1186,
    "36,41,44,74,77": 1187,
    "36,41,48": 1188,
    "36,41,48,51,53,57": 1189,
    "36,41,48,53": 1190,
    "36,41,48,53,65,67,72,74,75,77,79": 1191,
    "36,41,48,58,60,67": 1192,
    "36,41,48,65,69": 1193,
    "36,41,48,75,77": 1194,
    "36,41,48,77,81": 1195,
    "36,41,48,87,89": 1196,
    "36,41,89,93": 1197,
    "36,42,45,48,54,57": 1198,
    "36,42,48": 1199,
    "36,42,48,66,69": 1200,
    "36,42,48,75,78": 1201,
    "36,43,48,51,55": 1202,
    "36,43,48,51,55,60,63": 1203,
    "36,43,48,51,55,62": 1204,
    "36,43,48,52,55,60": 1205,
    "36,43,48,52,55,60,64": 1206,
    "36,43,48,52,60": 1207,
    "36,43,48,60,63,67,71,72,74,79": 1208,
    "36,43,48,63,67,72": 1209,
    "36,43,48,63,67,72,75": 1210,
    "36,43,48,76,79,84,88": 1211,
    "36,43,55,60,64": 1212,
    "36,43,58,62,67": 1213,
    "36,43,60,64,67": 1214,
    "36,43,62,64,67,72": 1215,
    "36,43,63,67,72": 1216,
    "36,43,64,67,72": 1217,
    "36,43,64,67,72,74": 1218,
    "36,43,64,67,72,77": 1219,
    "36,43,67,72,74,76": 1220,
    "36,43,67,72,76": 1221,
    "36,43,67,72,76,77": 1222,
    "36,43,72,76": 1223,
    "36,43,72,76,79": 1224,
    "36,43,76,79,84": 1225,
    "36,43,79,84,88": 1226,
    "36,44,48": 1227,
    "36,44,48,56,63,68": 1228,
    "36,44,48,63,66": 1229,
    "36,44,48,63,66,68": 1230,
    "36,44,48,66,68": 1231,
    "36,44,48,68,75": 1232,
    "36,44,48,75,78": 1233,
    "36,44,48,78,80": 1234,
    "36,44,48,80,87": 1235,
    "36,44,48,87,90": 1236,
    "36,44,49,53,56,65,68,70": 1237,
    "36,44,51,54,56,66,70": 1238,
    "36,44,62,65": 1239,
    "36,44,62,68": 1240,
    "36,44,63,66": 1241,
    "36,44,63,68": 1242,
    "36,44,65,68": 1243,
    "36,44,66": 1244,
    "36,44,66,68": 1245,
    "36,44,66,69": 1246,
    "36,44,74,77": 1247,
    "36,44,75": 1248,
    "36,44,75,78": 1249,
    "36,44,75,80": 1250,
    "36,44,77,80": 1251,
    "36,44,78,80": 1252,
    "36,44,78,81": 1253,
    "36,45,48": 1254,
    "36,45,48,63,66": 1255,
    "36,45,48,66,69": 1256,
    "36,45,66,69": 1257,
    "36,45,66,69,72": 1258,
    "36,45,75,78,81": 1259,
    "36,46,55,60,64,72": 1260,
    "36,48": 1261,
    "36,48,51,53,58,65,70": 1262,
    "36,48,52,55,60": 1263,
    "36,48,52,57": 1264,
    "36,48,52,57,60,72,74,84,86": 1265,
    "36,48,52,64": 1266,
    "36,48,54,57": 1267,
    "36,48,55,57,60,64,65": 1268,
    "36,48,55,60": 1269,
    "36,48,55,60,63,67": 1270,
    "36,48,55,60,64": 1271,
    "36,48,55,60,64,67,69": 1272,
    "36,48,55,64,72,76": 1273,
    "36,48,55,64,76": 1274,
    "36,48,55,67": 1275,
    "36,48,56,60": 1276,
    "36,48,56,60,65": 1277,
    "36,48,56,68": 1278,
    "36,48,57,58,60,65,67": 1279,
    "36,48,57,60,65": 1280,
    "36,48,57,62": 1281,
    "36,48,57,63,66,69": 1282,
    "36,48,57,64": 1283,
    "36,48,57,69": 1284,
    "36,48,58,60,67": 1285,
    "36,48,58,64,67": 1286,
    "36,48,58,73": 1287,
    "36,48,60": 1288,
    "36,48,60,63,67,72": 1289,
    "36,48,60,64": 1290,
    "36,48,60,65": 1291,
    "36,48,60,72": 1292,
    "36,48,62,66": 1293,
    "36,48,62,66,67,69,71": 1294,
    "36,48,62,66,69": 1295,
    "36,48,62,66,69,74": 1296,
    "36,48,63,64": 1297,
    "36,48,63,69": 1298,
    "36,48,64,67,70": 1299,
    "36,48,64,67,72,76": 1300,
    "36,48,64,67,72,76,79": 1301,
    "36,48,64,68": 1302,
    "36,48,64,69,72": 1303,
    "36,48,64,69,72,76": 1304,
    "36,48,64,69,76": 1305,
    "36,48,64,71,72,74,76": 1306,
    "36,48,64,71,74": 1307,
    "36,48,64,72": 1308,
    "36,48,64,72,76": 1309,
    "36,48,65,74,77": 1310,
    "36,48,66,69": 1311,
    "36,48,67,70,76": 1312,
    "36,48,67,71": 1313,
    "36,48,67,72,75,79": 1314,
    "36,48,67,72,76": 1315,
    "36,48,67,72,76,77": 1316,
    "36,48,67,72,76,79": 1317,
    "36,48,67,72,77": 1318,
    "36,48,67,76,79": 1319,
    "36,48,68,72,77,80": 1320,
    "36,48,68,75,80": 1321,
    "36,48,68,77,80": 1322,
    "36,48,68,80": 1323,
    "36,48,69": 1324,
    "36,48,69,77,81": 1325,
    "36,48,69,78,81": 1326,
    "36,48,70,79": 1327,
    "36,48,70,79,82": 1328,
    "36,48,70,82": 1329,
    "36,48,72": 1330,
    "36,48,72,75": 1331,
    "36,48,72,76": 1332,
    "36,48,72,76,79,84": 1333,
    "36,48,72,76,84": 1334,
    "36,48,72,77,80,84": 1335,
    "36,48,72,84": 1336,
    "36,48,74,86": 1337,
    "36,48,75,78,84,87": 1338,
    "36,48,76,79": 1339,
    "36,48,76,79,82": 1340,
    "36,48,76,79,84,88": 1341,
    "36,48,76,82,88": 1342,
    "36,48,77,79,80,82,84": 1343,
    "36,48,78,81": 1344,
    "36,48,79,82,84": 1345,
    "36,48,79,82,88": 1346,
    "36,48,79,84": 1347,
    "36,48,79,84,88,91": 1348,
    "36,48,81,87": 1349,
    "36,48,84,88": 1350,
    "36,48,88,91": 1351,
    "36,48,91,96": 1352,
    "36,51,55,67": 1353,
    "36,51,56,68": 1354,
    "36,51,75,78,84,87": 1355,
    "36,54,57,63": 1356,
    "36,55,56,60,64,65": 1357,
    "36,55,60,62,64,65,67": 1358,
    "36,55,60,64": 1359,
    "36,55,64,67,72": 1360,
    "36,55,64,72,76": 1361,
    "36,56,60,65": 1362,
    "36,56,68": 1363,
    "36,57,60,65": 1364,
    "36,57,62,66": 1365,
    "36,58,62,64,67,72": 1366,
    "36,58,64,70": 1367,
    "36,58,65,70": 1368,
    "36,58,70": 1369,
    "36,58,70,82": 1370,
    "36,58,73": 1371,
    "36,59,62": 1372,
    "36,60,63,67": 1373,
    "36,60,64": 1374,
    "36,60,64,67": 1375,
    "36,60,65,69": 1376,
    "36,60,65,70": 1377,
    "36,62,65,71": 1378,
    "36,62,66,69": 1379,
    "36,63,67,75": 1380,
    "36,64,65,67,68": 1381,
    "36,64,67": 1382,
    "36,64,67,70": 1383,
    "36,64,67,72": 1384,
    "36,65,67,68,70": 1385,
    "36,65,68": 1386,
    "36,66,69": 1387,
    "36,67,70": 1388,
    "36,67,72,75": 1389,
    "36,68,72": 1390,
    "36,69": 1391,
    "36,69,75,77": 1392,
    "36,70": 1393,
    "36,70,72": 1394,
    "36,72": 1395,
    "36,72,76": 1396,
    "36,72,76,79": 1397,
    "36,73,76,80,85": 1398,
    "36,75,77": 1399,
    "36,75,78,81": 1400,
    "36,75,78,84,87": 1401,
    "36,76": 1402,
    "36,76,79": 1403,
    "36,76,79,82,84,88": 1404,
    "36,77,80": 1405,
    "36,81": 1406,
    "36,96": 1407,
    "37": 1408,
    "37,38": 1409,
    "37,38,45,49,50,54,55,57,62,64,66": 1410,
    "37,38,45,49,50,64,66,69,76,78": 1411,
    "37,38,45,57,58,65,67,69,70": 1412,
    "37,38,45,69,77,79,81,82": 1413,
    "37,38,48,61": 1414,
    "37,38,49,50": 1415,
    "37,38,49,50,61,62,73,74": 1416,
    "37,38,49,50,64,68,69,71,73": 1417,
    "37,38,49,50,68,74,76,78": 1418,
    "37,38,49,50,69,76,81,85,88": 1419,
    "37,38,54,58,66": 1420,
    "37,38,54,58,67": 1421,
    "37,38,57,58,65,67": 1422,
    "37,38,57,62,66,69": 1423,
    "37,38,58,59": 1424,
    "37,38,58,64,66": 1425,
    "37,38,64,66": 1426,
    "37,38,66": 1427,
    "37,38,71,74,78,83": 1428,
    "37,38,76,77": 1429,
    "37,39,44,48,49,53,54,56,63,65": 1430,
    "37,39,44,56,60,61,65,68": 1431,
    "37,39,44,61,65,73": 1432,
    "37,39,44,65,77": 1433,
    "37,39,45,49,51,57": 1434,
    "37,39,49,51": 1435,
    "37,39,49,51,63,64,68,69,71,73": 1436,
    "37,39,59,71,73": 1437,
    "37,39,60,68": 1438,
    "37,39,64,66,73": 1439,
    "37,39,64,73": 1440,
    "37,39,66,70,73": 1441,
    "37,39,70,73": 1442,
    "37,39,73": 1443,
    "37,39,73,76,80,85": 1444,
    "37,40": 1445,
    "37,40,41,61,65": 1446,
    "37,40,44,49,52,56,61": 1447,
    "37,40,44,49,52,56,61,64": 1448,
    "37,40,44,49,56,61,64,68": 1449,
    "37,40,44,49,73,76,80,85": 1450,
    "37,40,44,52,56,59,61,64,65,68": 1451,
    "37,40,44,56,61": 1452,
    "37,40,44,68,73": 1453,
    "37,40,59,64,67,73": 1454,
    "37,40,61,64": 1455,
    "37,40,64,67": 1456,
    "37,40,73,76,80,85": 1457,
    "37,41": 1458,
    "37,41,44,56,61": 1459,
    "37,41,44,68,73": 1460,
    "37,41,49": 1461,
    "37,41,49,53": 1462,
    "37,41,49,59,62": 1463,
    "37,41,49,65,77": 1464,
    "37,41,49,73,85": 1465,
    "37,41,61,68,71": 1466,
    "37,42,45,49,54,57,62,64,69": 1467,
    "37,42,46,49,58,65,66": 1468,
    "37,42,49,53,57,69,70": 1469,
    "37,42,49,54,68,70,73,80,82": 1470,
    "37,42,49,58,59": 1471,
    "37,42,54,58,66": 1472,
    "37,42,61,66,70": 1473,
    "37,42,73,76,80,85": 1474,
    "37,43,44,61,65": 1475,
    "37,44": 1476,
    "37,44,45,61,65": 1477,
    "37,44,48,51,68,72,75,80": 1478,
    "37,44,49": 1479,
    "37,44,49,51,56,60,63,65,68,72,77": 1480,
    "37,44,49,52,56,61": 1481,
    "37,44,49,52,56,64,68": 1482,
    "37,44,49,52,61,64,68,73": 1483,
    "37,44,49,53,56": 1484,
    "37,44,49,53,56,60,65,66": 1485,
    "37,44,49,53,56,65": 1486,
    "37,44,49,53,56,65,66": 1487,
    "37,44,49,53,56,65,68": 1488,
    "37,44,49,53,56,66": 1489,
    "37,44,49,56": 1490,
    "37,44,49,56,61": 1491,
    "37,44,49,61,65": 1492,
    "37,44,49,65,68": 1493,
    "37,44,49,65,68,73": 1494,
    "37,44,49,65,68,73,77": 1495,
    "37,44,49,65,68,77": 1496,
    "37,44,49,68,73": 1497,
    "37,44,49,73,77": 1498,
    "37,44,49,77,80": 1499,
    "37,44,49,80,85": 1500,
    "37,44,49,85,89": 1501,
    "37,44,51,54,56,66,68": 1502,
    "37,44,51,54,68,72,73,80": 1503,
    "37,44,52,56": 1504,
    "37,44,52,56,61": 1505,
    "37,44,53,56": 1506,
    "37,44,53,61": 1507,
    "37,44,56,61": 1508,
    "37,44,56,61,64": 1509,
    "37,44,56,61,65": 1510,
    "37,44,56,61,65,68": 1511,
    "37,44,56,65,66,71": 1512,
    "37,44,61": 1513,
    "37,44,61,64": 1514,
    "37,44,61,64,68": 1515,
    "37,44,61,65": 1516,
    "37,44,61,65,73": 1517,
    "37,44,61,65,73,77": 1518,
    "37,44,64,68": 1519,
    "37,44,65": 1520,
    "37,44,65,68": 1521,
    "37,44,65,68,71,74": 1522,
    "37,44,68,73": 1523,
    "37,44,73": 1524,
    "37,44,73,76": 1525,
    "37,44,73,77": 1526,
    "37,44,75,78": 1527,
    "37,44,75,85": 1528,
    "37,44,76,80": 1529,
    "37,44,76,85": 1530,
    "37,44,76,87": 1531,
    "37,44,78,87": 1532,
    "37,44,80,88": 1533,
    "37,45,49,54,56,65,66": 1534,
    "37,45,49,57": 1535,
    "37,45,49,57,64,67,69": 1536,
    "37,45,49,57,64,69": 1537,
    "37,45,49,64,67,69": 1538,
    "37,45,49,64,69,71": 1539,
    "37,45,57,64,67": 1540,
    "37,45,57,67,71": 1541,
    "37,45,58,67,70": 1542,
    "37,45,69,76": 1543,
    "37,45,69,79,82": 1544,
    "37,46,49": 1545,
    "37,46,49,77,82": 1546,
    "37,46,49,85,89": 1547,
    "37,47,49,59,61,63": 1548,
    "37,48,49": 1549,
    "37,48,49,59,62": 1550,
    "37,48,49,73,85": 1551,
    "37,48,65,66,77,78": 1552,
    "37,49": 1553,
    "37,49,50,62": 1554,
    "37,49,51,67,68,77,79,80": 1555,
    "37,49,52,55": 1556,
    "37,49,52,56": 1557,
    "37,49,52,57": 1558,
    "37,49,53,56,61": 1559,
    "37,49,53,56,61,65,68": 1560,
    "37,49,53,56,61,73": 1561,
    "37,49,53,60,65,72": 1562,
    "37,49,54,58,66": 1563,
    "37,49,54,61": 1564,
    "37,49,54,66": 1565,
    "37,49,55,58": 1566,
    "37,49,56,59,63": 1567,
    "37,49,56,59,65": 1568,
    "37,49,56,59,66": 1569,
    "37,49,56,61": 1570,
    "37,49,56,61,64": 1571,
    "37,49,56,61,64,68": 1572,
    "37,49,56,61,65": 1573,
    "37,49,56,61,71": 1574,
    "37,49,56,63": 1575,
    "37,49,56,63,65": 1576,
    "37,49,56,65": 1577,
    "37,49,56,66": 1578,
    "37,49,57,61": 1579,
    "37,49,57,61,66": 1580,
    "37,49,57,64": 1581,
    "37,49,57,64,85": 1582,
    "37,49,58": 1583,
    "37,49,58,61": 1584,
    "37,49,58,65,70": 1585,
    "37,49,59,61": 1586,
    "37,49,59,61,65": 1587,
    "37,49,59,61,65,68": 1588,
    "37,49,59,62": 1589,
    "37,49,59,63": 1590,
    "37,49,59,63,65": 1591,
    "37,49,59,65": 1592,
    "37,49,59,65,66": 1593,
    "37,49,59,66": 1594,
    "37,49,60,65,72": 1595,
    "37,49,61": 1596,
    "37,49,61,63": 1597,
    "37,49,61,64": 1598,
    "37,49,61,65,68": 1599,
    "37,49,61,65,68,73": 1600,
    "37,49,61,66": 1601,
    "37,49,61,73": 1602,
    "37,49,63": 1603,
    "37,49,63,65": 1604,
    "37,49,64": 1605,
    "37,49,64,67": 1606,
    "37,49,64,67,69": 1607,
    "37,49,64,67,69,71": 1608,
    "37,49,64,67,71": 1609,
    "37,49,64,67,73": 1610,
    "37,49,64,68,70": 1611,
    "37,49,64,68,70,71": 1612,
    "37,49,64,68,71": 1613,
    "37,49,64,68,71,72": 1614,
    "37,49,64,68,72": 1615,
    "37,49,64,69,71": 1616,
    "37,49,64,69,73": 1617,
    "37,49,64,71": 1618,
    "37,49,64,71,73": 1619,
    "37,49,65": 1620,
    "37,49,65,66": 1621,
    "37,49,65,68": 1622,
    "37,49,65,68,73": 1623,
    "37,49,65,68,73,77": 1624,
    "37,49,65,68,77": 1625,
    "37,49,65,70,73": 1626,
    "37,49,65,77": 1627,
    "37,49,66": 1628,
    "37,49,66,68": 1629,
    "37,49,66,68,73,78": 1630,
    "37,49,66,69": 1631,
    "37,49,67": 1632,
    "37,49,67,69": 1633,
    "37,49,67,70": 1634,
    "37,49,67,71,77": 1635,
    "37,49,67,71,77,79": 1636,
    "37,49,67,76,79": 1637,
    "37,49,68": 1638,
    "37,49,68,70": 1639,
    "37,49,68,73,77": 1640,
    "37,49,68,73,80": 1641,
    "37,49,68,74,78": 1642,
    "37,49,68,76,80": 1643,
    "37,49,68,77,80": 1644,
    "37,49,69": 1645,
    "37,49,69,76": 1646,
    "37,49,69,77,81": 1647,
    "37,49,69,81": 1648,
    "37,49,70": 1649,
    "37,49,70,73": 1650,
    "37,49,70,79,82": 1651,
    "37,49,71,77,80,83": 1652,
    "37,49,73": 1653,
    "37,49,73,76": 1654,
    "37,49,73,77": 1655,
    "37,49,76": 1656,
    "37,49,76,79": 1657,
    "37,49,76,79,85": 1658,
    "37,49,76,82": 1659,
    "37,49,79": 1660,
    "37,49,79,82": 1661,
    "37,49,81,85,88,93": 1662,
    "37,49,82,88": 1663,
    "37,49,88,91": 1664,
    "37,50,66,68,71,73": 1665,
    "37,51,54,61": 1666,
    "37,51,55,63": 1667,
    "37,52,56": 1668,
    "37,52,56,61": 1669,
    "37,52,57,61,64": 1670,
    "37,52,61,76": 1671,
    "37,53,56": 1672,
    "37,53,56,61": 1673,
    "37,53,56,61,65": 1674,
    "37,53,56,61,68": 1675,
    "37,53,56,68": 1676,
    "37,53,57,61,69": 1677,
    "37,53,61": 1678,
    "37,53,61,65,68": 1679,
    "37,53,61,65,68,69": 1680,
    "37,53,61,65,69": 1681,
    "37,53,61,68": 1682,
    "37,53,61,69": 1683,
    "37,54,58,61": 1684,
    "37,54,58,63": 1685,
    "37,54,58,66": 1686,
    "37,54,61": 1687,
    "37,54,66": 1688,
    "37,55,58,63": 1689,
    "37,56": 1690,
    "37,56,57,65": 1691,
    "37,56,60,63,66,68,80": 1692,
    "37,56,61": 1693,
    "37,56,61,63,73,75": 1694,
    "37,56,61,64": 1695,
    "37,56,61,64,68,80": 1696,
    "37,56,61,65": 1697,
    "37,56,65": 1698,
    "37,56,68": 1699,
    "37,56,72,73,75": 1700,
    "37,57,59,65": 1701,
    "37,57,64,67": 1702,
    "37,57,65": 1703,
    "37,57,67,71": 1704,
    "37,58,61": 1705,
    "37,58,64,66": 1706,
    "37,58,67": 1707,
    "37,59,61,65": 1708,
    "37,59,65": 1709,
    "37,60,61,64,66,68,69": 1710,
    "37,61": 1711,
    "37,61,64,68": 1712,
    "37,61,65": 1713,
    "37,61,65,68": 1714,
    "37,61,73": 1715,
    "37,61,77,78,89,90": 1716,
    "37,63,64,66,68": 1717,
    "37,63,66": 1718,
    "37,64,65,68,71": 1719,
    "37,64,66,68,69": 1720,
    "37,64,67,73": 1721,
    "37,64,67,73,76": 1722,
    "37,64,68": 1723,
    "37,65": 1724,
    "37,65,68,71,73": 1725,
    "37,65,68,71,73,74": 1726,
    "37,65,68,71,74": 1727,
    "37,65,68,73": 1728,
    "37,65,71": 1729,
    "37,65,73": 1730,
    "37,65,77": 1731,
    "37,66": 1732,
    "37,66,69": 1733,
    "37,66,69,73": 1734,
    "37,67,73,76": 1735,
    "37,68": 1736,
    "37,68,71,73,77": 1737,
    "37,68,75,76,78,80,81": 1738,
    "37,68,76,80": 1739,
    "37,68,77": 1740,
    "37,69,73": 1741,
    "37,69,76": 1742,
    "37,70": 1743,
    "37,70,71": 1744,
    "37,73": 1745,
    "37,73,76": 1746,
    "37,73,76,80,85": 1747,
    "37,75,76": 1748,
    "37,77,80": 1749,
    "37,77,89": 1750,
    "38": 1751,
    "38,39,45,48,49,50,54,55,57": 1752,
    "38,39,48,72,79,84": 1753,
    "38,39,50,51,55,67": 1754,
    "38,39,50,51,58,65,67,68,70,71": 1755,
    "38,39,50,51,58,85": 1756,
    "38,39,50,51,63,65,68,71": 1757,
    "38,39,50,51,68,71,75": 1758,
    "38,39,50,51,68,72,75,80": 1759,
    "38,39,55": 1760,
    "38,39,59,65,68": 1761,
    "38,39,60,63,67": 1762,
    "38,39,67,75,79": 1763,
    "38,39,71,72": 1764,
    "38,40": 1765,
    "38,40,42,86": 1766,
    "38,40,45,49,50,52,62,64,69,73,74,76": 1767,
    "38,40,45,50,52,73,74,78,79,85,86": 1768,
    "38,40,49,50": 1769,
    "38,40,50,52": 1770,
    "38,40,50,52,57,62,66,67,69": 1771,
    "38,40,50,52,68,74,76": 1772,
    "38,40,50,67,69,71,74": 1773,
    "38,40,54,66": 1774,
    "38,40,57,59,64": 1775,
    "38,40,62,65,69": 1776,
    "38,40,62,71,72,74,76": 1777,
    "38,40,64,67,73": 1778,
    "38,40,71,74,78,83": 1779,
    "38,41,45": 1780,
    "38,41,45,50,77,81,86,89": 1781,
    "38,41,45,57": 1782,
    "38,41,45,57,62": 1783,
    "38,41,45,62": 1784,
    "38,41,45,65": 1785,
    "38,41,45,65,67": 1786,
    "38,41,46,49,58,59,70,71": 1787,
    "38,41,50,53,58": 1788,
    "38,41,50,57,62,74,77,81,86": 1789,
    "38,41,72,77,80,84": 1790,
    "38,41,86,89": 1791,
    "38,42,45,50,57,62,74,78,81,86": 1792,
    "38,42,45,50,74,78,81,86": 1793,
    "38,42,50,54,57,64,66": 1794,
    "38,42,50,54,62,66,69": 1795,
    "38,42,50,57,62,74,78,81,86": 1796,
    "38,42,57,66": 1797,
    "38,42,58,63,66": 1798,
    "38,42,61,66,69,74": 1799,
    "38,43,50,55,71,72,78,79,83,84": 1800,
    "38,43,50,55,77,79,83,86,91": 1801,
    "38,43,55,62": 1802,
    "38,43,59,62": 1803,
    "38,43,59,62,69": 1804,
    "38,43,62,67": 1805,
    "38,44,45,76,77,83": 1806,
    "38,44,47,74,77,83": 1807,
    "38,44,77,83": 1808,
    "38,45,47,74,76,83": 1809,
    "38,45,48,50,54,57": 1810,
    "38,45,50,53,57,65": 1811,
    "38,45,50,53,57,65,69": 1812,
    "38,45,50,54,57,62": 1813,
    "38,45,50,54,57,62,66": 1814,
    "38,45,50,54,62": 1815,
    "38,45,50,57,66,67": 1816,
    "38,45,50,57,72,78,79,84": 1817,
    "38,45,50,62,66,74": 1818,
    "38,45,50,65,74,77": 1819,
    "38,45,50,66,69,74,78": 1820,
    "38,45,50,66,69,78": 1821,
    "38,45,50,66,74,78": 1822,
    "38,45,50,69,74,77,81": 1823,
    "38,45,50,74,77,81,86": 1824,
    "38,45,50,74,78,86": 1825,
    "38,45,50,77,81,86,89": 1826,
    "38,45,52,69,73,79,81": 1827,
    "38,45,52,73,79,81,85": 1828,
    "38,45,53,77": 1829,
    "38,45,53,77,79": 1830,
    "38,45,54,62": 1831,
    "38,45,57,62,66": 1832,
    "38,45,57,65": 1833,
    "38,45,57,65,69": 1834,
    "38,45,57,66,69": 1835,
    "38,45,60,62": 1836,
    "38,45,60,62,64": 1837,
    "38,45,60,62,66": 1838,
