{
  "token_to_id": {
    "22,34,46,50,53,58,62,70,77,82": 1,
    "22,34,46,53,58,62,82,86": 2,
    "22,34,70,74": 3,
    "22,51,57,60": 4,
    "24,36": 5,
    "24,36,48": 6,
    "24,36,48,50,52,55,60,62": 7,
    "24,36,48,52,55,60": 8,
    "24,36,48,60": 9,
    "24,36,48,69,81": 10,
    "24,36,55,60,64": 11,
    "25,37,56,61,65,68": 12,
    "26,27,38,39,51": 13,
    "26,33,38,89,93,101": 14,
    "26,38": 15,
    "26,38,50,62": 16,
    "26,38,57,60,65": 17,
    "26,38,57,66,69": 18,
    "26,38,76,77,84,88,89": 19,
    "26,38,79,84,91": 20,
    "27,30,66,69,73": 21,
    "27,39,46,55,58": 22,
    "27,39,51": 23,
    "27,39,51,54,58,63,66,70,75,78,82": 24,
    "27,39,63,67,70,75": 25,
    "27,39,75,77,87,89": 26,
    "27,39,75,87": 27,
    "28": 28,
    "28,29,40,41,62,63,68,69,74": 29,
    "28,32,83,86": 30,
    "28,33,40,45,59,60,68,71": 31,
    "28,35,40,47,63,66,69": 32,
    "28,35,52,64": 33,
    "28,35,80,81,88,90,92,93": 34,
    "28,35,83,92,95": 35,
    "28,40": 36,
    "28,40,45,48,52,53,55,57": 37,
    "28,40,45,52,53,55,57,60,69": 38,
    "28,40,47,56,59,64,68": 39,
    "28,40,52": 40,
    "28,40,52,55": 41,
    "28,40,52,59,64,68,69": 42,
    "28,40,52,75,87": 43,
    "28,40,56,59,64": 44,
    "28,40,56,64,71": 45,
    "28,40,57,60,64": 46,
    "28,40,57,63,66,71": 47,
    "28,40,59,68,71": 48,
    "28,40,62,68,74": 49,
    "28,40,64,66,69": 50,
    "28,40,64,69": 51,
    "28,40,66,69": 52,
    "28,40,78,79,87,88,90,91": 53,
    "28,40,78,87,90": 54,
    "28,40,80,81,88,90,92,93": 55,
    "28,40,83,84,91,93,95,96": 56,
    "28,40,83,86,92,95": 57,
    "28,40,83,91,95": 58,
    "28,51,53,57,60": 59,
    "28,52,64": 60,
    "28,52,64,76,80,88": 61,
    "28,57,59,66": 62,
    "28,78,87,90": 63,
    "28,80": 64,
    "28,80,88,92": 65,
    "28,81,90,93": 66,
    "28,83": 67,
    "28,83,92,95": 68,
    "28,85,93,97": 69,
    "28,88,92,95,100": 70,
    "29": 71,
    "29,30,41,42,54": 72,
    "29,33,53,57": 73,
    "29,36,41,43,60,70,73,76,79": 74,
    "29,36,69,70,72,74": 75,
    "29,38,41,86,93,98": 76,
    "29,41": 77,
    "29,41,43,52,65,67,72,77": 78,
    "29,41,53,63,69,72,74": 79,
    "29,41,57,60,62": 80,
    "29,41,60,69,75": 81,
    "29,41,62,68,71": 82,
    "29,41,62,68,71,72": 83,
    "29,41,62,68,72": 84,
    "29,41,63,69,72": 85,
    "29,41,63,69,74": 86,
    "29,41,64,69,73,76": 87,
    "29,41,64,69,74,76,77": 88,
    "29,41,64,69,74,77,79": 89,
    "29,41,64,70,73,79": 90,
    "29,41,64,79": 91,
    "29,41,65,68,73": 92,
    "29,41,65,68,73,77": 93,
    "29,41,65,68,75": 94,
    "29,41,65,68,77": 95,
    "29,41,65,69,73,74,76": 96,
    "29,41,65,69,74": 97,
    "29,41,65,69,74,77": 98,
    "29,41,65,70,73,76,77": 99,
    "29,41,65,74,77": 100,
    "29,41,65,75": 101,
    "29,41,65,77": 102,
    "29,41,67,69,74,76": 103,
    "29,41,67,70,73,76": 104,
    "29,41,67,76": 105,
    "29,41,69,73,76": 106,
    "29,41,69,74,77": 107,
    "29,41,70,73,76": 108,
    "29,41,70,73,79": 109,
    "29,41,81,84,89,93": 110,
    "29,41,85,92,97": 111,
    "29,51,57,60": 112,
    "29,53,57,61": 113,
    "29,54,57,63": 114,
    "29,57,60,62": 115,
    "29,57,60,63": 116,
    "29,60": 117,
    "29,60,64": 118,
    "29,63,69": 119,
    "29,64": 120,
    "29,65,69": 121,
    "29,69,75": 122,
    "29,75,77": 123,
    "29,81,84,89,93": 124,
    "30,31,38,42,43,79,81,84,86,91,93": 125,
    "30,31,38,42,43,81,84,86,93": 126,
    "30,33,42,45,60,61,66,68,69,71": 127,
    "30,33,54,57": 128,
    "30,33,57,61,66": 129,
    "30,33,66,69,73": 130,
    "30,35,42,47,61,62,66,69": 131,
    "30,35,42,47,61,62,69,73": 132,
    "30,35,42,57,58,63,64,66,69": 133,
    "30,37,42,49,58,64,65,66": 134,
    "30,37,42,49,65,68,71": 135,
    "30,38,42,81,84,86,93": 136,
    "30,42": 137,
    "30,42,47,54,57,61,63,69,73": 138,
    "30,42,50,54,59": 139,
    "30,42,54": 140,
    "30,42,54,56,60,63,68,84,87,92,96": 141,
    "30,42,54,61,66,69,71": 142,
    "30,42,58,64,65": 143,
    "30,42,58,64,65,66": 144,
    "30,42,58,64,66": 145,
    "30,42,60,69,75": 146,
    "30,42,61,66,69": 147,
    "30,42,61,69,73": 148,
    "30,42,62,69,74": 149,
    "30,42,66,68,71": 150,
    "30,42,66,71": 151,
    "30,42,68,71": 152,
    "30,42,78,90": 153,
    "30,65,70": 154,
    "30,70,77": 155,
    "30,72,77": 156,
    "31": 157,
    "31,32,38,43,44,78,79,84,86,90,91": 158,
    "31,33,38,43,45,71,72,74,78,79": 159,
    "31,35,38,43,67,71,74,79": 160,
    "31,35,55,59": 161,
    "31,36,39,43,79,84,87,91": 162,
    "31,36,64,65,71,72": 163,
    "31,38,43,62,71,74,79": 164,
    "31,38,43,71,79": 165,
    "31,38,43,79,84,86,91": 166,
    "31,38,55,59,65": 167,
    "31,38,65,66,71,74": 168,
    "31,43": 169,
    "31,43,47,50,55,62,67,71,74,79": 170,
    "31,43,47,50,55,62,67,71,74,79,83": 171,
    "31,43,48,55,60": 172,
    "31,43,48,55,60,63": 173,
    "31,43,50,53,55,59,65,77": 174,
    "31,43,54,55,66,67": 175,
    "31,43,55": 176,
    "31,43,55,59,62": 177,
    "31,43,55,62,67": 178,
    "31,43,55,67": 179,
    "31,43,58,62,67,70": 180,
    "31,43,59,62,67": 181,
    "31,43,60,63,66,72": 182,
    "31,43,67,71,74,77,79": 183,
    "31,43,67,72,76,79": 184,
    "31,43,67,74,77,79": 185,
    "31,43,67,79": 186,
    "31,43,76,77,83,88": 187,
    "31,43,84,88,91,96": 188,
    "31,45,48,52,57,67,72,76,79": 189,
    "31,48,74,75,79,83,84": 190,
    "31,50,59,62": 191,
    "31,50,75,77,80,84,86": 192,
    "31,53,59,62": 193,
    "31,55,59,62": 194,
    "31,60,64": 195,
    "31,65,68,72": 196,
    "31,65,71": 197,
    "31,67,79": 198,
    "31,68,72": 199,
    "31,68,72,75": 200,
    "31,71,74": 201,
    "31,72,75": 202,
    "31,74,77,80": 203,
    "31,75,79,84": 204,
    "31,77,80": 205,
    "31,77,80,86": 206,
    "31,82,86,91": 207,
    "32,33,81,83,84,86": 208,
    "32,35,44,47,62,63,69,71,73": 209,
    "32,36,44,48,50,60,62": 210,
    "32,36,44,48,60": 211,
    "32,36,44,50,51,56,60,62,63,72,75": 212,
    "32,36,44,50,60,62": 213,
    "32,37,44,49,63,64,68,69,71": 214,
    "32,37,54,60,63": 215,
    "32,38,44,78,84,86,90": 216,
    "32,39": 217,
    "32,39,44,51,67,68,70,72,75,79,80": 218,
    "32,39,44,71,75,80,83": 219,
    "32,39,44,80,83,87,92": 220,
    "32,44,51,56,60": 221,
    "32,44,56,60,63,68": 222,
    "32,44,56,68": 223,
    "32,44,59,68,71": 224,
    "32,44,60,63,68,72": 225,
    "32,44,61,62": 226,
    "32,44,62,68,72": 227,
    "32,44,63,69,71": 228,
    "32,44,65,72,75": 229,
    "32,44,65,72,75,77": 230,
    "32,44,67,76,79": 231,
    "32,44,68,72,75,80": 232,
    "32,44,68,75,80,84": 233,
    "32,44,75,83,87": 234,
    "32,44,80,88,92": 235,
    "32,44,83,87,92,95": 236,
    "32,51,56,59": 237,
    "32,54,56,60,63,65": 238,
    "32,54,60,63": 239,
    "32,56,60,65": 240,
    "32,66,72": 241,
    "32,72,78": 242,
    "32,73,78": 243,
    "32,83,86": 244,
    "33": 245,
    "33,35,45,47,72,74,84,86": 246,
    "33,36,40,45,72,76,81,84,88": 247,
    "33,36,45,74,78,84,86": 248,
    "33,36,45,74,86": 249,
    "33,36,52,57,64": 250,
    "33,36,57,60": 251,
    "33,36,78,81,84": 252,
    "33,37,66,69,73": 253,
    "33,38,45,72,74,76,78": 254,
    "33,38,45,72,74,78": 255,
    "33,38,45,72,74,78,79": 256,
    "33,38,54,57,60,62": 257,
    "33,40,45,85,88,93,97": 258,
    "33,40,52,59,68,69,71,72": 259,
    "33,40,64,65,67,69": 260,
    "33,40,76,84,88": 261,
    "33,40,76,85,88": 262,
    "33,45": 263,
    "33,45,50,65,69,72,74": 264,
    "33,45,52,55,64,67,71,74": 265,
    "33,45,52,57,60": 266,
    "33,45,53,62,66,68,69,71": 267,
    "33,45,57,61,69": 268,
    "33,45,60,64,67,71,74": 269,
    "33,45,60,68,71": 270,
    "33,45,62,66,68,69,71": 271,
    "33,45,64,65,67,69": 272,
    "33,45,64,67,71,74": 273,
    "33,45,65,69,71,72,74": 274,
    "33,45,66,69": 275,
    "33,45,67,71,74,77,79": 276,
    "33,45,69,72": 277,
    "33,45,69,76,79,81": 278,
    "33,45,72,75,78,84": 279,
    "33,45,72,84": 280,
    "33,45,77,84,89": 281,
    "33,48,52,55,60,69,76,79,81": 282,
    "33,49,57": 283,
    "33,49,61": 284,
    "33,52,57,64": 285,
    "33,52,57,64,69,72": 286,
    "33,52,59": 287,
    "33,60": 288,
    "33,60,64": 289,
    "33,61,64": 290,
    "33,64": 291,
    "33,66,69": 292,
    "33,69,72": 293,
    "33,69,73": 294,
    "33,69,73,81": 295,
    "33,76,79,85,88": 296,
    "33,81,84": 297,
    "34,36,46,48,62,63,70,74,75": 298,
    "34,38,41,46,70,74,77,82": 299,
    "34,39,42,46,75,78,82,87": 300,
    "34,39,42,46,82,87,90,94": 301,
    "34,39,46,51,62,63,65,67,70,74,75": 302,
    "34,39,46,51,65,67,68,70,74,75,77,79": 303,
    "34,39,46,51,65,67,70,74,75,77,79": 304,
    "34,39,46,63,70,75": 305,
    "34,41,46,50,58": 306,
    "34,41,46,53,67,69,72,74,75,77": 307,
    "34,41,49,82,94": 308,
    "34,46": 309,
    "34,46,53,58,62": 310,
    "34,46,53,58,62,70,74,77,82": 311,
    "34,46,56,58,62,65,70": 312,
    "34,46,56,62,65,70": 313,
    "34,46,62,65,70,74": 314,
    "34,46,62,70,74": 315,
    "34,46,65,68,74,77": 316,
    "34,46,65,70,74,77": 317,
    "34,46,65,74,77": 318,
    "34,46,66,75,78": 319,
    "34,46,70,82": 320,
    "34,46,80,86,89,92": 321,
    "34,51,57,60": 322,
    "34,68,74": 323,
    "34,73": 324,
    "34,73,76": 325,
    "34,74,80": 326,
    "34,76,79": 327,
    "34,77,80": 328,
    "34,77,89": 329,
    "35": 330,
    "35,36,47,48,56,57,64,68": 331,
    "35,36,47,48,78,81,87,88": 332,
    "35,36,48,66,69,78": 333,
    "35,36,48,78,81,90": 334,
    "35,36,52,57,64": 335,
    "35,38,59,62": 336,
    "35,39,42,47,75,78,83,87": 337,
    "35,39,47,51,57": 338,
    "35,39,47,63,71,75": 339,
    "35,39,47,66,71,75,78": 340,
    "35,39,78,87,90": 341,
    "35,40": 342,
    "35,40,47,52,56,64,68": 343,
    "35,40,56,59,61": 344,
    "35,40,64,68,76": 345,
    "35,40,76,78,85,87,88,90": 346,
    "35,40,76,80,88": 347,
    "35,40,83,92,95": 348,
    "35,41,60,63,68": 349,
    "35,42": 350,
    "35,42,47,54,75,76,82,83,85,87,90": 351,
    "35,42,47,54,76,82,85,90": 352,
    "35,42,59,63,66": 353,
    "35,42,63": 354,
    "35,42,79,81,88,90,91,93": 355,
    "35,42,81,90,93": 356,
    "35,43,81,83,90,91,93,95": 357,
    "35,43,83,91,95": 358,
    "35,44,66,71,75": 359,
    "35,47": 360,
    "35,47,52,58,63,67,79": 361,
    "35,47,54,57,63,64,66": 362,
    "35,47,54,59,63": 363,
    "35,47,54,63,66": 364,
    "35,47,56,61,63": 365,
    "35,47,56,64,68": 366,
    "35,47,57,63,66,71": 367,
    "35,47,59": 368,
    "35,47,59,68,71": 369,
    "35,47,62,63,66,69": 370,
    "35,47,62,66,69": 371,
    "35,47,62,67,74": 372,
    "35,47,62,69,73": 373,
    "35,47,63,66,69": 374,
    "35,47,67,71,74,77,79": 375,
    "35,47,69,72,75": 376,
    "35,47,71": 377,
    "35,47,74,79,86": 378,
    "35,47,74,86": 379,
    "35,47,75,83,87": 380,
    "35,47,76,78,85,87,88,90": 381,
    "35,47,76,82,85,90": 382,
    "35,47,77,84,89": 383,
    "35,47,78,79,87,88,90,91": 384,
    "35,47,78,81,87": 385,
    "35,47,78,90": 386,
    "35,47,79,81,88,90,91,93": 387,
    "35,47,79,83": 388,
    "35,47,79,87,91": 389,
    "35,47,80,86,89,92": 390,
    "35,47,81,93": 391,
    "35,47,83,87,95": 392,
    "35,47,83,91,95": 393,
    "35,48,60,66,69,78": 394,
    "35,48,63,66,69": 395,
    "35,48,65,67,69,71": 396,
    "35,48,78,81,83,91,95": 397,
    "35,50,62": 398,
    "35,51,54,59": 399,
    "35,51,66,71,73": 400,
    "35,52,57": 401,
    "35,52,60,68": 402,
    "35,54": 403,
    "35,55,79,83": 404,
    "35,57,63": 405,
    "35,57,63,66": 406,
    "35,57,63,66,69": 407,
    "35,57,63,69": 408,
    "35,59,63,66": 409,
    "35,59,66,71": 410,
    "35,60,64": 411,
    "35,60,68,72": 412,
    "35,61,68,73": 413,
    "35,63,64,72": 414,
    "35,63,69": 415,
    "35,63,69,75": 416,
    "35,64,68,71": 417,
    "35,64,70,76": 418,
    "35,66,69,76": 419,
    "35,66,70,73": 420,
    "35,66,70,78": 421,
    "35,69,75": 422,
    "35,75,78": 423,
    "35,78,81,90": 424,
    "35,78,87,90": 425,
    "35,79,83": 426,
    "35,79,88,91": 427,
    "35,80,88,92": 428,
    "35,81,83,90,92,93,95": 429,
    "35,81,90,93": 430,
    "35,83": 431,
    "35,83,91,95": 432,
    "35,83,92,95": 433,
    "35,86,90,98": 434,
    "36": 435,
    "36,37,48,49,57,58,64,66,68": 436,
    "36,38": 437,
    "36,38,41,45,53,57,62,65,69": 438,
    "36,38,41,48,60,62,65,72": 439,
    "36,38,41,53,62,65": 440,
    "36,38,43,48,50,52,53,58,60,64,65": 441,
    "36,38,43,48,50,52,53,60,64,65": 442,
    "36,38,45,55,57,60,64": 443,
    "36,38,54,57,60,64": 444,
    "36,39,44,54,63,66": 445,
    "36,39,45,57,63,69": 446,
    "36,39,48,63,72,75": 447,
    "36,39,57,69": 448,
    "36,40,45,47,71,72,80,81,83,84": 449,
    "36,40,52,56,57,59,64": 450,
    "36,40,60,64": 451,
    "36,40,64,68,72,76": 452,
    "36,40,78,79,81,83": 453,
    "36,41,43,45,46,57,58,65,67,69,70": 454,
    "36,41,45,48,60,65,69,72": 455,
    "36,41,45,48,72,77,81,84": 456,
    "36,41,45,57,65,69": 457,
    "36,41,48,53,65,67,68,72,75,77,79": 458,
    "36,41,65,69": 459,
    "36,43": 460,
    "36,43,44,51,54,55,60": 461,
    "36,43,46,48,50,55,60,62,63,67,70,72,74": 462,
    "36,43,46,58,67,70": 463,
    "36,43,47,50,55,67,71,72,74,79,84": 464,
    "36,43,48,50,51,55,62,63": 465,
    "36,43,48,50,55,62,64,67,74,76": 466,
    "36,43,48,50,55,74,76,79,86,88": 467,
    "36,43,48,51,55,60": 468,
    "36,43,48,51,55,63": 469,
    "36,43,48,51,60,63": 470,
    "36,43,48,52,55,60": 471,
    "36,43,48,52,55,60,64,72,76,79,84": 472,
    "36,43,48,52,58,60,64": 473,
    "36,43,48,52,60,64": 474,
    "36,43,48,58,68,70": 475,
    "36,43,48,60,64,72": 476,
    "36,43,48,64,67,76": 477,
    "36,43,48,64,72,76": 478,
    "36,43,48,67,72,79": 479,
    "36,43,48,72,76,79,84": 480,
    "36,43,48,72,84": 481,
    "36,43,48,76,79,88": 482,
    "36,43,48,82,88,91,94": 483,
    "36,43,50,53,60": 484,
    "36,43,50,55,62": 485,
    "36,43,51,55": 486,
    "36,43,51,55,60": 487,
    "36,43,51,67,75,79": 488,
    "36,43,52,60,67,72": 489,
    "36,43,52,72,79,84": 490,
    "36,43,52,79,84,91": 491,
    "36,43,53,57,60": 492,
    "36,43,55,58,60": 493,
    "36,43,55,60,63": 494,
    "36,43,55,60,64": 495,
    "36,43,55,62,64,65": 496,
    "36,43,55,62,65": 497,
    "36,43,55,62,69,71": 498,
    "36,43,55,62,71": 499,
    "36,43,55,63,65,66": 500,
    "36,43,55,63,66": 501,
    "36,43,55,64": 502,
    "36,43,55,64,66,67": 503,
    "36,43,55,64,67": 504,
    "36,43,55,64,71,72": 505,
    "36,43,55,65,67,69": 506,
    "36,43,55,65,69": 507,
    "36,43,55,67": 508,
    "36,43,58": 509,
    "36,43,60,62,64,65": 510,
    "36,43,60,63": 511,
    "36,43,60,64": 512,
    "36,43,60,64,72": 513,
    "36,43,60,65,72,74": 514,
    "36,43,60,65,74": 515,
    "36,43,60,67,74,76": 516,
    "36,43,60,67,76": 517,
    "36,43,62": 518,
    "36,43,62,65": 519,
    "36,43,64,65,67,69": 520,
    "36,43,67,69,71,72": 521,
    "36,43,67,76": 522,
    "36,43,71,72,74,76": 523,
    "36,43,72,76,84": 524,
    "36,43,74,76,77,79": 525,
    "36,43,82,91,94": 526,
    "36,44,48,60,68,72": 527,
    "36,44,48,72,80,84": 528,
    "36,44,51,54,60": 529,
    "36,45,48,65,72,77": 530,
    "36,45,64,67,72,73": 531,
    "36,45,64,68,72,76": 532,
    "36,45,72,81,84": 533,
    "36,46,48,60,67,70,72": 534,
    "36,46,51,57,60": 535,
    "36,46,67": 536,
    "36,48": 537,
    "36,48,50,53,60": 538,
    "36,48,51,60": 539,
    "36,48,55": 540,
    "36,48,55,60,64": 541,
    "36,48,55,63,67": 542,
    "36,48,55,70,80,82": 543,
    "36,48,57,64,68": 544,
    "36,48,60": 545,
    "36,48,60,63,67,72": 546,
    "36,48,60,64": 547,
    "36,48,60,64,72,76,84": 548,
    "36,48,60,72": 549,
    "36,48,63,67,72,75": 550,
    "36,48,63,70,75": 551,
    "36,48,64,65,67,69": 552,
    "36,48,64,67": 553,
    "36,48,64,67,72,76": 554,
    "36,48,64,67,76": 555,
    "36,48,65,77": 556,
    "36,48,66,69,75,76": 557,
    "36,48,66,69,76": 558,
    "36,48,66,69,76,78": 559,
    "36,48,66,69,78": 560,
    "36,48,67,69,71,72": 561,
    "36,48,67,71,76,79,84,88": 562,
    "36,48,67,72,75,79": 563,
    "36,48,67,72,79": 564,
    "36,48,69,75,78,81": 565,
    "36,48,69,81": 566,
    "36,48,71,74,76,79,84,88": 567,
    "36,48,71,83": 568,
    "36,48,72,79,83,84": 569,
    "36,48,72,84": 570,
    "36,48,74,84,86": 571,
    "36,48,75,79,87": 572,
    "36,48,75,84,87": 573,
    "36,48,76,84,88": 574,
    "36,48,77,79,86,88,89,91": 575,
    "36,48,77,84,89": 576,
    "36,48,78,81,88": 577,
    "36,48,78,81,88,90": 578,
    "36,48,78,81,90": 579,
    "36,48,79,84,88,91": 580,
    "36,50,51,55,62,67,74,75,79": 581,
    "36,51,55,60": 582,
    "36,52,57": 583,
    "36,52,57,64": 584,
    "36,52,60": 585,
    "36,52,64": 586,
    "36,55,60,64": 587,
    "36,55,64,67": 588,
    "36,60": 589,
    "36,60,64": 590,
    "36,60,64,72": 591,
    "36,60,69,72,81,84": 592,
    "36,60,72": 593,
    "36,63,70": 594,
    "36,64,67": 595,
    "36,64,68,72,76": 596,
    "36,64,72": 597,
    "36,65,69": 598,
    "36,67,70": 599,
    "36,67,71": 600,
    "36,67,71,74,77,79,83,89,91": 601,
    "36,67,72,76": 602,
    "36,67,77,79": 603,
    "36,69,72": 604,
    "36,70,75": 605,
    "36,70,76": 606,
    "36,72,76": 607,
    "36,72,76,79,84": 608,
    "36,72,76,84": 609,
    "36,74,78": 610,
    "36,75,77": 611,
    "36,76,84,88": 612,
    "36,78,81": 613,
    "36,82,91,94": 614,
    "37,39,49,51,63,73,75": 615,
    "37,39,49,63,73,75": 616,
    "37,41,44,49,73,77,80,85": 617,
    "37,42,66,69,73": 618,
    "37,43,53,61": 619,
    "37,44,49,53,61": 620,
    "37,44,53,61,65": 621,
    "37,44,53,63,65": 622,
    "37,44,58,59": 623,
    "37,45,73,81,85": 624,
    "37,49": 625,
    "37,49,53,61,65": 626,
    "37,49,56,58,65": 627,
    "37,49,58,64,66": 628,
    "37,49,61,64,68": 629,
    "37,49,61,64,73": 630,
    "37,49,61,73": 631,
    "37,49,64,65,68,71": 632,
    "37,49,64,68,71": 633,
    "37,49,65,68,71": 634,
    "37,49,69,76,79,81": 635,
    "37,49,70,79,82": 636,
    "37,49,73,85": 637,
    "37,52,64": 638,
    "37,53,54,60,61,63": 639,
    "37,53,61": 640,
    "37,54,58,61,66,70,78,82,90": 641,
    "37,54,60,63": 642,
    "37,56,59,64": 643,
    "37,58,65,70": 644,
    "37,59": 645,
    "37,65,70": 646,
    "37,65,71": 647,
    "37,65,72": 648,
    "37,67,75,79": 649,
    "37,69": 650,
    "37,69,78,81": 651,
    "37,70,72": 652,
    "37,71,77": 653,
    "37,72,77": 654,
    "37,77,78": 655,
    "37,78,82,90": 656,
    "37,86,90,98": 657,
    "38": 658,
    "38,39,50,63,74,75": 659,
    "38,40,41,43,53,55,62,64,65,67": 660,
    "38,40,45,55,57,60,64": 661,
    "38,40,45,67,69,72": 662,
    "38,40,45,76,79,81": 663,
    "38,40,45,84,88,91": 664,
    "38,40,45,91,93,96,100": 665,
    "38,40,50": 666,
    "38,41": 667,
    "38,41,45,50,69,74,77,81": 668,
    "38,41,45,50,69,81": 669,
    "38,42,50,54,60": 670,
    "38,42,62,66": 671,
    "38,43,53,55": 672,
    "38,45,55,57,60,64": 673,
    "38,45,57,64,73,74,76,77": 674,
    "38,45,66,67,73,74": 675,
    "38,45,91,93,96,100": 676,
    "38,46,50,65,67,70,77,79": 677,
    "38,46,50,65,70,77": 678,
    "38,50": 679,
    "38,50,53,60,65": 680,
    "38,50,54,62,66": 681,
    "38,50,55,59,62,66,67,68,71": 682,
    "38,50,57,60,69,72,76,79": 683,
    "38,50,59,65,67,71": 684,
    "38,50,59,65,71": 685,
    "38,50,60,66,69": 686,
    "38,50,62": 687,
    "38,50,62,66,74": 688,
    "38,50,65,70,77": 689,
    "38,50,69,72,76,79": 690,
    "38,50,71": 691,
    "38,50,74,77": 692,
    "38,50,77,89": 693,
    "38,50,79,84,91": 694,
    "38,52,56,59,64": 695,
    "38,53,62": 696,
    "38,53,65": 697,
    "38,57,64": 698,
    "38,57,88": 699,
    "38,59,66,68": 700,
    "38,60,64": 701,
    "38,60,64,72": 702,
    "38,62,66": 703,
    "38,65,77": 704,
    "38,66,69,78": 705,
    "38,66,74": 706,
    "38,67,71": 707,
    "38,68": 708,
    "38,69,72,76": 709,
    "38,69,76": 710,
    "38,72,79": 711,
    "38,74,77": 712,
    "38,74,77,81,86": 713,
    "38,77,81,86,89": 714,
    "38,81,84,93": 715,
    "38,82,86": 716,
    "38,83,90,95": 717,
    "39": 718,
    "39,41,44,48,56,60,65,68,72": 719,
    "39,41,44,56,65,68": 720,
    "39,43,48,67,72,75": 721,
    "39,43,48,67,75": 722,
    "39,43,48,72,75": 723,
    "39,43,55": 724,
    "39,44,46,48,49,60,61,68,70,72,73": 725,
    "39,44,47,51,53": 726,
    "39,44,48,60,68,72": 727,
    "39,44,51,56,67,68,70,72,75,79,80": 728,
    "39,45,48,51,66,69,72,78": 729,
    "39,46,49,61,70,73": 730,
    "39,46,50,56,63,66,78": 731,
    "39,46,51,56,60,63,67,68,70,72,75": 732,
    "39,46,51,58,67": 733,
    "39,46,51,63,67,70,75": 734,
    "39,46,51,66,70,75,78": 735,
    "39,46,51,67,70,75,79": 736,
    "39,46,51,67,70,79": 737,
    "39,46,55,58": 738,
    "39,47,51,55,59,63": 739,
    "39,47,51,56,59,68": 740,
    "39,48,60,63,67": 741,
    "39,48,60,67": 742,
    "39,49,51,55,61,63": 743,
    "39,49,60,63,67": 744,
    "39,51,55,60,67": 745,
    "39,51,55,63,65,67,75": 746,
    "39,51,55,63,68,70,75": 747,
    "39,51,55,63,72,74,75": 748,
    "39,51,56,60,63,67,68,70,72,75,79,80": 749,
    "39,51,58,62,63,70,72,74,75": 750,
    "39,51,58,67,70,72,75,79": 751,
    "39,51,58,67,70,75,79,82": 752,
    "39,51,59,66,69": 753,
    "39,51,59,68,71": 754,
    "39,51,61,67,73": 755,
    "39,51,63": 756,
    "39,51,63,67,70,75": 757,
    "39,51,63,72,75": 758,
    "39,51,63,75": 759,
    "39,51,67,70,75,79": 760,
    "39,51,67,70,79": 761,
    "39,51,72,79,84": 762,
    "39,51,81,84,93": 763,
    "39,54,58": 764,
    "39,55,63,67": 765,
    "39,55,63,74,75": 766,
    "39,57,66,69": 767,
    "39,59,68": 768,
    "39,60,66": 769,
    "39,63,67": 770,
    "39,65,73,77": 771,
    "39,66,71": 772,
    "39,66,72": 773,
    "39,68": 774,
    "39,69,73,79,81": 775,
    "39,70": 776,
    "39,70,71": 777,
    "39,70,72": 778,
    "39,72,73": 779,
    "39,73,78": 780,
    "39,73,79": 781,
    "39,78,80": 782,
    "40": 783,
    "40,41,46,53,58,62,70": 784,
    "40,41,48,53,58,60,65": 785,
    "40,41,48,55,60,64,72": 786,
    "40,41,49,53,56,65,68": 787,
    "40,41,50,53,58": 788,
    "40,41,50,53,58,65,70": 789,
    "40,41,53,56,61": 790,
    "40,42,70,73,78": 791,
    "40,43,54,56,59": 792,
    "40,43,73,76": 793,
    "40,44,47,52,68,71,76,80": 794,
    "40,44,47,52,71,76,80,83": 795,
    "40,44,64,68,72,76": 796,
    "40,45,47,52,66,68,76,78,80": 797,
    "40,45,49,52,66,69,76,78,81": 798,
    "40,45,51,64,66,68,69": 799,
    "40,45,52,66,76,78": 800,
    "40,45,61,64": 801,
    "40,45,65,67,69,71": 802,
    "40,46,49,52,82,85,91,94": 803,
    "40,46,52,60,67,70,72": 804,
    "40,46,53,58,62,70": 805,
    "40,47": 806,
    "40,47,48,52,64,71,72,76,80,83": 807,
    "40,47,49,52,68,69,76,80,81": 808,
    "40,47,52,54,57,64,66,71,75,76,78,83": 809,
    "40,47,52,55,64": 810,
    "40,47,52,64,68": 811,
    "40,47,52,68,76,80": 812,
    "40,47,55,59": 813,
    "40,47,55,64": 814,
    "40,47,56,59,64,68": 815,
    "40,47,56,64": 816,
    "40,47,56,71,76,80,83": 817,
    "40,47,56,71,76,80,83,88": 818,
    "40,47,56,71,76,83": 819,
    "40,47,64,68": 820,
    "40,47,64,68,76": 821,
    "40,47,71,80,83": 822,
    "40,47,76,78,85,87,88,90": 823,
    "40,47,79,83": 824,
    "40,48,52,55,57,60,67,69": 825,
    "40,48,52,55,60,67": 826,
    "40,48,52,60,69,72": 827,
    "40,48,55,60,64,72": 828,
    "40,49,52,69,76,81": 829,
    "40,49,57,73,76,85": 830,
    "40,49,61,62,64,66": 831,
    "40,50,53,58,65,70": 832,
    "40,50,56,59": 833,
    "40,50,59,62,65,68": 834,
    "40,50,62,65,68,71": 835,
    "40,50,62,67,71": 836,
    "40,50,65,68,71,74,77": 837,
    "40,50,71,74,80,83": 838,
    "40,51,60,67,69,72,78,79,81": 839,
    "40,51,64,66,68,69": 840,
    "40,52": 841,
    "40,52,53,57,69,77,81": 842,
    "40,52,56": 843,
    "40,52,56,59": 844,
    "40,52,56,59,64": 845,
    "40,52,56,59,68": 846,
    "40,52,56,68": 847,
    "40,52,59,64,68,71": 848,
    "40,52,59,68": 849,
    "40,52,59,68,71": 850,
    "40,52,60,64,67,72": 851,
    "40,52,60,64,72": 852,
    "40,52,60,66,68": 853,
    "40,52,64,76": 854,
    "40,52,67,69,73,79": 855,
    "40,52,67,72,79": 856,
    "40,52,67,79": 857,
    "40,52,68,76,80": 858,
    "40,52,71,83": 859,
    "40,52,73,85": 860,
    "40,52,76,88": 861,
    "40,52,80,83,92": 862,
    "40,53,56,61": 863,
    "40,55,62,67,71": 864,
    "40,55,67": 865,
    "40,55,79,83": 866,
    "40,56,59": 867,
    "40,57,59,66": 868,
    "40,60,64,67,72": 869,
    "40,60,64,72": 870,
    "40,62,65": 871,
    "40,62,67,71": 872,
    "40,64,68": 873,
    "40,64,68,76": 874,
    "40,64,76": 875,
    "40,67": 876,
    "40,67,71": 877,
    "40,67,72,79": 878,
    "40,71,74,77,81": 879,
    "40,71,74,83": 880,
    "40,71,83": 881,
    "40,72": 882,
    "40,73,75,76,78": 883,
    "40,73,76": 884,
    "40,73,80": 885,
    "40,75,78": 886,
    "40,76,79": 887,
    "40,76,80,88": 888,
    "40,76,85,88": 889,
    "40,76,88": 890,
    "40,78,81": 891,
    "40,78,87,90": 892,
    "40,79,83": 893,
    "40,80,88,92": 894,
    "40,81,90,93": 895,
    "40,83,86,95": 896,
    "40,83,90,95": 897,
    "40,83,92,95": 898,
    "41": 899,
    "41,43,44,46,56,58,65,67,68,70": 900,
    "41,43,55": 901,
    "41,44,48,53,65,68,72,77": 902,
    "41,44,48,53,68,72,77,80": 903,
    "41,44,49,65,68,73": 904,
    "41,44,49,65,73": 905,
    "41,44,49,68,73": 906,
    "41,44,51,53,56,60,61": 907,
    "41,44,53,63": 908,
    "41,45": 909,
    "41,45,48,49,51,53,65,69,72,73,75,77": 910,
    "41,45,49,51,53,65,69,73,75,77": 911,
    "41,45,53,55,57,58": 912,
    "41,45,69,73,77,81": 913,
    "41,46,50,56,58": 914,
    "41,46,51,53,65,70,75,77": 915,
    "41,46,53,58,62": 916,
    "41,46,53,58,62,70": 917,
    "41,46,53,61": 918,
    "41,46,53,68,70,80": 919,
    "41,46,57,58": 920,
    "41,47,53,57,63,69": 921,
    "41,47,53,80,83,86,92": 922,
    "41,48,51,57,63": 923,
    "41,48,53,56,60,68": 924,
    "41,48,53,57,60,69": 925,
    "41,48,53,58": 926,
    "41,48,53,58,60,65": 927,
    "41,48,53,58,65": 928,
    "41,48,53,60,63,69": 929,
    "41,48,53,81,84,89,93": 930,
    "41,48,55,58,64,70": 931,
    "41,48,55,60,64,72": 932,
    "41,48,57,58,60,62": 933,
    "41,48,57,63": 934,
    "41,48,58,60": 935,
    "41,48,62,69,74": 936,
    "41,48,77,81,84,89": 937,
    "41,49,53,56,65,68": 938,
    "41,49,53,59,65,71": 939,
    "41,50,53,58": 940,
    "41,50,53,58,65,70": 941,
    "41,50,69,73,77,81": 942,
    "41,50,71,74,79,83": 943,
    "41,50,74": 944,
    "41,51,53,57,60": 945,
    "41,51,57,60": 946,
    "41,51,57,60,66,72": 947,
    "41,52,76,81,85,88": 948,
    "41,53": 949,
    "41,53,56,61": 950,
    "41,53,56,61,68": 951,
    "41,53,57": 952,
    "41,53,59,63,68,70": 953,
    "41,53,61,68": 954,
    "41,53,63,69,72": 955,
    "41,53,65": 956,
    "41,53,65,68,72,77": 957,
    "41,53,65,77": 958,
    "41,53,70,74,80,82": 959,
    "41,53,71,79,83": 960,
    "41,53,72,76,79,84": 961,
    "41,53,80": 962,
    "41,53,84,87,96": 963,
    "41,54,57,60,63": 964,
    "41,55,62,64,69,72,74,76": 965,
    "41,55,76,82,85,88": 966,
    "41,56,61,65": 967,
    "41,56,68": 968,
    "41,57,65": 969,
    "41,58,62": 970,
    "41,60,64,67,72": 971,
    "41,60,67": 972,
    "41,63": 973,
    "41,64,67": 974,
    "41,65,69": 975,
    "41,69,72": 976,
    "41,69,72,79": 977,
    "41,69,72,81": 978,
    "41,69,73,77,81": 979,
    "41,69,75": 980,
    "41,69,81": 981,
    "41,72,73": 982,
    "41,74,77,82,86": 983,
    "41,77,81": 984,
    "41,79,83,91": 985,
    "41,80,83,86,92": 986,
    "41,81,84,89,93": 987,
    "42": 988,
    "42,43": 989,
    "42,44,54,56,66,68,78,80": 990,
    "42,44,56,82,94": 991,
    "42,45,48,51,57,89,93,96,101": 992,
    "42,45,66,69": 993,
    "42,45,66,69,73": 994,
    "42,46,48,52,58,60,64": 995,
    "42,46,48,58,60,64": 996,
    "42,46,49,54,73,78,82,85": 997,
    "42,46,50,56,58": 998,
    "42,46,54,61,70,73": 999,
    "42,47": 1000,
    "42,47,50,55,59": 1001,
    "42,47,54,55": 1002,
    "42,47,54,57,63,71": 1003,
    "42,47,54,57,69,71": 1004,
    "42,47,57,59": 1005,
    "42,47,75,82,87": 1006,
    "42,47,76,79": 1007,
    "42,47,78,79,87,88,90,91": 1008,
    "42,47,81,90,93": 1009,
    "42,48,49,60,61,66,70": 1010,
    "42,48,50,57,62": 1011,
    "42,48,51,54,80,84,87,92": 1012,
    "42,48,57,62": 1013,
    "42,48,60,66,70": 1014,
    "42,48,76,79": 1015,
    "42,49,50,61,62,66,70": 1016,
    "42,49,54,57,66,69": 1017,
    "42,49,61,66,70": 1018,
    "42,50,52,59,61": 1019,
    "42,50,54,57,62,69": 1020,
    "42,50,54,59,62": 1021,
    "42,50,54,60,62,69": 1022,
    "42,50,59": 1023,
    "42,51,54,59": 1024,
    "42,52,54,58,61": 1025,
    "42,52,61": 1026,
    "42,54": 1027,
    "42,54,55,62,64": 1028,
    "42,54,57": 1029,
    "42,54,57,61,69": 1030,
    "42,54,57,62,69": 1031,
    "42,54,57,69": 1032,
    "42,54,59,63,75,83,87": 1033,
    "42,54,61,69": 1034,
    "42,54,62": 1035,
    "42,54,62,69,74": 1036,
    "42,54,63,69,72": 1037,
    "42,54,66": 1038,
    "42,54,66,78": 1039,
    "42,54,72,75": 1040,
    "42,54,72,81,84": 1041,
    "42,54,76,82,85,90": 1042,
    "42,54,81,93": 1043,
    "42,54,83,88,95": 1044,
    "42,54,84": 1045,
    "42,54,84,87,96": 1046,
    "42,55,64": 1047,
    "42,56,59,71,80,83": 1048,
    "42,57,64,72": 1049,
    "42,57,72": 1050,
    "42,58": 1051,
    "42,59,63,66": 1052,
    "42,61,64,68": 1053,
    "42,63,66,69,71": 1054,
    "42,64,73": 1055,
    "42,65,68,71,73": 1056,
    "42,72": 1057,
    "42,73": 1058,
    "42,76,79": 1059,
    "42,76,82,85,90": 1060,
    "42,79,81,88,90,91,93": 1061,
    "42,79,83": 1062,
    "42,81,90,93": 1063,
    "42,85": 1064,
    "43": 1065,
    "43,44": 1066,
    "43,44,51,55,56,58,60,63": 1067,
    "43,44,53,61": 1068,
    "43,45,47,48,50,55,67,71,74,79": 1069,
    "43,45,48,55,67,69,72,79": 1070,
    "43,45,48,55,67,72,76,79": 1071,
    "43,46": 1072,
    "43,46,50,55,62,67,70,74": 1073,
    "43,46,58": 1074,
    "43,47,49,52,54,59": 1075,
    "43,47,50,53,55": 1076,
    "43,47,50,55,62,67,71,74": 1077,
    "43,47,50,55,67,71,74,79": 1078,
    "43,47,51,57,63": 1079,
    "43,47,52,54,70,71,76,79": 1080,
    "43,47,52,55,64,71,76,79": 1081,
    "43,47,52,71,76,79": 1082,
    "43,47,55,86,95,98": 1083,
    "43,47,57,63": 1084,
    "43,47,59": 1085,
    "43,47,59,81,89,93": 1086,
    "43,47,67,71": 1087,
    "43,47,71": 1088,
    "43,47,83,91,95": 1089,
    "43,48": 1090,
    "43,48,50,51,55,59,60,62": 1091,
    "43,48,50,55,62,67,74": 1092,
    "43,48,50,55,67,74,79": 1093,
    "43,48,50,55,74,79,86": 1094,
    "43,48,51,55,79,84,87,91": 1095,
    "43,48,52,55,67,69,72,79": 1096,
    "43,48,52,55,67,72,76,79": 1097,
    "43,48,52,55,67,74,77,79": 1098,
    "43,48,54,60,69,72,75,78,81": 1099,
    "43,48,54,63,72,75,78,81,84": 1100,
    "43,48,54,66,75,78,81,84,87": 1101,
    "43,48,55,58,60,70": 1102,
    "43,48,55,58,64,70": 1103,
    "43,48,55,67,70,79": 1104,
    "43,48,55,67,74,79": 1105,
    "43,48,57,88,96,100": 1106,
    "43,48,60,64": 1107,
    "43,48,60,79,88,91": 1108,
    "43,48,61,83,91,95": 1109,
    "43,48,62,64,65,67": 1110,
    "43,48,64,65,67,69": 1111,
    "43,48,64,72,76": 1112,
    "43,48,64,76,84,88": 1113,
    "43,48,65,67,69,71": 1114,
    "43,48,67,77,79": 1115,
    "43,48,69,71,72,74": 1116,
    "43,48,71,72,74,76": 1117,
    "43,48,76,84,88": 1118,
    "43,49,57,88,97,100": 1119,
    "43,50": 1120,
    "43,50,53,55,67,72,76,79": 1121,
    "43,50,53,55,67,74,77,79": 1122,
    "43,50,55,58,62,70": 1123,
    "43,50,55,59,62,74,79,83,86": 1124,
    "43,50,55,59,67,71,74,77,79": 1125,
    "43,50,55,62,67,70,74": 1126,
    "43,50,57,84,93,96": 1127,
    "43,50,59,62": 1128,
    "43,50,59,62,65,74": 1129,
    "43,50,59,67,71": 1130,
    "43,50,59,71": 1131,
    "43,50,59,81,89,93": 1132,
    "43,50,59,89,98,101": 1133,
    "43,50,60,88,96,100": 1134,
    "43,50,62,81,89,93": 1135,
    "43,50,62,86,95,98": 1136,
    "43,50,65,71,77": 1137,
    "43,50,65,81,89,93": 1138,
    "43,50,67,71": 1139,
    "43,50,67,71,79": 1140,
    "43,50,79,83,86,91": 1141,
    "43,51,55,63,70,75": 1142,
    "43,51,62,63,70,74,75": 1143,
    "43,51,63,67,72": 1144,
    "43,51,63,72": 1145,
    "43,51,72,75,79": 1146,
    "43,52,53,64,67,72": 1147,
    "43,52,55,64,72,76": 1148,
    "43,52,59,86,91,98": 1149,
    "43,52,60,76,84,88": 1150,
    "43,52,60,79,88,91": 1151,
    "43,52,64,67,72": 1152,
    "43,52,64,72": 1153,
    "43,52,64,79,88,91": 1154,
    "43,52,64,83,91,95": 1155,
    "43,52,67,72": 1156,
    "43,52,72,76": 1157,
    "43,52,72,76,79,84": 1158,
    "43,52,76,79,84": 1159,
    "43,52,79,84": 1160,
    "43,53,54,55,65,66,67": 1161,
    "43,53,54,64,69,72": 1162,
    "43,53,55,59,60,62,63": 1163,
    "43,53,55,59,62": 1164,
    "43,53,55,65,67": 1165,
    "43,53,59,62": 1166,
    "43,53,59,62,63": 1167,
    "43,53,61": 1168,
    "43,53,64,67,72": 1169,
    "43,54,55,64,67,71,72": 1170,
    "43,54,55,66,67": 1171,
    "43,54,64,69,71,72": 1172,
    "43,54,64,69,72": 1173,
    "43,54,69,72": 1174,
    "43,54,71,76,81,83": 1175,
    "43,54,72,76,81,84": 1176,
    "43,54,76,84,88": 1177,
    "43,55": 1178,
    "43,55,58,63": 1179,
    "43,55,59": 1180,
    "43,55,59,65": 1181,
    "43,55,60,63": 1182,
    "43,55,62,65,67,83,95": 1183,
    "43,55,63,67,71": 1184,
    "43,55,65": 1185,
    "43,55,65,71,76": 1186,
    "43,55,67": 1187,
    "43,55,67,76,79": 1188,
    "43,55,69,72": 1189,
    "43,55,70,75,82": 1190,
    "43,55,71,83": 1191,
    "43,55,74,79,82": 1192,
    "43,55,81,84,89,93": 1193,
    "43,55,84,87,96": 1194,
    "43,56,65,73": 1195,
    "43,57,64,65,72,76,77": 1196,
    "43,58": 1197,
    "43,59,60": 1198,
    "43,60,62": 1199,
    "43,60,64": 1200,
    "43,60,68,72": 1201,
    "43,60,68,77": 1202,
    "43,60,79,84,87": 1203,
    "43,62,65": 1204,
    "43,63,72,75": 1205,
    "43,64,67": 1206,
    "43,64,67,72": 1207,
    "43,64,71,73": 1208,
    "43,64,72,76": 1209,
    "43,65,74,80": 1210,
    "43,67": 1211,
    "43,67,71": 1212,
    "43,67,77,79": 1213,
    "43,68,77,80": 1214,
    "43,69,72": 1215,
    "43,69,77,81": 1216,
    "43,70,71,73": 1217,
    "43,71": 1218,
    "43,71,74": 1219,
    "43,71,75": 1220,
    "43,72,76": 1221,
    "43,76,79": 1222,
    "43,76,84,88": 1223,
    "43,78,82,90": 1224,
    "43,81,83,90,91,93,95": 1225,
    "43,81,89,93": 1226,
    "43,81,90,93": 1227,
    "43,83,91,95": 1228,
    "44,45,64,68,69,72,76": 1229,
    "44,45,65,72,77": 1230,
    "44,46,50,56,58": 1231,
    "44,46,51,55,56,58,60": 1232,
    "44,47,51,56,63,68,71,75": 1233,
    "44,47,51,56,68,71,75,80": 1234,
    "44,47,51,56,71,75,80,83": 1235,
    "44,47,53,56,63": 1236,
    "44,47,64,66,75": 1237,
    "44,47,85,89,92,97": 1238,
    "44,48,51,56,60,63,68,72": 1239,
    "44,48,52,64,72,76": 1240,
    "44,48,53,65,72,77": 1241,
    "44,48,56,60,63": 1242,
    "44,48,76,84,88": 1243,
    "44,49,56,66,72,75": 1244,
    "44,49,67,70,75": 1245,
    "44,50,53,56,59,62,65,71": 1246,
    "44,50,62,65": 1247,
    "44,51,55,63,70,73": 1248,
    "44,51,55,63,72,75": 1249,
    "44,51,56,60": 1250,
    "44,51,56,61,70,75": 1251,
    "44,51,56,65,73,75": 1252,
    "44,51,56,68,72,75,80": 1253,
    "44,51,56,71,75,80,83": 1254,
    "44,51,58,67,70,75": 1255,
    "44,51,58,67,73,75": 1256,
    "44,51,60,63,70,75": 1257,
    "44,51,60,68,72,75": 1258,
    "44,51,61,70,73,75": 1259,
    "44,51,65,70,73": 1260,
    "44,52,58": 1261,
    "44,53,56,61,65,73": 1262,
    "44,53,61": 1263,
    "44,55,59,62": 1264,
    "44,56": 1265,
    "44,56,57,61,73,81,85": 1266,
    "44,56,60": 1267,
    "44,56,60,63,68,72,74": 1268,
    "44,56,60,68,72": 1269,
    "44,56,60,72,75": 1270,
    "44,56,63,68": 1271,
    "44,56,65,66,72,73,75": 1272,
    "44,56,65,73": 1273,
    "44,56,66,72,75": 1274,
    "44,56,68,75,80,84": 1275,
    "44,56,68,76,80": 1276,
    "44,56,68,77,80": 1277,
    "44,56,68,77,80,84": 1278,
    "44,56,68,80": 1279,
    "44,56,70,74,77,82": 1280,
    "44,56,71,83": 1281,
    "44,62,65": 1282,
    "44,62,65,74": 1283,
    "44,62,70": 1284,
    "44,64,65,68,72,76": 1285,
    "44,65,68,70,75": 1286,
    "44,66,75": 1287,
    "45": 1288,
    "45,46": 1289,
    "45,46,51,55,63,72,74,75": 1290,
    "45,46,58": 1291,
    "45,47": 1292,
    "45,47,52,64,69,76": 1293,
    "45,47,57,59,66,69,75,78,81": 1294,
    "45,47,59": 1295,
    "45,47,64,69,72,76": 1296,
    "45,48": 1297,
    "45,48,50,52,53,57,69,72,76,81": 1298,
    "45,48,51,57,78,84,87,90": 1299,
    "45,48,51,60,66,69,72": 1300,
    "45,48,52,57,60,64,69": 1301,
    "45,48,52,57,64,72,76": 1302,
    "45,48,52,57,72,76": 1303,
    "45,48,52,64,69,76": 1304,
    "45,48,52,64,72,76": 1305,
    "45,48,53,56,71,72,77,81": 1306,
    "45,48,53,57": 1307,
    "45,48,53,60,72,89,93,96,101": 1308,
    "45,48,53,60,89,93,96,101": 1309,
    "45,48,53,72,77,81": 1310,
    "45,48,54,55,71,72,78,81": 1311,
    "45,48,54,57,66,72,78,81": 1312,
    "45,48,54,72,78,81": 1313,
    "45,48,60,63": 1314,
    "45,48,60,66,69,72": 1315,
    "45,48,64,72,76": 1316,
    "45,48,65,72,77": 1317,
    "45,48,66,69": 1318,
    "45,48,69,72": 1319,
    "45,48,69,72,81": 1320,
    "45,49,51,57,61,66": 1321,
    "45,49,53,69,81": 1322,
    "45,49,57,66": 1323,
    "45,49,66,69,73": 1324,
    "45,49,69,73,77,81": 1325,
    "45,50,52,65,69,72,74": 1326,
    "45,50,53,57,69,74,77,81": 1327,
    "45,50,53,69,76,79,81": 1328,
    "45,50,57,62,66": 1329,
    "45,50,57,62,66,72": 1330,
    "45,50,62,65": 1331,
    "45,50,62,65,68,69,71": 1332,
    "45,50,65,69,74": 1333,
    "45,50,65,71,74": 1334,
    "45,51,55,63,74,75": 1335,
    "45,51,57,61": 1336,
    "45,51,57,61,66": 1337,
    "45,51,57,61,68": 1338,
    "45,51,57,66": 1339,
    "45,51,57,68": 1340,
    "45,51,57,72,78,84": 1341,
    "45,51,57,78,84": 1342,
    "45,51,60,66,69,72": 1343,
    "45,51,60,68,69,71,72": 1344,
    "45,51,60,72": 1345,
    "45,51,66,69": 1346,
    "45,52,53,62,68,69,71,72": 1347,
    "45,52,56,59,64,69,76": 1348,
    "45,52,57,60,72,76,81,84": 1349,
    "45,52,57,64,69,72,73,76": 1350,
    "45,52,60,64": 1351,
    "45,52,61,64": 1352,
    "45,52,62,68,69,71,72": 1353,
    "45,52,64,69,76": 1354,
    "45,52,65,69,71,72,74": 1355,
    "45,52,69,72": 1356,
    "45,52,72": 1357,
    "45,53": 1358,
    "45,53,57,60,69": 1359,
    "45,53,62,68,71": 1360,
    "45,53,65,69,71,72,74": 1361,
    "45,54,57,62,64,66": 1362,
    "45,54,59,62": 1363,
    "45,54,60,69,72": 1364,
    "45,54,62": 1365,
    "45,54,64,72": 1366,
    "45,54,72": 1367,
    "45,55,67,72,76": 1368,
    "45,56,57,68,77,81": 1369,
    "45,57": 1370,
    "45,57,61,66": 1371,
    "45,57,62,66,69": 1372,
    "45,57,64": 1373,
    "45,57,64,67,69,76,79,81": 1374,
    "45,57,64,73,76": 1375,
    "45,57,69": 1376,
    "45,57,69,73,81": 1377,
    "45,57,69,77,81": 1378,
    "45,57,69,78,81": 1379,
    "45,57,69,81": 1380,
    "45,57,72,84": 1381,
    "45,57,77,81": 1382,
    "45,57,78": 1383,
    "45,57,82,86,94": 1384,
    "45,60,67,72,76": 1385,
    "45,61,64": 1386,
    "45,62": 1387,
    "45,62,65": 1388,
    "45,62,65,74": 1389,
    "45,62,68,71": 1390,
    "45,63,69,72": 1391,
    "45,65,71,74": 1392,
    "45,66,69": 1393,
    "45,67,72,76": 1394,
    "45,67,73": 1395,
    "45,69,72": 1396,
    "45,69,72,76": 1397,
    "45,69,73": 1398,
    "45,69,73,81": 1399,
    "45,72": 1400,
    "45,72,74,78,84": 1401,
    "45,76,79,85,88": 1402,
    "45,77": 1403,
    "46,47": 1404,
    "46,48,51,55,63,70,75": 1405,
    "46,48,58": 1406,
    "46,49,77,85,89": 1407,
    "46,50,53,58,62,70": 1408,
    "46,50,54,56,65,70,82": 1409,
    "46,50,56": 1410,
    "46,50,56,65": 1411,
    "46,50,56,66,78": 1412,
    "46,51": 1413,
    "46,51,54,58,63,66,70,75,78,82": 1414,
    "46,51,55,56,63,65,74,75": 1415,
    "46,51,55,63,70,72,75": 1416,
    "46,51,56,58,63,68,70": 1417,
    "46,51,56,59,75,80,83,87": 1418,
    "46,51,57,60": 1419,
    "46,51,66,70": 1420,
    "46,52,55,60,72,76,79,84": 1421,
    "46,52,55,61,67,73,79,82": 1422,
    "46,52,55,64,67,73": 1423,
    "46,52,55,73,79,82": 1424,
    "46,53,56,58,62,68,70,74": 1425,
    "46,53,58,62,70,74,77,82": 1426,
    "46,53,60,63,69,72,75": 1427,
    "46,55,56,63,65,67,74,75": 1428,
    "46,55,56,63,67,74,75": 1429,
    "46,55,63,67,75": 1430,
    "46,55,63,70,75": 1431,
    "46,55,70,75": 1432,
    "46,56,65,67,74": 1433,
    "46,56,65,74": 1434,
    "46,58": 1435,
    "46,58,61,73": 1436,
    "46,58,63,66": 1437,
    "46,58,63,66,70": 1438,
    "46,58,65,70,74,77": 1439,
    "46,58,70": 1440,
    "46,58,70,73,78,82": 1441,
    "46,58,80,86,89,92": 1442,
    "46,58,81": 1443,
    "46,58,81,87,93": 1444,
    "46,61": 1445,
    "46,61,70,73": 1446,
    "46,70": 1447,
    "46,74,86": 1448,
    "46,75,79": 1449,
    "47": 1450,
    "47,48": 1451,
    "47,48,50,51,55,60,62": 1452,
    "47,48,52,64,69,76": 1453,
    "47,48,60": 1454,
    "47,49,51,52": 1455,
    "47,49,52,58": 1456,
    "47,49,52,58,70": 1457,
    "47,49,52,70,73": 1458,
    "47,49,59,61,73": 1459,
    "47,49,80,89,92": 1460,
    "47,50": 1461,
    "47,50,55,57,73,74,79,83": 1462,
    "47,50,55,59,77,86,89": 1463,
    "47,50,55,62": 1464,
    "47,50,55,62,67,74": 1465,
    "47,50,55,74,79,83": 1466,
    "47,50,56,62,68,74,80,83": 1467,
    "47,50,56,74,80,83": 1468,
    "47,50,71,74": 1469,
    "47,50,74,79,86": 1470,
    "47,50,79,83": 1471,
    "47,51": 1472,
    "47,51,52,58,66,71,83": 1473,
    "47,51,54,59,63,66,71,75": 1474,
    "47,51,54,59,66,71,75,78": 1475,
    "47,51,54,59,71,75,78,83": 1476,
    "47,51,54,59,81,87,90,93": 1477,
    "47,51,55,59,63,71,75": 1478,
    "47,51,55,63,67,71,75,79": 1479,
    "47,51,57,59,66": 1480,
    "47,51,57,59,68": 1481,
    "47,51,63,66,73": 1482,
    "47,51,71,83": 1483,
    "47,51,73": 1484,
    "47,52,55,64,67,71": 1485,
    "47,52,57,61,68": 1486,
    "47,52,57,68": 1487,
    "47,52,58": 1488,
    "47,52,58,67,79": 1489,
    "47,52,64,67,71": 1490,
    "47,52,64,68,75": 1491,
    "47,52,64,69,76": 1492,
    "47,52,64,73": 1493,
    "47,52,71,76,79,83": 1494,
    "47,52,75": 1495,
    "47,52,76,79": 1496,
    "47,52,76,80,88": 1497,
    "47,52,79,83": 1498,
    "47,52,80": 1499,
    "47,53": 1500,
    "47,53,55,62,81,86,89,93": 1501,
    "47,53,59,77,89": 1502,
    "47,53,59,79,80,83,86,91,92": 1503,
    "47,53,75": 1504,
    "47,54,57,63": 1505,
    "47,54,57,63,64": 1506,
    "47,54,57,64": 1507,
    "47,54,57,66,71,75,78,83": 1508,
    "47,54,63,69,72": 1509,
    "47,54,72": 1510,
    "47,54,76": 1511,
    "47,55": 1512,
    "47,55,59,64,67,71": 1513,
    "47,55,64,67,71": 1514,
    "47,55,64,73": 1515,
    "47,55,71,74,79,83": 1516,
    "47,55,74,79,86": 1517,
    "47,56,59,62": 1518,
    "47,56,59,62,65,68": 1519,
    "47,56,63": 1520,
    "47,56,65,68,71,74": 1521,
    "47,56,71,74,80,83": 1522,
    "47,57": 1523,
    "47,57,59,66": 1524,
    "47,57,61,68": 1525,
    "47,57,63": 1526,
    "47,57,63,69": 1527,
    "47,57,63,69,71": 1528,
    "47,57,63,69,72": 1529,
    "47,57,66,72,75": 1530,
    "47,57,72": 1531,
    "47,57,76": 1532,
    "47,59": 1533,
    "47,59,66,75,78": 1534,
    "47,59,71": 1535,
    "47,59,71,79,83": 1536,
    "47,59,77,86,89": 1537,
    "47,59,79,91": 1538,
    "47,59,81,93": 1539,
    "47,59,83,95": 1540,
    "47,63,64,66": 1541,
    "47,63,64,72": 1542,
    "47,64,73": 1543,
    "47,65,71,74": 1544,
    "47,66,69,75": 1545,
    "47,71": 1546,
    "47,71,74": 1547,
    "47,71,83": 1548,
    "47,72": 1549,
    "47,74,79,86": 1550,
    "47,75": 1551,
    "47,76,79": 1552,
    "47,76,85,88": 1553,
    "47,77,89": 1554,
    "47,78,87,90": 1555,
    "47,79,83": 1556,
    "47,79,88,91": 1557,
    "47,80,83,86,92": 1558,
    "47,81,90,93": 1559,
    "47,83,91,95": 1560,
    "48": 1561,
    "48,50,51,53,55,59,60": 1562,
    "48,50,52,53": 1563,
    "48,50,52,64,69,76": 1564,
    "48,50,53,60,72,74,77,84": 1565,
    "48,50,55,60": 1566,
    "48,50,55,62,67,74": 1567,
    "48,50,55,74,79,86": 1568,
    "48,51": 1569,
    "48,51,54,57,60,63,66,69,75": 1570,
    "48,51,55,60": 1571,
    "48,51,55,60,62": 1572,
    "48,51,55,60,62,72": 1573,
    "48,51,55,60,63,67": 1574,
    "48,51,55,60,63,67,72": 1575,
    "48,51,55,60,67": 1576,
    "48,51,55,60,67,72": 1577,
    "48,51,55,60,67,72,75,79": 1578,
    "48,51,55,60,75,79,84,87": 1579,
    "48,51,55,63,68,70,75": 1580,
    "48,51,57": 1581,
    "48,51,57,65": 1582,
    "48,51,57,77,89": 1583,
    "48,51,60,72": 1584,
    "48,51,63,68,75": 1585,
    "48,52": 1586,
    "48,52,53,55,57,60,72,76,79,84": 1587,
    "48,52,55,60,67,76,79": 1588,
    "48,52,55,60,72,76,79,84": 1589,
    "48,52,55,60,76,79": 1590,
    "48,52,55,60,76,79,84,88": 1591,
    "48,52,55,60,76,84,88": 1592,
    "48,52,55,64,67,72": 1593,
    "48,52,57,59,64,69,71": 1594,
    "48,52,57,59,75,76,81,84": 1595,
    "48,52,57,60,64,66,69,72": 1596,
    "48,52,57,60,72,84": 1597,
    "48,52,57,60,74,86": 1598,
    "48,52,57,60,76,88": 1599,
    "48,52,57,76,81,84": 1600,
    "48,52,58,60,64": 1601,
    "48,52,60,64,72": 1602,
    "48,52,60,88,96,100": 1603,
    "48,52,64,68,69,71,76": 1604,
    "48,52,64,69,76": 1605,
    "48,52,64,72,76": 1606,
    "48,52,69,76": 1607,
    "48,52,71,76": 1608,
    "48,52,76,79": 1609,
    "48,53,55": 1610,
    "48,53,57,59,67,69,72,77": 1611,
    "48,53,57,60,72,77,81,84": 1612,
    "48,53,57,60,72,84": 1613,
    "48,53,57,60,77,81,84,89": 1614,
    "48,53,57,60,77,84,89": 1615,
    "48,53,57,69,72,77": 1616,
    "48,53,57,72,79,83,84": 1617,
    "48,53,62,69,72": 1618,
    "48,53,62,69,74": 1619,
    "48,53,74,81,86": 1620,
    "48,54,56,60,63,66": 1621,
    "48,54,57,60,66,69": 1622,
    "48,54,57,63,69,75,81,84": 1623,
    "48,54,57,75,81,84": 1624,
    "48,55": 1625,
    "48,55,57,64,83,88,91,95": 1626,
    "48,55,58": 1627,
    "48,55,58,60,72,79,82,84": 1628,
    "48,55,58,64,67": 1629,
    "48,55,59": 1630,
    "48,55,60": 1631,
    "48,55,60,64,72,76": 1632,
    "48,55,60,64,72,76,79,84": 1633,
    "48,55,60,72": 1634,
    "48,55,60,76,82,84,88": 1635,
    "48,55,63,70,72,75": 1636,
    "48,55,63,70,75": 1637,
    "48,55,63,72,74,75": 1638,
    "48,55,63,74,75": 1639,
    "48,55,64,67": 1640,
    "48,55,64,69,72": 1641,
    "48,55,64,71,74": 1642,
    "48,55,64,72,76": 1643,
    "48,55,64,84,95,96": 1644,
    "48,55,67,70,72,76": 1645,
    "48,55,75": 1646,
    "48,57,59,60,66,68,69": 1647,
    "48,57,60": 1648,
    "48,57,60,66,69": 1649,
    "48,57,64,66": 1650,
    "48,57,64,69": 1651,
    "48,57,65,71,74": 1652,
    "48,57,65,72,76": 1653,
    "48,57,65,72,77": 1654,
    "48,57,66": 1655,
    "48,58,60": 1656,
    "48,58,64,67": 1657,
    "48,58,67,70": 1658,
    "48,58,67,70,72,76": 1659,
    "48,58,79": 1660,
    "48,60": 1661,
    "48,60,61,68,72": 1662,
    "48,60,64": 1663,
    "48,60,64,72,76": 1664,
    "48,60,66": 1665,
    "48,60,66,69,78": 1666,
    "48,60,67,76,79": 1667,
    "48,60,69,72": 1668,
    "48,60,72": 1669,
    "48,60,72,80,84": 1670,
    "48,60,72,81,84": 1671,
    "48,60,72,84": 1672,
    "48,60,76": 1673,
    "48,60,78": 1674,
    "48,60,78,81,90": 1675,
    "48,60,79,82,88,91": 1676,
    "48,60,80,84": 1677,
    "48,60,89,92,96,101": 1678,
    "48,61": 1679,
    "48,62,63,68,72": 1680,
    "48,62,76": 1681,
    "48,63": 1682,
    "48,63,66,69": 1683,
    "48,64": 1684,
    "48,64,67": 1685,
    "48,65,69": 1686,
    "48,65,69,77": 1687,
    "48,67,71": 1688,
    "48,67,77,79": 1689,
    "48,68": 1690,
    "48,69,72,77": 1691,
    "48,71,74": 1692,
    "48,71,77,83": 1693,
    "48,72,76": 1694,
    "48,72,76,84": 1695,
    "48,74": 1696,
    "48,74,77": 1697,
    "48,75": 1698,
    "48,76": 1699,
    "48,76,79": 1700,
    "48,76,79,84,88": 1701,
    "48,77,81": 1702,
    "48,78,81": 1703,
    "48,79,83": 1704,
    "48,82,91,94": 1705,
    "49": 1706,
    "49,50,62,65": 1707,
    "49,50,69,73,74,77,81": 1708,
    "49,51,61,63,73,75": 1709,
    "49,52": 1710,
    "49,52,55,64,67,70": 1711,
    "49,52,56,61,64,68,73,76": 1712,
    "49,52,58,64,70,76,82,85": 1713,
    "49,52,58,76,82,85": 1714,
    "49,52,64,73,76": 1715,
    "49,52,70": 1716,
    "49,53,58,59,70,73": 1717,
    "49,54,66,69,73": 1718,
    "49,55,56,65,77,80": 1719,
    "49,56": 1720,
    "49,56,58,59,65,77,80": 1721,
    "49,56,58,65,77,80": 1722,
    "49,56,59,61,73,77": 1723,
    "49,56,59,66,78,82": 1724,
    "49,56,61,65,77,80,89": 1725,
    "49,56,61,66,78,82": 1726,
    "49,56,65,66,72,75,77": 1727,
    "49,56,65,77,80": 1728,
    "49,57": 1729,
    "49,58": 1730,
    "49,59,62": 1731,
    "49,61": 1732,
    "49,61,64": 1733,
    "49,61,66,70": 1734,
    "49,61,67,69,73": 1735,
    "49,61,68,71,77,80": 1736,
    "49,61,68,73,77,80": 1737,
    "49,61,73": 1738,
    "49,62,65": 1739,
    "49,65,71": 1740,
    "49,66,73,78": 1741,
    "49,68,70": 1742,
    "49,69,73,77,81": 1743,
    "49,69,73,79,81": 1744,
    "49,71,73": 1745,
    "49,73,75": 1746,
    "49,73,79,81,85": 1747,
    "50": 1748,
    "50,51,63": 1749,
    "50,52": 1750,
    "50,52,53,55": 1751,
    "50,52,55,59,60,62,64,67,71,72": 1752,
    "50,52,57,60,62,64,66,72": 1753,
    "50,52,57,64,65,82,83": 1754,
    "50,52,64,68,69,71,76": 1755,
    "50,52,64,69,76": 1756,
    "50,52,69,74,77,81": 1757,
    "50,53": 1758,
    "50,53,55,59,67,79": 1759,
    "50,53,55,59,71,83": 1760,
    "50,53,55,59,74,86": 1761,
    "50,53,55,59,77,89": 1762,
    "50,53,55,62,65,67": 1763,
    "50,53,57,60,72,77,84,89": 1764,
    "50,53,57,60,72,84": 1765,
    "50,53,57,62,65,74,75": 1766,
    "50,53,57,62,77,81,86,89": 1767,
    "50,53,62,68,71": 1768,
    "50,53,65,68,71": 1769,
    "50,53,65,69,71": 1770,
    "50,53,65,69,71,72,74": 1771,
    "50,53,71,77": 1772,
    "50,53,72,77": 1773,
    "50,54,59,62,66,71": 1774,
    "50,54,60,62,69": 1775,
    "50,55": 1776,
    "50,55,57,59,62,63,71,74,75": 1777,
    "50,55,59,62,67,71": 1778,
    "50,55,59,62,79,83,86,91": 1779,
    "50,55,62": 1780,
    "50,55,62,67,71": 1781,
    "50,55,62,67,74": 1782,
    "50,55,62,67,74,79": 1783,
    "50,55,67,70": 1784,
    "50,55,67,70,76": 1785,
    "50,55,74,79,86": 1786,
    "50,56": 1787,
    "50,56,59,62,68,71": 1788,
    "50,56,62,65": 1789,
    "50,57,60": 1790,
    "50,57,60,67,69,72,79": 1791,
    "50,57,62,66": 1792,
    "50,57,62,66,78,81,90": 1793,
    "50,57,62,74": 1794,
    "50,57,62,78,81,84,86,90": 1795,
    "50,57,65,75": 1796,
    "50,57,65,75,76": 1797,
    "50,57,65,76": 1798,
    "50,57,65,76,77": 1799,
    "50,57,65,77": 1800,
    "50,57,65,77,78": 1801,
    "50,57,65,78": 1802,
    "50,57,65,78,79": 1803,
    "50,57,65,79": 1804,
    "50,57,65,79,80": 1805,
    "50,57,65,80": 1806,
    "50,57,65,80,81": 1807,
    "50,57,65,81": 1808,
