{
  "token_to_id": {
    "102": 1,
    "21": 2,
    "26,33,38,74,78,81,86": 3,
    "28": 4,
    "28,40,45,49,52,55,57,61,67,69": 5,
    "28,40,52": 6,
    "28,40,55,59,64": 7,
    "28,52,57,61,67,69,73,79,81": 8,
    "28,52,64,69,73,79,81,85,91,93": 9,
    "28,52,81,83": 10,
    "29,32,41,48,51,53,56,60,63": 11,
    "29,32,41,49,51,53,56,61,63": 12,
    "29,32,41,51,53,56,63": 13,
    "29,36,41": 14,
    "29,36,41,48,52,53,57,60,64": 15,
    "29,36,41,50,52,53,57,62,64": 16,
    "29,36,41,52,53,57,64": 17,
    "29,41,44,47,51,53,56,59,63,68": 18,
    "29,41,53": 19,
    "29,41,53,56,59,63,68,71,75,80": 20,
    "29,41,53,68,71,75,80,83,87,92": 21,
    "30,42,44,48,51,54,56,60,63,68": 22,
    "30,42,49,54,58,61,66": 23,
    "30,42,54": 24,
    "30,42,54,56,60,63,68,72,75,80": 25,
    "30,42,54,68,72,75,80,84,87,92": 26,
    "31,38": 27,
    "31,38,59,67": 28,
    "31,43,44,48,51,55,56,60,63,68": 29,
    "31,43,55": 30,
    "31,43,55,56,60,63,68,72,75,80": 31,
    "31,43,55,68,72,75,80,84,87,92": 32,
    "31,50,58,62": 33,
    "32": 34,
    "32,34,47,50,53": 35,
    "32,36,44,48,60": 36,
    "32,39,44,48,60": 37,
    "32,39,44,51,56,60,63": 38,
    "32,44,56": 39,
    "33": 40,
    "33,38,45,55,59,62": 41,
    "33,38,45,62,66,69": 42,
    "33,38,45,79,83,86": 43,
    "33,40": 44,
    "33,40,45,69,74,76,81": 45,
    "33,40,62,64,69": 46,
    "33,45": 47,
    "33,45,55,60,64": 48,
    "33,45,55,60,66": 49,
    "33,45,55,61,64": 50,
    "33,45,55,61,64,66": 51,
    "33,45,55,61,66": 52,
    "33,45,71,76,80": 53,
    "33,45,74,77,81": 54,
    "33,45,74,77,82": 55,
    "33,45,74,77,84": 56,
    "33,45,74,77,85": 57,
    "33,45,74,77,86": 58,
    "33,45,76,81,85": 59,
    "33,45,79,82,86": 60,
    "33,45,79,82,87": 61,
    "33,45,79,82,88": 62,
    "33,45,79,82,89": 63,
    "33,45,79,82,90": 64,
    "33,45,79,82,91": 65,
    "33,59,67,72,78": 66,
    "33,67,71,74": 67,
    "34,35,47,50,53": 68,
    "34,53,61,65": 69,
    "34,63,65": 70,
    "34,65,69": 71,
    "34,66,70": 72,
    "34,68,70": 73,
    "34,70,74": 74,
    "34,71,75": 75,
    "35": 76,
    "35,37,50,53,56": 77,
    "35,42": 78,
    "35,42,43,59,62": 79,
    "35,42,43,61,62": 80,
    "35,42,43,61,64": 81,
    "35,42,43,62,64": 82,
    "35,42,43,62,66": 83,
    "35,42,43,62,66,67": 84,
    "35,42,43,62,67": 85,
    "35,42,43,64,67": 86,
    "35,42,43,64,69": 87,
    "35,42,43,66,69": 88,
    "35,42,49,54": 89,
    "35,42,49,54,58": 90,
    "35,42,49,58": 91,
    "35,42,51,54,59": 92,
    "35,42,52,61,64": 93,
    "35,42,54,62": 94,
    "35,42,56,61": 95,
    "35,42,56,61,64": 96,
    "35,42,56,64": 97,
    "35,42,56,64,68": 98,
    "35,42,58,59": 99,
    "35,42,58,59,63": 100,
    "35,42,58,63": 101,
    "35,42,58,63,66": 102,
    "35,42,59": 103,
    "35,42,59,63": 104,
    "35,42,59,63,66": 105,
    "35,42,62,66": 106,
    "35,42,62,66,69": 107,
    "35,47,54,59,63": 108,
    "35,47,57,62,66,69,78": 109,
    "35,47,57,63,66,69,78": 110,
    "35,54,62,71": 111,
    "35,59": 112,
    "35,66": 113,
    "36": 114,
    "36,42,57,60,66": 115,
    "36,43": 116,
    "36,43,44,52,53,56,59,60,64": 117,
    "36,43,44,52,53,56,59,62,64": 118,
    "36,43,48": 119,
    "36,43,48,52,55,60,64": 120,
    "36,43,48,60": 121,
    "36,43,52,59,60": 122,
    "36,43,52,60": 123,
    "36,43,64,72": 124,
    "36,45,47,53,62,64": 125,
    "36,45,53,60,64": 126,
    "36,47,48,55,59,60": 127,
    "36,47,55,59,62": 128,
    "36,47,55,62,64": 129,
    "36,47,60": 130,
    "36,47,60,62": 131,
    "36,48": 132,
    "36,48,55,58,65,82,85": 133,
    "36,48,55,58,65,82,85,90": 134,
    "36,48,55,58,65,82,85,91": 135,
    "36,48,59,64,67": 136,
    "36,48,59,64,69": 137,
    "36,48,60": 138,
    "36,52,67": 139,
    "37,38,50,53,56": 140,
    "37,42,58,61,66": 141,
    "37,44,49,52,56,61,64": 142,
    "38": 143,
    "38,42,58,62,66": 144,
    "38,45": 145,
    "38,45,50,74,78,81,83": 146,
    "38,45,50,74,79,81,86": 147,
    "38,45,50,74,81,86": 148,
    "38,45,54,62": 149,
    "38,45,66,69": 150,
    "38,45,66,69,71": 151,
    "38,45,67,69,74": 152,
    "38,45,67,71,74": 153,
    "38,45,69,74": 154,
    "38,50": 155,
    "38,50,53,57": 156,
    "38,50,53,58": 157,
    "38,50,53,59": 158,
    "38,50,53,60": 159,
    "38,50,53,61": 160,
    "38,50,53,62": 161,
    "38,50,57,62,66": 162,
    "38,50,57,62,67": 163,
    "38,50,60,66,69": 164,
    "38,50,60,66,69,71": 165,
    "38,50,60,66,71": 166,
    "38,50,69,76,81": 167,
    "38,50,71,76,80": 168,
    "38,50,74,77,82": 169,
    "38,50,74,77,84": 170,
    "38,50,74,77,85": 171,
    "38,50,74,77,86": 172,
    "38,50,76,81,85": 173,
    "38,50,76,81,88": 174,
    "38,50,77": 175,
    "38,50,79,82,87": 176,
    "38,50,79,82,88": 177,
    "38,50,79,82,89": 178,
    "38,50,79,82,90": 179,
    "38,50,79,82,91": 180,
    "38,50,81": 181,
    "38,50,82,84,86": 182,
    "38,50,86": 183,
    "38,50,89": 184,
    "38,54,62,74": 185,
    "38,57,64,69": 186,
    "38,59,64,68": 187,
    "38,62,65,70": 188,
    "38,62,65,71": 189,
    "38,62,65,72": 190,
    "38,62,65,73": 191,
    "38,62,65,74": 192,
    "38,64,69,73": 193,
    "38,64,69,76": 194,
    "38,65": 195,
    "38,67,70,75": 196,
    "38,67,70,76": 197,
    "38,67,70,77": 198,
    "38,67,70,78": 199,
    "38,67,70,79": 200,
    "38,69": 201,
    "38,72,74": 202,
    "38,74": 203,
    "38,77": 204,
    "39": 205,
    "39,41,45,55,57": 206,
    "39,42,58,63,66": 207,
    "39,45,55,57": 208,
    "39,46,53,62,68": 209,
    "39,46,53,62,68,70": 210,
    "39,46,53,62,68,72": 211,
    "39,46,53,68,72,75": 212,
    "39,46,53,68,72,77": 213,
    "39,51,63": 214,
    "39,55,61": 215,
    "39,55,61,63": 216,
    "39,55,61,65": 217,
    "39,55,61,67": 218,
    "39,56,63": 219,
    "39,56,63,65": 220,
    "39,56,63,67": 221,
    "39,56,63,68": 222,
    "39,57,64,72,74": 223,
    "39,60,65": 224,
    "39,60,66": 225,
    "39,60,66,68": 226,
    "39,60,66,70": 227,
    "39,60,66,72": 228,
    "39,61,68": 229,
    "39,61,68,70": 230,
    "39,61,68,72": 231,
    "39,61,68,73": 232,
    "39,63,66": 233,
    "39,65,66,70": 234,
    "39,65,69": 235,
    "39,65,70": 236,
    "39,68,71": 237,
    "39,69,70,72": 238,
    "39,70,71,75": 239,
    "39,70,72,74": 240,
    "39,70,74": 241,
    "39,72,74": 242,
    "39,74": 243,
    "39,81,82,84": 244,
    "40": 245,
    "40,42,58,64,66": 246,
    "40,47": 247,
    "40,47,51,52,56,57,59,64": 248,
    "40,47,52,55,59": 249,
    "40,47,52,55,59,64": 250,
    "40,47,52,56,59,64": 251,
    "40,47,52,59": 252,
    "40,47,52,79,83,86,90": 253,
    "40,47,54,55,59,63,64": 254,
    "40,47,54,59": 255,
    "40,47,54,59,63": 256,
    "40,47,54,63": 257,
    "40,47,56,59,64": 258,
    "40,47,61,66,69": 259,
    "40,47,62,66,69": 260,
    "40,47,63,68,71": 261,
    "40,47,64": 262,
    "40,47,64,68,71": 263,
    "40,47,67,71,74,78": 264,
    "40,47,71": 265,
    "40,47,76": 266,
    "40,47,83": 267,
    "40,52": 268,
    "40,52,55,62,67": 269,
    "40,52,57,60,64": 270,
    "40,52,59,68": 271,
    "40,52,69,76,81": 272,
    "40,54,55,62,67": 273,
    "40,55,59,64": 274,
    "40,55,62,67": 275,
    "40,57,62,73": 276,
    "40,57,64,69": 277,
    "40,58": 278,
    "40,59,64,67": 279,
    "40,64": 280,
    "41": 281,
    "41,42,53,54": 282,
    "41,48": 283,
    "41,48,49,57,58,61,64,65,69": 284,
    "41,48,53,57": 285,
    "41,48,57,58,64,65,68,72": 286,
    "41,48,57,64,65": 287,
    "41,48,57,65": 288,
    "41,48,57,65,67": 289,
    "41,48,57,69": 290,
    "41,50,52,58,60,65,69": 291,
    "41,50,58,65,69": 292,
    "41,50,58,69": 293,
    "41,52,60,69": 294,
    "41,53": 295,
    "41,53,60,65,69": 296,
    "41,53,60,65,71": 297,
    "41,58": 298,
    "41,60,65,69": 299,
    "42": 300,
    "42,44,54,56": 301,
    "42,45,52,57,61,66": 302,
    "42,47,52,57,59,66": 303,
    "42,49,61": 304,
    "42,49,66,70,73": 305,
    "42,50,59,66": 306,
    "42,52,57,66": 307,
    "42,52,61,69": 308,
    "42,54": 309,
    "42,54,57,63,71": 310,
    "42,54,57,63,72": 311,
    "42,58": 312,
    "42,61": 313,
    "42,61,66,70,71,73,75": 314,
    "42,66,70,73": 315,
    "43": 316,
    "43,48,50,57,59,62,67": 317,
    "43,48,50,57,59,64,67": 318,
    "43,48,57,62": 319,
    "43,48,57,62,64": 320,
    "43,48,57,64,66": 321,
    "43,50": 322,
    "43,50,52,55,59,66": 323,
    "43,50,52,55,59,67": 324,
    "43,50,54,57,60,64": 325,
    "43,50,54,57,60,67": 326,
    "43,50,54,57,60,69": 327,
    "43,50,55,57,60,64": 328,
    "43,50,55,59,62,66": 329,
    "43,50,55,62,67,71,74": 330,
    "43,50,57,59,62,66": 331,
    "43,50,57,60,64": 332,
    "43,50,59,62,66": 333,
    "43,50,59,62,66,67": 334,
    "43,50,59,62,67": 335,
    "43,50,59,62,69": 336,
    "43,50,59,62,71": 337,
    "43,50,59,65,71": 338,
    "43,50,59,65,71,74": 339,
    "43,50,59,65,74,77": 340,
    "43,50,59,65,76,77": 341,
    "43,50,59,65,77": 342,
    "43,50,59,67": 343,
    "43,50,60,66,71,74": 344,
    "43,50,60,67": 345,
    "43,50,69,72,76,77": 346,
    "43,50,71": 347,
    "43,50,71,74": 348,
    "43,50,74,76": 349,
    "43,50,83,86,91": 350,
    "43,51,60,66,69": 351,
    "43,51,60,66,69,70": 352,
    "43,53,59,61,65,72,84": 353,
    "43,55": 354,
    "43,55,59,63,71": 355,
    "43,55,67": 356,
    "43,55,76,81,88": 357,
    "43,58": 358,
    "43,59,67,74": 359,
    "43,62,69,74": 360,
    "43,64,69,76": 361,
    "43,66,71,74": 362,
    "43,67": 363,
    "44": 364,
    "44,46,56,58": 365,
    "44,51,60,68": 366,
    "44,53,56,59,64": 367,
    "44,53,59,64": 368,
    "44,53,61,68": 369,
    "44,53,61,68,70": 370,
    "44,53,61,68,72": 371,
    "44,53,61,68,73": 372,
    "44,54,59,62,66,71,83": 373,
    "44,54,60,66": 374,
    "44,54,60,66,68": 375,
    "44,54,60,66,70": 376,
    "44,54,60,66,72": 377,
    "44,56": 378,
    "44,58": 379,
    "45": 380,
    "45,47,52,57,59,61": 381,
    "45,49,52,56,57,61,64": 382,
    "45,50,53,57": 383,
    "45,50,53,58": 384,
    "45,50,53,60": 385,
    "45,50,53,61": 386,
    "45,50,53,62": 387,
    "45,50,54,60,62": 388,
    "45,52": 389,
    "45,52,57,60,67,71": 390,
    "45,52,57,60,67,72": 391,
    "45,52,57,61": 392,
    "45,52,57,61,69": 393,
    "45,52,59,61,64": 394,
    "45,52,59,66": 395,
    "45,52,60": 396,
    "45,52,60,62,68,69,72,76": 397,
    "45,52,60,64": 398,
    "45,52,60,69": 399,
    "45,52,60,69,71": 400,
    "45,52,60,69,76": 401,
    "45,52,60,72": 402,
    "45,52,61": 403,
    "45,52,61,64": 404,
    "45,52,61,66": 405,
    "45,52,61,69": 406,
    "45,52,62,64": 407,
    "45,52,62,64,66": 408,
    "45,52,62,66": 409,
    "45,52,62,66,69": 410,
    "45,52,67,71,74": 411,
    "45,53,55,62,64,69,72": 412,
    "45,53,62,69,72": 413,
    "45,53,62,72": 414,
    "45,54,57,62,69,81": 415,
    "45,55,60,64": 416,
    "45,55,60,66": 417,
    "45,55,64,69,71": 418,
    "45,55,64,72": 419,
    "45,57": 420,
    "45,57,60,64": 421,
    "45,57,60,66": 422,
    "45,57,60,69,74": 423,
    "45,57,60,69,76": 424,
    "45,57,64": 425,
    "45,57,64,69": 426,
    "45,58": 427,
    "45,59,64,68": 428,
    "45,62,65,69": 429,
    "45,62,65,70": 430,
    "45,62,65,71": 431,
    "45,62,65,72": 432,
    "45,62,65,73": 433,
    "45,62,65,74": 434,
    "45,64": 435,
    "45,64,69,73": 436,
    "45,66": 437,
    "45,67": 438,
    "45,67,69": 439,
    "45,67,69,70": 440,
    "45,67,70,74": 441,
    "45,67,70,75": 442,
    "45,67,70,76": 443,
    "45,67,70,77": 444,
    "45,67,70,78": 445,
    "45,67,70,79": 446,
    "45,69": 447,
    "45,69,70,72": 448,
    "45,79": 449,
    "46": 450,
    "46,47,58,59": 451,
    "46,48": 452,
    "46,48,52,62,64": 453,
    "46,50,53,58": 454,
    "46,50,53,58,65": 455,
    "46,50,58,62,74": 456,
    "46,51,55,61": 457,
    "46,51,55,61,63": 458,
    "46,51,55,61,65": 459,
    "46,51,55,61,67": 460,
    "46,52,55,61,67": 461,
    "46,52,62": 462,
    "46,52,62,64": 463,
    "46,52,67": 464,
    "46,53": 465,
    "46,53,54,61,63,69,70,72,73": 466,
    "46,53,61,70": 467,
    "46,53,62,65": 468,
    "46,53,62,70,74": 469,
    "46,53,65": 470,
    "46,53,77,82": 471,
    "46,54,63,69,72": 472,
    "46,58": 473,
    "46,58,70": 474,
    "46,60,65": 475,
    "46,62,70,82": 476,
    "46,63,65": 477,
    "46,63,66": 478,
    "46,65,69": 479,
    "46,65,70": 480,
    "46,67": 481,
    "46,67,69": 482,
    "46,67,69,70": 483,
    "46,68,70": 484,
    "46,68,71": 485,
    "46,70,74": 486,
    "46,79": 487,
    "47": 488,
    "47,49,59,61": 489,
    "47,50,53,57": 490,
    "47,51,52,57,59,66": 491,
    "47,51,57,59,64": 492,
    "47,51,57,59,64,66": 493,
    "47,51,57,59,66": 494,
    "47,51,59,66": 495,
    "47,52,57,59,66": 496,
    "47,52,59,64": 497,
    "47,52,68": 498,
    "47,54,59,62,66": 499,
    "47,54,59,62,66,69": 500,
    "47,54,59,62,66,78": 501,
    "47,54,59,62,69,72": 502,
    "47,54,59,62,69,74": 503,
    "47,54,59,62,73": 504,
    "47,54,59,62,74": 505,
    "47,54,59,63": 506,
    "47,54,63,64,70,71": 507,
    "47,54,66": 508,
    "47,54,74,78,81": 509,
    "47,56,64,71,75": 510,
    "47,58": 511,
    "47,59": 512,
    "47,59,66,71,72": 513,
    "47,59,66,71,74": 514,
    "47,63,71": 515,
    "47,66": 516,
    "47,68": 517,
    "47,78": 518,
    "48": 519,
    "48,50,59,69": 520,
    "48,51,56,63": 521,
    "48,51,56,63,65": 522,
    "48,51,56,63,67": 523,
    "48,51,56,63,68": 524,
    "48,52,60,67,71": 525,
    "48,53,62,69,72": 526,
    "48,54,60,62,66,69": 527,
    "48,55": 528,
    "48,55,58,64,70,76": 529,
    "48,55,58,64,70,79,82": 530,
    "48,55,58,64,70,82": 531,
    "48,55,60,62,64,67": 532,
    "48,55,60,64,67": 533,
    "48,55,60,64,71,74": 534,
    "48,55,60,64,71,76": 535,
    "48,55,62,64,67": 536,
    "48,55,62,69": 537,
    "48,55,64,72": 538,
    "48,55,64,74": 539,
    "48,55,65,67,69": 540,
    "48,55,65,69": 541,
    "48,55,67": 542,
    "48,57,65,72": 543,
    "48,57,65,72,74": 544,
    "48,57,65,72,76": 545,
    "48,57,65,72,77": 546,
    "48,57,66,72": 547,
    "48,57,66,76": 548,
    "48,58": 549,
    "48,58,62,67": 550,
    "48,58,64,65,68,72": 551,
    "48,58,65,72": 552,
    "48,59,64,67": 553,
    "48,59,64,69": 554,
    "48,60": 555,
    "48,60,64,67": 556,
    "48,60,64,69": 557,
    "48,60,64,72,78": 558,
    "48,60,64,72,79": 559,
    "48,65,77": 560,
    "49,50,52,57,58,64": 561,
    "49,51,55,57,61": 562,
    "49,51,61,63": 563,
    "49,52,56,64": 564,
    "49,52,57,61": 565,
    "49,53,56,59,61": 566,
    "49,53,56,61": 567,
    "49,53,56,61,65,77": 568,
    "49,54,58,61": 569,
    "49,54,64,68,70": 570,
    "49,55": 571,
    "49,55,58,61": 572,
    "49,57,73,76": 573,
    "49,58": 574,
    "49,58,61,64,69": 575,
    "49,58,64,69": 576,
    "49,59,61,65,69,73": 577,
    "49,59,65": 578,
    "49,61": 579,
    "49,61,64,67,71": 580,
    "49,61,64,67,76": 581,
    "49,61,66,70,73": 582,
    "49,64,68": 583,
    "49,64,68,71": 584,
    "49,64,71": 585,
    "49,64,75": 586,
    "49,65": 587,
    "49,76,81": 588,
    "50": 589,
    "50,52,58,64": 590,
    "50,53,56": 591,
    "50,53,56,60": 592,
    "50,53,59": 593,
    "50,53,62,65,77": 594,
    "50,54,55,57": 595,
    "50,54,57,66": 596,
    "50,54,62": 597,
    "50,54,62,66,69": 598,
    "50,54,62,69": 599,
    "50,55,59,66": 600,
    "50,55,59,67": 601,
    "50,55,62,64,67,71": 602,
    "50,56,78": 603,
    "50,57": 604,
    "50,57,60,65": 605,
    "50,57,62,66": 606,
    "50,57,62,66,69": 607,
    "50,57,62,66,69,71": 608,
    "50,57,62,66,71": 609,
    "50,57,62,66,73": 610,
    "50,57,62,66,74": 611,
    "50,57,62,67": 612,
    "50,57,64,69": 613,
    "50,57,65,74": 614,
    "50,57,66,69,71": 615,
    "50,57,66,76": 616,
    "50,57,66,78": 617,
    "50,57,78": 618,
    "50,57,78,81": 619,
    "50,57,78,81,83": 620,
    "50,58": 621,
    "50,59,62": 622,
    "50,59,62,64,67": 623,
    "50,59,62,64,67,69": 624,
    "50,59,62,64,69": 625,
    "50,59,62,67": 626,
    "50,59,66": 627,
    "50,59,67": 628,
    "50,59,67,74,78": 629,
    "50,60,62,66,69,71,74": 630,
    "50,60,62,66,69,74": 631,
    "50,60,62,69,74": 632,
    "50,60,66": 633,
    "50,60,66,69": 634,
    "50,60,66,69,71": 635,
    "50,60,66,71,74": 636,
    "50,60,66,74,75": 637,
    "50,60,66,74,78": 638,
    "50,60,66,75,76": 639,
    "50,60,66,78,81": 640,
    "50,60,66,81": 641,
    "50,60,67,72,76,78": 642,
    "50,62": 643,
    "50,62,64,76": 644,
    "50,62,66,71": 645,
    "50,62,66,76": 646,
    "50,62,66,78": 647,
    "50,62,67,71,78": 648,
    "50,62,67,71,79": 649,
    "50,62,74": 650,
    "50,78": 651,
    "50,82,86,88": 652,
    "50,84,88,90": 653,
    "51,52,63,64": 654,
    "51,58,61,68,82,85": 655,
    "51,58,61,68,82,85,88": 656,
    "51,58,61,68,82,85,89": 657,
    "51,58,62,65,68,72": 658,
    "51,58,62,65,68,74": 659,
    "51,58,65,68,72,75": 660,
    "51,58,65,68,72,77": 661,
    "51,58,65,68,72,79": 662,
    "51,58,67,75": 663,
    "51,63": 664,
    "52": 665,
    "52,54,63,71": 666,
    "52,55,59,64": 667,
    "52,55,59,66": 668,
    "52,56,59,64": 669,
    "52,56,61,64": 670,
    "52,57,60,64": 671,
    "52,57,60,66": 672,
    "52,57,61,64": 673,
    "52,57,61,69,73,76,81": 674,
    "52,57,64": 675,
    "52,58,61,64": 676,
    "52,59": 677,
    "52,59,60,64": 678,
    "52,59,61,64": 679,
    "52,59,62,69,83,86,88": 680,
    "52,59,62,69,83,86,89": 681,
    "52,59,64,67,69,71": 682,
    "52,59,64,67,71": 683,
    "52,59,64,67,72": 684,
    "52,59,64,67,78": 685,
    "52,59,64,67,79": 686,
    "52,59,64,68,71": 687,
    "52,59,66,71": 688,
    "52,59,66,71,75": 689,
    "52,59,67,71": 690,
    "52,59,67,71,74,78": 691,
    "52,59,67,76": 692,
    "52,59,68,71,76": 693,
    "52,59,69,78,81": 694,
    "52,59,73,78": 695,
    "52,59,73,78,81": 696,
    "52,59,73,81": 697,
    "52,59,73,81,85": 698,
    "52,59,74,78,81": 699,
    "52,59,75,76": 700,
    "52,59,75,76,80": 701,
    "52,59,75,80,83": 702,
    "52,59,76": 703,
    "52,59,76,80": 704,
    "52,59,76,80,83": 705,
    "52,59,79,83,86,90": 706,
    "52,59,83": 707,
    "52,60": 708,
    "52,60,61,64": 709,
    "52,60,64": 710,
    "52,60,66": 711,
    "52,60,66,69": 712,
    "52,60,68": 713,
    "52,60,69": 714,
    "52,60,69,76": 715,
    "52,60,69,77,79": 716,
    "52,61,66,67": 717,
    "52,61,67": 718,
    "52,61,67,70": 719,
    "52,61,67,76": 720,
    "52,62": 721,
    "52,62,64,67": 722,
    "52,62,66": 723,
    "52,62,68": 724,
    "52,62,68,69,72,76": 725,
    "52,62,68,72": 726,
    "52,62,68,76": 727,
    "52,62,68,77": 728,
    "52,62,69,76": 729,
    "52,62,71": 730,
    "52,64": 731,
    "53,56,59": 732,
    "53,56,59,62,65": 733,
    "53,56,59,63": 734,
    "53,56,60,63": 735,
    "53,56,62": 736,
    "53,56,63,71": 737,
    "53,57,59,62": 738,
    "53,57,60,69": 739,
    "53,57,63,71": 740,
    "53,58": 741,
    "53,59,62,65": 742,
    "53,59,62,69": 743,
    "53,59,62,71": 744,
    "53,60": 745,
    "53,60,65,67,69": 746,
    "53,60,65,68": 747,
    "53,60,65,68,72": 748,
    "53,60,65,69": 749,
    "53,60,65,69,71": 750,
    "53,60,65,71": 751,
    "53,60,65,72": 752,
    "53,60,69,77": 753,
    "53,60,69,77,81": 754,
    "53,63,67,72": 755,
    "53,63,67,75": 756,
    "53,65,77": 757,
    "53,67,70,79": 758,
    "53,77": 759,
    "54,57,59,62,66,69": 760,
    "54,57,62": 761,
    "54,57,62,74,78,81,83": 762,
    "54,57,63,71": 763,
    "54,57,63,72": 764,
    "54,58": 765,
    "54,58,63,71": 766,
    "54,59": 767,
    "54,59,62,66": 768,
    "54,61": 769,
    "54,61,66,70": 770,
    "54,61,66,70,71,73,77": 771,
    "54,61,66,70,73": 772,
    "54,61,66,70,73,78": 773,
    "54,62": 774,
    "54,62,70,74,78,82": 775,
    "54,63,66": 776,
    "54,63,66,68,80": 777,
    "54,63,66,70,80": 778,
    "54,63,66,70,82": 779,
    "54,63,66,71,75,82": 780,
    "54,63,69": 781,
    "54,64,66,70,74,78": 782,
    "54,64,66,70,75,78": 783,
    "54,64,69,78": 784,
    "54,64,69,79": 785,
    "54,64,70": 786,
    "54,64,70,73": 787,
    "54,64,70,73,75": 788,
    "54,64,70,75": 789,
    "54,66,70,73,78": 790,
    "54,66,71,73,78": 791,
    "54,70": 792,
    "54,70,73,78": 793,
    "55,57,61,64,69": 794,
    "55,57,61,64,69,73,76,77,81": 795,
    "55,57,61,64,69,76": 796,
    "55,57,61,64,69,76,81": 797,
    "55,57,61,64,73,77,81": 798,
    "55,57,61,64,76": 799,
    "55,58": 800,
    "55,59,62,67": 801,
    "55,59,62,69": 802,
    "55,59,63,71": 803,
    "55,59,66,72": 804,
    "55,59,66,74": 805,
    "55,60,64,69": 806,
    "55,61,64": 807,
    "55,61,64,67": 808,
    "55,61,64,70": 809,
    "55,61,64,71": 810,
    "55,62": 811,
    "55,62,65,70,74,78,79": 812,
    "55,62,65,70,74,78,82": 813,
    "55,62,65,70,74,79,81": 814,
    "55,62,65,70,74,82,86": 815,
    "55,62,65,70,74,86": 816,
    "55,62,65,71": 817,
    "55,62,65,72": 818,
    "55,62,66,67": 819,
    "55,62,66,71": 820,
    "55,62,67,71": 821,
    "55,62,67,71,72,74": 822,
    "55,62,67,71,74": 823,
    "55,62,67,71,74,76": 824,
    "55,62,67,71,76": 825,
    "55,62,67,71,78": 826,
    "55,62,69,72,76,78": 827,
    "55,62,71,76,79": 828,
    "55,62,71,79": 829,
    "55,62,71,81": 830,
    "55,62,74,76": 831,
    "55,62,83,86": 832,
    "55,64,66,71,76": 833,
    "55,64,66,71,78": 834,
    "55,64,67,72": 835,
    "55,64,67,74": 836,
    "55,64,70": 837,
    "55,66,69,71": 838,
    "55,66,69,74": 839,
    "55,67,71,76": 840,
    "55,67,71,78": 841,
    "55,67,74,76,79": 842,
    "55,73,77,81": 843,
    "55,76": 844,
    "55,76,79": 845,
    "55,84,90": 846,
    "56,58": 847,
    "56,59,62": 848,
    "56,59,62,66": 849,
    "56,59,65": 850,
    "56,59,68,78": 851,
    "56,60,64": 852,
    "56,62,65,68": 853,
    "56,63,72,80,84": 854,
    "56,64,66,71,76": 855,
    "56,66,68,73,75": 856,
    "56,66,75": 857,
    "56,68": 858,
    "56,68,71": 859,
    "56,68,71,73": 860,
    "56,68,73": 861,
    "56,68,80": 862,
    "57": 863,
    "57,58": 864,
    "57,60,64,72": 865,
    "57,60,67,74": 866,
    "57,60,67,76": 867,
    "57,60,69,74": 868,
    "57,60,69,76": 869,
    "57,61,64,69": 870,
    "57,61,64,69,73,76,81": 871,
    "57,61,69": 872,
    "57,62": 873,
    "57,62,65,72": 874,
    "57,62,66,69": 875,
    "57,62,66,74,78,81,83": 876,
    "57,62,66,74,78,81,86": 877,
    "57,63,66,72": 878,
    "57,63,85": 879,
    "57,64,67,71,74": 880,
    "57,64,67,71,76": 881,
    "57,64,67,72": 882,
    "57,64,67,72,76": 883,
    "57,64,69,72": 884,
    "57,64,69,73": 885,
    "57,64,69,73,81": 886,
    "57,64,74,76,81": 887,
    "57,64,79,83,86": 888,
    "57,65,69,73,81": 889,
    "57,66": 890,
    "57,67,73,77": 891,
    "57,69": 892,
    "57,85": 893,
    "58": 894,
    "58,61": 895,
    "58,62": 896,
    "58,62,65,70": 897,
    "58,64,67": 898,
    "58,64,67,73": 899,
    "58,64,67,73,76": 900,
    "58,64,71,80,83": 901,
    "58,65,70,74,77": 902,
    "58,65,74,77": 903,
    "58,65,77": 904,
    "58,66": 905,
    "59,61,65,69,73": 906,
    "59,62": 907,
    "59,62,65": 908,
    "59,62,65,68,71,74": 909,
    "59,62,66,67,79,83,86,90": 910,
    "59,62,66,71": 911,
    "59,62,66,72": 912,
    "59,62,66,74": 913,
    "59,62,67,79,91": 914,
    "59,62,67,83,86,91": 915,
    "59,62,68": 916,
    "59,62,68,75": 917,
    "59,63,66,71": 918,
    "59,63,67": 919,
    "59,64,67": 920,
    "59,64,67,71": 921,
    "59,64,67,74,76": 922,
    "59,65,68,73": 923,
    "59,66,67,71,74": 924,
    "59,66,67,73,74": 925,
    "59,66,67,73,76": 926,
    "59,66,67,74,78": 927,
    "59,66,67,74,78,79": 928,
    "59,66,67,74,79": 929,
    "59,66,67,76,78": 930,
    "59,66,67,76,79": 931,
    "59,66,67,76,81": 932,
    "59,66,67,78,81": 933,
    "59,66,68,69": 934,
    "59,66,71": 935,
    "59,66,71,73": 936,
    "59,66,71,74,78": 937,
    "59,66,71,74,86": 938,
    "59,66,71,75": 939,
    "59,66,71,75,78": 940,
    "59,66,71,76": 941,
    "59,66,71,78,83": 942,
    "59,66,71,78,83,90,95": 943,
    "59,66,73,75,78": 944,
    "59,66,74,78": 945,
    "59,66,75,78": 946,
    "59,71": 947,
    "59,71,75,78": 948,
    "59,78": 949,
    "60,64": 950,
    "60,64,67,70,78": 951,
    "60,64,67,76": 952,
    "60,64,72,78": 953,
    "60,64,72,79": 954,
    "60,65,67,69,72,77,79,81": 955,
    "60,65,68,76": 956,
    "60,65,69": 957,
    "60,66,69,76": 958,
    "60,66,70": 959,
    "60,66,70,76": 960,
    "60,66,71,74": 961,
    "60,66,71,84,88,90": 962,
    "60,67": 963,
    "60,67,71,74": 964,
    "60,67,72,74": 965,
    "60,67,72,75": 966,
    "60,67,72,75,79": 967,
    "60,67,72,76": 968,
    "60,67,72,79": 969,
    "60,67,74,76,79": 970,
    "60,67,76,79": 971,
    "60,67,76,84": 972,
    "60,67,77,81": 973,
    "61": 974,
    "61,62,64,69,70,76": 975,
    "61,62,65,66,68,70,73,74": 976,
    "61,64,67,71": 977,
    "61,64,67,76": 978,
    "61,64,69": 979,
    "61,64,69,73,76,81": 980,
    "61,65,68,73": 981,
    "61,66,69,73": 982,
    "61,66,70,73": 983,
    "61,66,70,73,78,82": 984,
    "61,66,70,73,78,82,85": 985,
    "61,66,71,75,77": 986,
    "61,67": 987,
    "61,67,70,76,79": 988,
    "61,68,76": 989,
    "61,70": 990,
    "61,73": 991,
    "61,82,85,88": 992,
    "62": 993,
    "62,64,66,69": 994,
    "62,64,67": 995,
    "62,64,70,76": 996,
    "62,65": 997,
    "62,65,69,72,76": 998,
    "62,65,71": 999,
    "62,66,67,69": 1000,
    "62,66,67,71,79,83,86,90": 1001,
    "62,66,69,74": 1002,
    "62,66,69,74,78,81,83": 1003,
    "62,66,69,74,78,81,86": 1004,
    "62,66,71,74,78": 1005,
    "62,66,71,74,79": 1006,
    "62,67,70,77,79": 1007,
    "62,67,71,74": 1008,
    "62,67,71,74,76,79": 1009,
    "62,67,76": 1010,
    "62,69": 1011,
    "62,69,74,78,81": 1012,
    "62,69,74,78,85": 1013,
    "62,69,74,78,86": 1014,
    "62,69,78,81,83": 1015,
    "62,69,78,88": 1016,
    "62,69,78,90": 1017,
    "62,69,79,81,86": 1018,
    "62,70": 1019,
    "62,70,74,78,86": 1020,
    "62,71,74": 1021,
    "62,71,74,78": 1022,
    "62,71,76,79": 1023,
    "62,74,78": 1024,
    "62,77,78": 1025,
    "63": 1026,
    "63,66,70,72,78,87": 1027,
    "63,66,70,75": 1028,
    "63,66,71": 1029,
    "63,66,72,79": 1030,
    "63,66,75,85": 1031,
    "63,67,70,73,79": 1032,
    "63,70": 1033,
    "63,70,75,78": 1034,
    "63,70,75,78,82": 1035,
    "63,70,75,82": 1036,
    "63,70,75,82,87": 1037,
    "63,70,79,87,91": 1038,
    "64": 1039,
    "64,65,69,71,74": 1040,
    "64,66": 1041,
    "64,66,69,73": 1042,
    "64,66,70,73,78": 1043,
    "64,66,70,73,79": 1044,
    "64,66,70,74,78": 1045,
    "64,66,70,75,78": 1046,
    "64,67": 1047,
    "64,67,69": 1048,
    "64,67,69,71": 1049,
    "64,67,69,72,76": 1050,
    "64,67,71": 1051,
    "64,67,71,72": 1052,
    "64,67,71,74": 1053,
    "64,67,71,76": 1054,
    "64,67,72,76,79": 1055,
    "64,67,72,76,81": 1056,
    "64,67,76": 1057,
    "64,67,76,79": 1058,
    "64,68,69,74,76": 1059,
    "64,68,71": 1060,
    "64,68,71,76": 1061,
    "64,68,74,76": 1062,
    "64,69,76": 1063,
    "64,69,76,78": 1064,
    "64,69,85": 1065,
    "64,70": 1066,
    "64,70,73,78": 1067,
    "64,70,73,79,82": 1068,
    "64,70,74": 1069,
    "64,71": 1070,
    "64,71,74,78": 1071,
    "64,71,75,78": 1072,
    "64,71,76,78": 1073,
    "64,71,76,79,83": 1074,
    "64,71,76,79,91": 1075,
    "64,71,76,80": 1076,
    "64,71,78,80,83": 1077,
    "64,71,79,83,86,90": 1078,
    "64,71,80,83": 1079,
    "64,71,81,85": 1080,
    "64,72": 1081,
    "64,76": 1082,
    "64,78": 1083,
    "65": 1084,
    "65,67": 1085,
    "65,67,69,71,74": 1086,
    "65,67,71,75,79": 1087,
    "65,67,71,75,81": 1088,
    "65,68,71": 1089,
    "65,68,74": 1090,
    "65,69,72": 1091,
    "65,69,72,77": 1092,
    "65,69,72,77,79,81,84,87": 1093,
    "65,69,72,77,81": 1094,
    "65,69,72,77,81,84,89,93": 1095,
    "65,69,74,77,81": 1096,
    "65,69,74,77,82": 1097,
    "65,70,73,80,82": 1098,
    "65,72": 1099,
    "65,72,77,81,84": 1100,
    "65,72,81,89": 1101,
    "65,72,81,89,93": 1102,
    "65,72,84": 1103,
    "66": 1104,
    "66,67,69,74": 1105,
    "66,68": 1106,
    "66,69,70": 1107,
    "66,69,74": 1108,
    "66,70": 1109,
    "66,70,71,75,78": 1110,
    "66,70,73": 1111,
    "66,70,73,78": 1112,
    "66,70,73,78,82": 1113,
    "66,70,73,79,82": 1114,
    "66,71,73": 1115,
    "66,71,74": 1116,
    "66,71,74,78": 1117,
    "66,71,75": 1118,
    "66,71,75,78": 1119,
    "66,72,75,78": 1120,
    "66,73,74": 1121,
    "66,73,75": 1122,
    "66,73,75,76": 1123,
    "66,73,76": 1124,
    "66,73,78,80": 1125,
    "66,73,80,82,85": 1126,
    "66,73,82,85": 1127,
    "66,74": 1128,
    "66,75,78": 1129,
    "66,78": 1130,
    "67": 1131,
    "67,69": 1132,
    "67,69,71,72,76": 1133,
    "67,69,72,74,78,79,81": 1134,
    "67,69,73,76,81": 1135,
    "67,69,73,76,82": 1136,
    "67,69,74,78,81": 1137,
    "67,70": 1138,
    "67,70,73": 1139,
    "67,70,75,79,82": 1140,
    "67,70,75,79,84": 1141,
    "67,71": 1142,
    "67,71,73": 1143,
    "67,71,74": 1144,
    "67,71,74,79": 1145,
    "67,71,76": 1146,
    "67,72,74,79,81": 1147,
    "67,72,74,79,81,86": 1148,
    "67,73": 1149,
    "67,73,76": 1150,
    "67,74": 1151,
    "67,74,79,82,86": 1152,
    "67,74,79,83": 1153,
    "67,74,79,83,86": 1154,
    "67,74,79,83,90": 1155,
    "67,74,82,86": 1156,
    "67,74,83,91": 1157,
    "67,74,83,93": 1158,
    "67,74,83,95": 1159,
    "68": 1160,
    "68,69,73,77,81": 1161,
    "68,70,74,78,82": 1162,
    "68,70,74,78,84": 1163,
    "68,71,74": 1164,
    "68,71,75,80": 1165,
    "68,71,77": 1166,
    "68,72,76": 1167,
    "68,72,76,80": 1168,
    "68,73,76": 1169,
    "68,73,77,80": 1170,
    "69": 1171,
    "69,70": 1172,
    "69,71,73,76": 1173,
    "69,71,74,78": 1174,
    "69,72": 1175,
    "69,72,77": 1176,
    "69,73": 1177,
    "69,73,76": 1178,
    "69,73,76,81": 1179,
    "69,73,77,81": 1180,
    "69,74,78,81": 1181,
    "69,76,79,83,88": 1182,
    "70": 1183,
    "70,71": 1184,
    "70,71,75,78": 1185,
    "70,72": 1186,
    "70,73": 1187,
    "70,73,78": 1188,
    "70,73,78,82": 1189,
    "70,73,78,82,85": 1190,
    "70,74,77": 1191,
    "70,74,77,79": 1192,
    "70,74,78,82": 1193,
    "70,74,79": 1194,
    "70,75,78,82": 1195,
    "70,76": 1196,
    "70,77": 1197,
    "70,77,82,85": 1198,
    "70,77,82,85,89": 1199,
    "70,77,82,89": 1200,
    "70,78": 1201,
    "71": 1202,
    "71,72": 1203,
    "71,72,74,76,79": 1204,
    "71,73": 1205,
    "71,73,76": 1206,
    "71,73,77,83": 1207,
    "71,73,78": 1208,
    "71,74": 1209,
    "71,74,78,83": 1210,
    "71,74,79": 1211,
    "71,74,80": 1212,
    "71,75": 1213,
    "71,75,79": 1214,
    "71,76": 1215,
    "71,76,79": 1216,
    "71,78": 1217,
    "71,78,83,85": 1218,
    "71,78,83,90,95": 1219,
    "71,78,85,87,90": 1220,
    "71,79,83": 1221,
    "71,79,83,85": 1222,
    "72": 1223,
    "72,73": 1224,
    "72,74": 1225,
    "72,76": 1226,
    "72,76,77": 1227,
    "72,76,77,81,84": 1228,
    "72,76,79": 1229,
    "72,77,79,81,84,89,91,93": 1230,
    "72,79": 1231,
    "72,79,84,87": 1232,
    "72,79,84,87,91": 1233,
    "72,79,84,91": 1234,
    "73": 1235,
    "73,74": 1236,
    "73,74,78": 1237,
    "73,75,78,82,85,87": 1238,
    "73,76": 1239,
    "73,76,77": 1240,
    "73,76,81": 1241,
    "73,77,80,85": 1242,
    "73,77,81,82": 1243,
    "73,78,82,85": 1244,
    "73,81": 1245,
    "73,85": 1246,
    "74": 1247,
    "74,75": 1248,
    "74,76": 1249,
    "74,76,77,79,83": 1250,
    "74,77": 1251,
    "74,77,79,83,86": 1252,
    "74,77,81,82": 1253,
    "74,78": 1254,
    "74,78,80": 1255,
    "74,78,81,86": 1256,
    "74,81": 1257,
    "75": 1258,
    "75,76": 1259,
    "75,78,82,87": 1260,
    "75,79": 1261,
    "75,79,80": 1262,
    "75,79,84": 1263,
    "76": 1264,
    "76,77,79,81,84": 1265,
    "76,79": 1266,
    "76,79,81,84,88": 1267,
    "76,79,84": 1268,
    "76,80": 1269,
    "76,81": 1270,
    "77": 1271,
    "77,78": 1272,
    "77,79": 1273,
    "77,79,81,83,86": 1274,
    "77,81,84,86": 1275,
    "77,81,84,89,93": 1276,
    "78": 1277,
    "78,80": 1278,
    "78,82,85": 1279,
    "79": 1280,
    "79,81,83,84,88": 1281,
    "79,82": 1282,
    "79,82,86": 1283,
    "79,83": 1284,
    "79,83,85": 1285,
    "79,83,86": 1286,
    "79,83,86,88": 1287,
    "79,83,88": 1288,
    "79,84,86": 1289,
    "79,84,88": 1290,
    "79,86": 1291,
    "79,86,88": 1292,
    "79,88": 1293,
    "80,81": 1294,
    "81": 1295,
    "81,82": 1296,
    "81,84": 1297,
    "81,84,88,89": 1298,
    "81,85": 1299,
    "82": 1300,
    "82,83": 1301,
    "83": 1302,
    "83,84,86,88,91": 1303,
    "83,86": 1304,
    "83,88": 1305,
    "84": 1306,
    "84,86": 1307,
    "84,88": 1308,
    "84,88,91": 1309,
    "85": 1310,
    "85,86": 1311,
    "86": 1312,
    "86,87": 1313,
    "86,88": 1314,
    "86,88,89,91,95": 1315,
    "86,88,91": 1316,
    "88": 1317,
    "88,91": 1318,
    "90,94": 1319,
    "90,95": 1320,
    "92,94": 1321,
    "92,95": 1322,
    "rest": 1323,
    "<UNK>": 0
  },
  "id_to_token": {
    "1": "102",
    "2": "21",
    "3": "26,33,38,74,78,81,86",
    "4": "28",
    "5": "28,40,45,49,52,55,57,61,67,69",
    "6": "28,40,52",
    "7": "28,40,55,59,64",
    "8": "28,52,57,61,67,69,73,79,81",
    "9": "28,52,64,69,73,79,81,85,91,93",
    "10": "28,52,81,83",
    "11": "29,32,41,48,51,53,56,60,63",
    "12": "29,32,41,49,51,53,56,61,63",
    "13": "29,32,41,51,53,56,63",
    "14": "29,36,41",
    "15": "29,36,41,48,52,53,57,60,64",
    "16": "29,36,41,50,52,53,57,62,64",
    "17": "29,36,41,52,53,57,64",
    "18": "29,41,44,47,51,53,56,59,63,68",
    "19": "29,41,53",
    "20": "29,41,53,56,59,63,68,71,75,80",
    "21": "29,41,53,68,71,75,80,83,87,92",
    "22": "30,42,44,48,51,54,56,60,63,68",
    "23": "30,42,49,54,58,61,66",
    "24": "30,42,54",
    "25": "30,42,54,56,60,63,68,72,75,80",
    "26": "30,42,54,68,72,75,80,84,87,92",
    "27": "31,38",
    "28": "31,38,59,67",
    "29": "31,43,44,48,51,55,56,60,63,68",
    "30": "31,43,55",
    "31": "31,43,55,56,60,63,68,72,75,80",
    "32": "31,43,55,68,72,75,80,84,87,92",
    "33": "31,50,58,62",
    "34": "32",
    "35": "32,34,47,50,53",
    "36": "32,36,44,48,60",
    "37": "32,39,44,48,60",
    "38": "32,39,44,51,56,60,63",
    "39": "32,44,56",
    "40": "33",
    "41": "33,38,45,55,59,62",
    "42": "33,38,45,62,66,69",
    "43": "33,38,45,79,83,86",
    "44": "33,40",
    "45": "33,40,45,69,74,76,81",
    "46": "33,40,62,64,69",
    "47": "33,45",
    "48": "33,45,55,60,64",
    "49": "33,45,55,60,66",
    "50": "33,45,55,61,64",
    "51": "33,45,55,61,64,66",
    "52": "33,45,55,61,66",
    "53": "33,45,71,76,80",
    "54": "33,45,74,77,81",
    "55": "33,45,74,77,82",
    "56": "33,45,74,77,84",
    "57": "33,45,74,77,85",
    "58": "33,45,74,77,86",
    "59": "33,45,76,81,85",
    "60": "33,45,79,82,86",
    "61": "33,45,79,82,87",
    "62": "33,45,79,82,88",
    "63": "33,45,79,82,89",
    "64": "33,45,79,82,90",
    "65": "33,45,79,82,91",
    "66": "33,59,67,72,78",
    "67": "33,67,71,74",
    "68": "34,35,47,50,53",
    "69": "34,53,61,65",
    "70": "34,63,65",
    "71": "34,65,69",
    "72": "34,66,70",
    "73": "34,68,70",
    "74": "34,70,74",
    "75": "34,71,75",
    "76": "35",
    "77": "35,37,50,53,56",
    "78": "35,42",
    "79": "35,42,43,59,62",
    "80": "35,42,43,61,62",
    "81": "35,42,43,61,64",
    "82": "35,42,43,62,64",
    "83": "35,42,43,62,66",
    "84": "35,42,43,62,66,67",
    "85": "35,42,43,62,67",
    "86": "35,42,43,64,67",
    "87": "35,42,43,64,69",
    "88": "35,42,43,66,69",
    "89": "35,42,49,54",
    "90": "35,42,49,54,58",
    "91": "35,42,49,58",
    "92": "35,42,51,54,59",
    "93": "35,42,52,61,64",
    "94": "35,42,54,62",
    "95": "35,42,56,61",
    "96": "35,42,56,61,64",
    "97": "35,42,56,64",
    "98": "35,42,56,64,68",
    "99": "35,42,58,59",
    "100": "35,42,58,59,63",
    "101": "35,42,58,63",
    "102": "35,42,58,63,66",
    "103": "35,42,59",
    "104": "35,42,59,63",
    "105": "35,42,59,63,66",
    "106": "35,42,62,66",
    "107": "35,42,62,66,69",
    "108": "35,47,54,59,63",
    "109": "35,47,57,62,66,69,78",
    "110": "35,47,57,63,66,69,78",
    "111": "35,54,62,71",
    "112": "35,59",
    "113": "35,66",
    "114": "36",
    "115": "36,42,57,60,66",
    "116": "36,43",
    "117": "36,43,44,52,53,56,59,60,64",
    "118": "36,43,44,52,53,56,59,62,64",
    "119": "36,43,48",
    "120": "36,43,48,52,55,60,64",
    "121": "36,43,48,60",
    "122": "36,43,52,59,60",
    "123": "36,43,52,60",
    "124": "36,43,64,72",
    "125": "36,45,47,53,62,64",
    "126": "36,45,53,60,64",
    "127": "36,47,48,55,59,60",
    "128": "36,47,55,59,62",
    "129": "36,47,55,62,64",
    "130": "36,47,60",
    "131": "36,47,60,62",
    "132": "36,48",
    "133": "36,48,55,58,65,82,85",
    "134": "36,48,55,58,65,82,85,90",
    "135": "36,48,55,58,65,82,85,91",
    "136": "36,48,59,64,67",
    "137": "36,48,59,64,69",
    "138": "36,48,60",
    "139": "36,52,67",
    "140": "37,38,50,53,56",
    "141": "37,42,58,61,66",
    "142": "37,44,49,52,56,61,64",
    "143": "38",
    "144": "38,42,58,62,66",
    "145": "38,45",
    "146": "38,45,50,74,78,81,83",
    "147": "38,45,50,74,79,81,86",
    "148": "38,45,50,74,81,86",
    "149": "38,45,54,62",
    "150": "38,45,66,69",
    "151": "38,45,66,69,71",
    "152": "38,45,67,69,74",
    "153": "38,45,67,71,74",
    "154": "38,45,69,74",
    "155": "38,50",
    "156": "38,50,53,57",
    "157": "38,50,53,58",
    "158": "38,50,53,59",
    "159": "38,50,53,60",
    "160": "38,50,53,61",
    "161": "38,50,53,62",
    "162": "38,50,57,62,66",
    "163": "38,50,57,62,67",
    "164": "38,50,60,66,69",
    "165": "38,50,60,66,69,71",
    "166": "38,50,60,66,71",
    "167": "38,50,69,76,81",
    "168": "38,50,71,76,80",
    "169": "38,50,74,77,82",
    "170": "38,50,74,77,84",
    "171": "38,50,74,77,85",
    "172": "38,50,74,77,86",
    "173": "38,50,76,81,85",
    "174": "38,50,76,81,88",
    "175": "38,50,77",
    "176": "38,50,79,82,87",
    "177": "38,50,79,82,88",
    "178": "38,50,79,82,89",
    "179": "38,50,79,82,90",
    "180": "38,50,79,82,91",
    "181": "38,50,81",
    "182": "38,50,82,84,86",
    "183": "38,50,86",
    "184": "38,50,89",
    "185": "38,54,62,74",
    "186": "38,57,64,69",
    "187": "38,59,64,68",
    "188": "38,62,65,70",
    "189": "38,62,65,71",
    "190": "38,62,65,72",
    "191": "38,62,65,73",
    "192": "38,62,65,74",
    "193": "38,64,69,73",
    "194": "38,64,69,76",
    "195": "38,65",
    "196": "38,67,70,75",
    "197": "38,67,70,76",
    "198": "38,67,70,77",
    "199": "38,67,70,78",
    "200": "38,67,70,79",
    "201": "38,69",
    "202": "38,72,74",
    "203": "38,74",
    "204": "38,77",
    "205": "39",
    "206": "39,41,45,55,57",
    "207": "39,42,58,63,66",
    "208": "39,45,55,57",
    "209": "39,46,53,62,68",
    "210": "39,46,53,62,68,70",
    "211": "39,46,53,62,68,72",
    "212": "39,46,53,68,72,75",
    "213": "39,46,53,68,72,77",
    "214": "39,51,63",
    "215": "39,55,61",
    "216": "39,55,61,63",
    "217": "39,55,61,65",
    "218": "39,55,61,67",
    "219": "39,56,63",
    "220": "39,56,63,65",
    "221": "39,56,63,67",
    "222": "39,56,63,68",
    "223": "39,57,64,72,74",
    "224": "39,60,65",
    "225": "39,60,66",
    "226": "39,60,66,68",
    "227": "39,60,66,70",
    "228": "39,60,66,72",
    "229": "39,61,68",
    "230": "39,61,68,70",
    "231": "39,61,68,72",
    "232": "39,61,68,73",
    "233": "39,63,66",
    "234": "39,65,66,70",
    "235": "39,65,69",
    "236": "39,65,70",
    "237": "39,68,71",
    "238": "39,69,70,72",
    "239": "39,70,71,75",
    "240": "39,70,72,74",
    "241": "39,70,74",
    "242": "39,72,74",
    "243": "39,74",
    "244": "39,81,82,84",
    "245": "40",
    "246": "40,42,58,64,66",
    "247": "40,47",
    "248": "40,47,51,52,56,57,59,64",
    "249": "40,47,52,55,59",
    "250": "40,47,52,55,59,64",
    "251": "40,47,52,56,59,64",
    "252": "40,47,52,59",
    "253": "40,47,52,79,83,86,90",
    "254": "40,47,54,55,59,63,64",
    "255": "40,47,54,59",
    "256": "40,47,54,59,63",
    "257": "40,47,54,63",
    "258": "40,47,56,59,64",
    "259": "40,47,61,66,69",
    "260": "40,47,62,66,69",
    "261": "40,47,63,68,71",
    "262": "40,47,64",
    "263": "40,47,64,68,71",
    "264": "40,47,67,71,74,78",
    "265": "40,47,71",
    "266": "40,47,76",
    "267": "40,47,83",
    "268": "40,52",
    "269": "40,52,55,62,67",
    "270": "40,52,57,60,64",
    "271": "40,52,59,68",
    "272": "40,52,69,76,81",
    "273": "40,54,55,62,67",
    "274": "40,55,59,64",
    "275": "40,55,62,67",
    "276": "40,57,62,73",
    "277": "40,57,64,69",
    "278": "40,58",
    "279": "40,59,64,67",
    "280": "40,64",
    "281": "41",
    "282": "41,42,53,54",
    "283": "41,48",
    "284": "41,48,49,57,58,61,64,65,69",
    "285": "41,48,53,57",
    "286": "41,48,57,58,64,65,68,72",
    "287": "41,48,57,64,65",
    "288": "41,48,57,65",
    "289": "41,48,57,65,67",
    "290": "41,48,57,69",
    "291": "41,50,52,58,60,65,69",
    "292": "41,50,58,65,69",
    "293": "41,50,58,69",
    "294": "41,52,60,69",
    "295": "41,53",
    "296": "41,53,60,65,69",
    "297": "41,53,60,65,71",
    "298": "41,58",
    "299": "41,60,65,69",
    "300": "42",
    "301": "42,44,54,56",
    "302": "42,45,52,57,61,66",
    "303": "42,47,52,57,59,66",
    "304": "42,49,61",
    "305": "42,49,66,70,73",
    "306": "42,50,59,66",
    "307": "42,52,57,66",
    "308": "42,52,61,69",
    "309": "42,54",
    "310": "42,54,57,63,71",
    "311": "42,54,57,63,72",
    "312": "42,58",
    "313": "42,61",
    "314": "42,61,66,70,71,73,75",
    "315": "42,66,70,73",
    "316": "43",
    "317": "43,48,50,57,59,62,67",
    "318": "43,48,50,57,59,64,67",
    "319": "43,48,57,62",
    "320": "43,48,57,62,64",
    "321": "43,48,57,64,66",
    "322": "43,50",
    "323": "43,50,52,55,59,66",
    "324": "43,50,52,55,59,67",
    "325": "43,50,54,57,60,64",
    "326": "43,50,54,57,60,67",
    "327": "43,50,54,57,60,69",
    "328": "43,50,55,57,60,64",
    "329": "43,50,55,59,62,66",
    "330": "43,50,55,62,67,71,74",
    "331": "43,50,57,59,62,66",
    "332": "43,50,57,60,64",
    "333": "43,50,59,62,66",
    "334": "43,50,59,62,66,67",
    "335": "43,50,59,62,67",
    "336": "43,50,59,62,69",
    "337": "43,50,59,62,71",
    "338": "43,50,59,65,71",
    "339": "43,50,59,65,71,74",
    "340": "43,50,59,65,74,77",
    "341": "43,50,59,65,76,77",
    "342": "43,50,59,65,77",
    "343": "43,50,59,67",
    "344": "43,50,60,66,71,74",
    "345": "43,50,60,67",
    "346": "43,50,69,72,76,77",
    "347": "43,50,71",
    "348": "43,50,71,74",
    "349": "43,50,74,76",
    "350": "43,50,83,86,91",
    "351": "43,51,60,66,69",
    "352": "43,51,60,66,69,70",
    "353": "43,53,59,61,65,72,84",
    "354": "43,55",
    "355": "43,55,59,63,71",
    "356": "43,55,67",
    "357": "43,55,76,81,88",
    "358": "43,58",
    "359": "43,59,67,74",
    "360": "43,62,69,74",
    "361": "43,64,69,76",
    "362": "43,66,71,74",
    "363": "43,67",
    "364": "44",
    "365": "44,46,56,58",
    "366": "44,51,60,68",
    "367": "44,53,56,59,64",
    "368": "44,53,59,64",
    "369": "44,53,61,68",
    "370": "44,53,61,68,70",
    "371": "44,53,61,68,72",
    "372": "44,53,61,68,73",
    "373": "44,54,59,62,66,71,83",
    "374": "44,54,60,66",
    "375": "44,54,60,66,68",
    "376": "44,54,60,66,70",
    "377": "44,54,60,66,72",
    "378": "44,56",
    "379": "44,58",
    "380": "45",
    "381": "45,47,52,57,59,61",
    "382": "45,49,52,56,57,61,64",
    "383": "45,50,53,57",
    "384": "45,50,53,58",
    "385": "45,50,53,60",
    "386": "45,50,53,61",
    "387": "45,50,53,62",
    "388": "45,50,54,60,62",
    "389": "45,52",
    "390": "45,52,57,60,67,71",
    "391": "45,52,57,60,67,72",
    "392": "45,52,57,61",
    "393": "45,52,57,61,69",
    "394": "45,52,59,61,64",
    "395": "45,52,59,66",
    "396": "45,52,60",
    "397": "45,52,60,62,68,69,72,76",
    "398": "45,52,60,64",
    "399": "45,52,60,69",
    "400": "45,52,60,69,71",
    "401": "45,52,60,69,76",
    "402": "45,52,60,72",
    "403": "45,52,61",
    "404": "45,52,61,64",
    "405": "45,52,61,66",
    "406": "45,52,61,69",
    "407": "45,52,62,64",
    "408": "45,52,62,64,66",
    "409": "45,52,62,66",
    "410": "45,52,62,66,69",
    "411": "45,52,67,71,74",
    "412": "45,53,55,62,64,69,72",
    "413": "45,53,62,69,72",
    "414": "45,53,62,72",
    "415": "45,54,57,62,69,81",
    "416": "45,55,60,64",
    "417": "45,55,60,66",
    "418": "45,55,64,69,71",
    "419": "45,55,64,72",
    "420": "45,57",
    "421": "45,57,60,64",
    "422": "45,57,60,66",
    "423": "45,57,60,69,74",
    "424": "45,57,60,69,76",
    "425": "45,57,64",
    "426": "45,57,64,69",
    "427": "45,58",
    "428": "45,59,64,68",
    "429": "45,62,65,69",
    "430": "45,62,65,70",
    "431": "45,62,65,71",
    "432": "45,62,65,72",
    "433": "45,62,65,73",
    "434": "45,62,65,74",
    "435": "45,64",
    "436": "45,64,69,73",
    "437": "45,66",
    "438": "45,67",
    "439": "45,67,69",
    "440": "45,67,69,70",
    "441": "45,67,70,74",
    "442": "45,67,70,75",
    "443": "45,67,70,76",
    "444": "45,67,70,77",
    "445": "45,67,70,78",
    "446": "45,67,70,79",
    "447": "45,69",
    "448": "45,69,70,72",
    "449": "45,79",
    "450": "46",
    "451": "46,47,58,59",
    "452": "46,48",
    "453": "46,48,52,62,64",
    "454": "46,50,53,58",
    "455": "46,50,53,58,65",
    "456": "46,50,58,62,74",
    "457": "46,51,55,61",
    "458": "46,51,55,61,63",
    "459": "46,51,55,61,65",
    "460": "46,51,55,61,67",
    "461": "46,52,55,61,67",
    "462": "46,52,62",
    "463": "46,52,62,64",
    "464": "46,52,67",
    "465": "46,53",
    "466": "46,53,54,61,63,69,70,72,73",
    "467": "46,53,61,70",
    "468": "46,53,62,65",
    "469": "46,53,62,70,74",
    "470": "46,53,65",
    "471": "46,53,77,82",
    "472": "46,54,63,69,72",
    "473": "46,58",
    "474": "46,58,70",
    "475": "46,60,65",
    "476": "46,62,70,82",
    "477": "46,63,65",
    "478": "46,63,66",
    "479": "46,65,69",
    "480": "46,65,70",
    "481": "46,67",
    "482": "46,67,69",
    "483": "46,67,69,70",
    "484": "46,68,70",
    "485": "46,68,71",
    "486": "46,70,74",
    "487": "46,79",
    "488": "47",
    "489": "47,49,59,61",
    "490": "47,50,53,57",
    "491": "47,51,52,57,59,66",
    "492": "47,51,57,59,64",
    "493": "47,51,57,59,64,66",
    "494": "47,51,57,59,66",
    "495": "47,51,59,66",
    "496": "47,52,57,59,66",
    "497": "47,52,59,64",
    "498": "47,52,68",
    "499": "47,54,59,62,66",
    "500": "47,54,59,62,66,69",
    "501": "47,54,59,62,66,78",
    "502": "47,54,59,62,69,72",
    "503": "47,54,59,62,69,74",
    "504": "47,54,59,62,73",
    "505": "47,54,59,62,74",
    "506": "47,54,59,63",
    "507": "47,54,63,64,70,71",
    "508": "47,54,66",
    "509": "47,54,74,78,81",
    "510": "47,56,64,71,75",
    "511": "47,58",
    "512": "47,59",
    "513": "47,59,66,71,72",
    "514": "47,59,66,71,74",
    "515": "47,63,71",
    "516": "47,66",
    "517": "47,68",
    "518": "47,78",
    "519": "48",
    "520": "48,50,59,69",
    "521": "48,51,56,63",
    "522": "48,51,56,63,65",
    "523": "48,51,56,63,67",
    "524": "48,51,56,63,68",
    "525": "48,52,60,67,71",
    "526": "48,53,62,69,72",
    "527": "48,54,60,62,66,69",
    "528": "48,55",
    "529": "48,55,58,64,70,76",
    "530": "48,55,58,64,70,79,82",
    "531": "48,55,58,64,70,82",
    "532": "48,55,60,62,64,67",
    "533": "48,55,60,64,67",
    "534": "48,55,60,64,71,74",
    "535": "48,55,60,64,71,76",
    "536": "48,55,62,64,67",
    "537": "48,55,62,69",
    "538": "48,55,64,72",
    "539": "48,55,64,74",
    "540": "48,55,65,67,69",
    "541": "48,55,65,69",
    "542": "48,55,67",
    "543": "48,57,65,72",
    "544": "48,57,65,72,74",
    "545": "48,57,65,72,76",
    "546": "48,57,65,72,77",
    "547": "48,57,66,72",
    "548": "48,57,66,76",
    "549": "48,58",
    "550": "48,58,62,67",
    "551": "48,58,64,65,68,72",
    "552": "48,58,65,72",
    "553": "48,59,64,67",
    "554": "48,59,64,69",
    "555": "48,60",
    "556": "48,60,64,67",
    "557": "48,60,64,69",
    "558": "48,60,64,72,78",
    "559": "48,60,64,72,79",
    "560": "48,65,77",
    "561": "49,50,52,57,58,64",
    "562": "49,51,55,57,61",
    "563": "49,51,61,63",
    "564": "49,52,56,64",
    "565": "49,52,57,61",
    "566": "49,53,56,59,61",
    "567": "49,53,56,61",
    "568": "49,53,56,61,65,77",
    "569": "49,54,58,61",
    "570": "49,54,64,68,70",
    "571": "49,55",
    "572": "49,55,58,61",
    "573": "49,57,73,76",
    "574": "49,58",
    "575": "49,58,61,64,69",
    "576": "49,58,64,69",
    "577": "49,59,61,65,69,73",
    "578": "49,59,65",
    "579": "49,61",
    "580": "49,61,64,67,71",
    "581": "49,61,64,67,76",
    "582": "49,61,66,70,73",
    "583": "49,64,68",
    "584": "49,64,68,71",
    "585": "49,64,71",
    "586": "49,64,75",
    "587": "49,65",
    "588": "49,76,81",
    "589": "50",
    "590": "50,52,58,64",
    "591": "50,53,56",
    "592": "50,53,56,60",
    "593": "50,53,59",
    "594": "50,53,62,65,77",
    "595": "50,54,55,57",
    "596": "50,54,57,66",
    "597": "50,54,62",
    "598": "50,54,62,66,69",
    "599": "50,54,62,69",
    "600": "50,55,59,66",
    "601": "50,55,59,67",
    "602": "50,55,62,64,67,71",
    "603": "50,56,78",
    "604": "50,57",
    "605": "50,57,60,65",
    "606": "50,57,62,66",
    "607": "50,57,62,66,69",
    "608": "50,57,62,66,69,71",
    "609": "50,57,62,66,71",
    "610": "50,57,62,66,73",
    "611": "50,57,62,66,74",
    "612": "50,57,62,67",
    "613": "50,57,64,69",
    "614": "50,57,65,74",
    "615": "50,57,66,69,71",
    "616": "50,57,66,76",
    "617": "50,57,66,78",
    "618": "50,57,78",
    "619": "50,57,78,81",
    "620": "50,57,78,81,83",
    "621": "50,58",
    "622": "50,59,62",
    "623": "50,59,62,64,67",
    "624": "50,59,62,64,67,69",
    "625": "50,59,62,64,69",
    "626": "50,59,62,67",
    "627": "50,59,66",
    "628": "50,59,67",
    "629": "50,59,67,74,78",
    "630": "50,60,62,66,69,71,74",
    "631": "50,60,62,66,69,74",
    "632": "50,60,62,69,74",
    "633": "50,60,66",
    "634": "50,60,66,69",
    "635": "50,60,66,69,71",
    "636": "50,60,66,71,74",
    "637": "50,60,66,74,75",
    "638": "50,60,66,74,78",
    "639": "50,60,66,75,76",
    "640": "50,60,66,78,81",
    "641": "50,60,66,81",
    "642": "50,60,67,72,76,78",
    "643": "50,62",
    "644": "50,62,64,76",
    "645": "50,62,66,71",
    "646": "50,62,66,76",
    "647": "50,62,66,78",
    "648": "50,62,67,71,78",
